{
    "1" : {
        "caption" : "The first day",
        "include_post" : true,
        "id" : "1",
        "latitude" : "39.481",
        "longitude" : "-106.038",
        "date" : "7-14-11",
        "text" : "Since I couldn't hike anymore, I decided, heck, why not bike across the country instead?  I've always wondered if this would be something that I would enjoy, and I was about to find out... So here I am, leaving from Kelsi's house on my first day, with absolutely no idea what I was doing or how I was going to do it.  How can you not be excited by something like that?!?",
        "title" : "Day 1",
        "img" : "/img/breck-seattle-2011/7-14-11.jpg"
    },
    "2" : {
        "caption" : "",
        "include_post" : true,
        "id" : "2",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-15-11",
        "text" : "my first disaster!  I was barely out of Silverthorne (maybe 20 miles from the start) and a screw came loose on my rear bike rack, causing my paniers to fall backwards onto the road.  I almost gave up right then and there.  Only 20 miles down the road and stuff is already falling apart.  Luckily, my drama queen moment passed and I found the screw, tightened it back up, and kept going.  Crisis averted.",
        "title" : "Day 2",
        "img" : "/img/breck-seattle-2011/7-15-11.jpg"
    },
    "3" : {
        "caption" : "",
        "include_post" : true,
        "id" : "3",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-15-11",
        "text" : "Yup. That's one very long, very straight road.",
        "title" : "Day 2",
        "img" : "/img/breck-seattle-2011/7-15-11b.jpg"
    },
    "4" : {
        "caption" : "",
        "include_post" : true,
        "id" : "4",
        "latitude" : "41.001",
        "longitude" : "-106.405",
        "date" : "7-16-11",
        "text" : "Wyoming!  The states go by much quicker when you're on a bike vs. hiking",
        "title" : "Day 3",
        "img" : "/img/breck-seattle-2011/7-16-11.jpg"
    },
    "5" : {
        "caption" : "The teepees, part 1",
        "include_post" : true,
        "id" : "5",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-17-11",
        "text" : "Oh the teepees.... This was a very random right in Wyoming.  I had met this group of people a few days before and we basically had been biking together.  Anyway, we heard about this place with teepees and it was about the right distance away for the day's journey, so we decided to give it a chance.  It turned out to be one of the greatest nights of the trip.",
        "title" : "Day 4",
        "img" : "/img/breck-seattle-2011/7-17-11.jpg"
    },
    "5.1" : {
        "caption" : "The teepees, part 2",
        "include_post" : true,
        "id" : "5.1",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-17-11",
        "text" : "A thunderstorm rolled in right as the sun was setting.  It was pretty impressive... high winds, driving rain, cool lightning.  Wyoming was doing its best to impress us that night.",
        "title" : "Day 4",
        "img" : "/img/breck-seattle-2011/7-17-11b.jpg"
    },
    "6" : {
        "caption" : "",
        "include_post" : true,
        "id" : "6",
        "latitude" : "42.219",
        "longitude" : "-107.473",
        "date" : "7-18-11",
        "text" : "Not many people like Wyoming, but I love it, it has a very stark beauty to it",
        "title" : "Day 5",
        "img" : "/img/breck-seattle-2011/7-18-11.jpg"
    },
    "7" : {
        "caption" : "Wendy and Graeme",
        "include_post" : true,
        "id" : "7",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-18-11",
        "text" : "They're from New Zealand and are really lovely people.  Plus, I now have a free place to stay in NZ if I ever go there.  Anyone want to take a little vacation?",
        "title" : "Day 5",
        "img" : "/img/breck-seattle-2011/7-18-11b.jpg"
    },
    "8" : {
        "caption" : "",
        "include_post" : true,
        "id" : "8",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-18-11",
        "text" : "",
        "title" : "Day 5",
        "img" : "/img/breck-seattle-2011/7-18-11c.jpg"
    },
    "9" : {
        "caption" : "In the distance...",
        "include_post" : true,
        "id" : "9",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-20-11",
        "text" : "This picture makes me very sad... In the distance is the Wind River Range.  If I was still hiking the CDT, that's an area I would have eventually been going through.  It's suppose to be one of the most amazing experiences along the entire CDT.  Glacier might give it a run for its money, but the Winds are definitely up there.  Instead, I had to bike near them but never really get to see them.  It's ok if you cry a little for me, I understand.",
        "title" : "Day 7",
        "img" : "/img/breck-seattle-2011/7-20-11.jpg"
    },
    "10" : {
        "caption" : "",
        "include_post" : true,
        "id" : "10",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-20-11",
        "text" : "The Lander City Park.  Free Camping!  I loved Lander, it's such a great town",
        "title" : "Day 7",
        "img" : "/img/breck-seattle-2011/7-20-11b.jpg"
    },
    "11" : {
        "caption" : "",
        "include_post" : true,
        "id" : "11",
        "latitude" : "42.857",
        "longitude" : "-108.759",
        "date" : "7-20-11",
        "text" : "A typical scene after a day of biking.  We're all just sitting around, talking about life.  Well, probably mostly about food.  Let's see, in this picture we have Wendy, Graeme, Olive and Ben (newlyweds from Seattle/Canada), and Gary.  Gary was the old guy who could kick all of our asses when it came to biking the miles.  He was truly impressive.",
        "title" : "Day 7",
        "img" : "/img/breck-seattle-2011/7-20-11c.jpg"
    },
    "12" : {
        "caption" : "",
        "include_post" : true,
        "id" : "12",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-21-11",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/breck-seattle-2011/7-21-11.jpg"
    },
    "13" : {
        "caption" : "",
        "include_post" : true,
        "id" : "13",
        "latitude" : "43.558",
        "longitude" : "-109.691",
        "date" : "7-21-11",
        "text" : "Beautiful!  This is the road into Dubois, WY.",
        "title" : "Day 8",
        "img" : "/img/breck-seattle-2011/7-21-11b.jpg"
    },
    "14" : {
        "caption" : "",
        "include_post" : true,
        "id" : "14",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-22-11",
        "text" : "We crashed for the night in the rec room of a local church in Dubois.  It was kind of random, I guess they don't normally do this, but it worked.",
        "title" : "Day 9",
        "img" : "/img/breck-seattle-2011/7-22-11.jpg"
    },
    "15" : {
        "caption" : "Togowotee Pass",
        "include_post" : true,
        "id" : "15",
        "latitude" : "43.769",
        "longitude" : "-110.103",
        "date" : "7-22-11",
        "text" : "At the top of Togowotee Pass... This was a big climb and on the other side the Grand Tetons were waiting for us.  This was suppose to be a group photo, but I don't think the other members of the group got the memo.  I look very stylish though, check out those legs! :)",
        "title" : "Day 9",
        "img" : "/img/breck-seattle-2011/7-22-11b.jpg"
    },
    "16" : {
        "caption" : "",
        "include_post" : true,
        "id" : "16",
        "latitude" : "43.906",
        "longitude" : "-110.598",
        "date" : "7-22-11",
        "text" : "I'd never been here before, I had no idea the Grand Tetons were this amazing!",
        "title" : "Day 9",
        "img" : "/img/breck-seattle-2011/7-22-11c.jpg"
    },
    "17" : {
        "caption" : "",
        "include_post" : true,
        "id" : "17",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-23-11",
        "text" : "Just another day on the lake in a beautiful national park.  You know, just like any other day",
        "title" : "Day 10",
        "img" : "/img/breck-seattle-2011/7-23-11.jpg"
    },
    "18" : {
        "caption" : "",
        "include_post" : true,
        "id" : "18",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-24-11",
        "text" : "The great thing about northwest Wyoming is back-to-back National Parks.  First, the Grand Tetons, and then Yellowstone.  It was tourist hell, of course, but you had to expect that going in.  This is Old Faithful.  Lots of people for not a lot of excitement.  I'm not sure what the big deal is.",
        "title" : "Day 11",
        "img" : "/img/breck-seattle-2011/7-24-11.jpg"
    },
    "19" : {
        "caption" : "",
        "include_post" : true,
        "id" : "19",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-24-11",
        "text" : "I was much more impressed with the colored pools of boiling water than things like Old Faithful.  This stuff is really neat!",
        "title" : "Day 11",
        "img" : "/img/breck-seattle-2011/7-24-11b.jpg"
    },
    "20" : {
        "caption" : "",
        "include_post" : true,
        "id" : "20",
        "latitude" : "44.431",
        "longitude" : "-110.671",
        "date" : "7-24-11",
        "text" : "Gary, Olive, and Ben.  We rented a truck to drive around Yellowstone instead of biking.  I kind of think biking almost would have been easier, with a car you're always fighting traffic, looking for places to park.  On a bike, you can just zip on in and bypass all of that nonsense.",
        "title" : "Day 11",
        "img" : "/img/breck-seattle-2011/7-24-11c.jpg"
    },
    "21" : {
        "caption" : "",
        "include_post" : true,
        "id" : "21",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-24-11",
        "text" : "Mmmmmm.... this was a good day.  We were all a little tired of the mob of tourists, so we found a little path down to the river and went for a quiet soak.  It was close enough to one of the thermal areas that there were even spots in the river that were quite warm.  Even I stripped down and went into the water, it's practically a miracle!",
        "title" : "Day 11",
        "img" : "/img/breck-seattle-2011/7-24-11d.jpg"
    },
    "22" : {
        "caption" : "Norris Basin",
        "include_post" : true,
        "id" : "22",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-24-11",
        "text" : "This is a neat area",
        "title" : "Day 11",
        "img" : "/img/breck-seattle-2011/7-24-11e.jpg"
    },
    "23" : {
        "caption" : "Montana!",
        "include_post" : true,
        "id" : "23",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-25-11",
        "text" : "",
        "title" : "Day 12",
        "img" : "/img/breck-seattle-2011/7-25-11.jpg"
    },
    "24" : {
        "caption" : "",
        "include_post" : true,
        "id" : "24",
        "latitude" : "44.67",
        "longitude" : "-111.152",
        "date" : "7-25-11",
        "text" : "Haha, I loved this!  I met these 2 girls who were biking from Maine to Oregon.  Anyway, I came walking out of the grocery store with a strawberry-rhubarb pie for breakfast and they couldn't stop talking about it, so I let them dive into it too.  Then, of course, someone had to run back into the store for ice cream, and before you know it there we were: 3 dirty, sweaty, bikers sitting on the sidewalk in front of a grocery store eating an entire pie and bucket of ice cream for breakfast.  When in your life would you ever find yourself in this situation?  This is why I love doing what I do.",
        "title" : "Day 12",
        "img" : "/img/breck-seattle-2011/7-25-11b.jpg"
    },
    "25" : {
        "caption" : "",
        "include_post" : true,
        "id" : "25",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-27-11",
        "text" : "",
        "title" : "Day 14",
        "img" : "/img/breck-seattle-2011/7-27-11.jpg"
    },
    "26" : {
        "caption" : "",
        "include_post" : true,
        "id" : "26",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-27-11",
        "text" : "I thought this was horribly racist and tacky, so of course I had to take a picture.  But God Bless Montana, where stuff like this still exists.",
        "title" : "Day 14",
        "img" : "/img/breck-seattle-2011/7-27-11b.jpg"
    },
    "27" : {
        "caption" : "",
        "include_post" : true,
        "id" : "27",
        "latitude" : "45.679",
        "longitude" : "-113.946",
        "date" : "7-27-11",
        "text" : "I'm not trying to be an idiot and flash the peace sign here, if I remember correctly, that was suppose to be a 3, because I had climbed up and over 3 big passes that day.  My first 100-mile day would come shortly after this.  I was starting to get good at this whole biking thing!  One reason I was able to do such big miles was because our little group had broken up.  Wendy and Graeme had to take a few days off for an injury, Gary didn't want to ride up to Montana so he took a hard left and headed straight for Oregon, and I think Olive and Ben wanted some alone time, so we all went our separate ways :(",
        "title" : "Day 14",
        "img" : "/img/breck-seattle-2011/7-27-11c.jpg"
    },
    "28" : {
        "caption" : "Missoula, MT",
        "include_post" : true,
        "id" : "28",
        "latitude" : "46.902",
        "longitude" : "-114.023",
        "date" : "7-28-11",
        "text" : "I loved this town!  It's the perfect size, has a big university, and an interesting downtown.  What more do you need in a city?  I ended up staying here almost 2 days, which is un-heard of for me, but I really really liked Missoula.",
        "title" : "Day 15",
        "img" : "/img/breck-seattle-2011/7-28-11.jpg"
    },
    "29" : {
        "caption" : "Idaho",
        "include_post" : true,
        "id" : "29",
        "latitude" : "46.634",
        "longitude" : "-114.576",
        "date" : "7-31-11",
        "text" : "There's not much to Idaho up here, I crossed it in a few days, maybe even less.",
        "title" : "Day 18",
        "img" : "/img/breck-seattle-2011/7-31-11.jpg"
    },
    "30" : {
        "caption" : "",
        "include_post" : true,
        "id" : "30",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-31-11",
        "text" : "Randomness... I was just biking along, minding my own business when I see this on the side of the road.  Someone had left it there for me.  Awww, isn't that nice?  It didn't even occur to me that I should be worried about drinking it until I told the story to someone back home.  It's a sad state the world is in when you can't trust a random Gatorade left by a complete stranger on the side of the road.",
        "title" : "Day 18",
        "img" : "/img/breck-seattle-2011/7-31-11b.jpg"
    },
    "31" : {
        "caption" : "",
        "include_post" : true,
        "id" : "31",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-1-11",
        "text" : "I know this isn't a great picture, but it WAS a great night.  I was searching for a place to camp and every single spot in this campground was full (I hate weekends).  But the people in this one were nice enough to let me stay.  They even fed me.  Steak.  It was like I won the lottery.",
        "title" : "Day 19",
        "img" : "/img/breck-seattle-2011/8-1-11.jpg"
    },
    "32" : {
        "caption" : "Washington",
        "include_post" : true,
        "id" : "32",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-1-11",
        "text" : "Made it to Washington, the last state on the list.",
        "title" : "Day 19",
        "img" : "/img/breck-seattle-2011/8-1-11b.jpg"
    },
    "33" : {
        "caption" : "The Snake River",
        "include_post" : true,
        "id" : "33",
        "latitude" : "46.442",
        "longitude" : "-117.212",
        "date" : "8-1-11",
        "text" : "All of the dams on the river create these really beautiful areas",
        "title" : "Day 19",
        "img" : "/img/breck-seattle-2011/8-1-11c.jpg"
    },
    "34" : {
        "caption" : "",
        "include_post" : true,
        "id" : "34",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-2-11",
        "text" : "There were endless fields of wheat.  I had no idea Washington had something like that.  Why didn't anybody ever tell me these things?!?",
        "title" : "Day 20",
        "img" : "/img/breck-seattle-2011/8-2-11.jpg"
    },
    "35" : {
        "caption" : "",
        "include_post" : true,
        "id" : "35",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-2-11",
        "text" : "I liked Eastern Washington.  Sure, it was hot, but it would alternate between desert, fields of wheat, and then huge fields of fruit trees.  It was interesting.",
        "title" : "Day 20",
        "img" : "/img/breck-seattle-2011/8-2-11b.jpg"
    },
    "36" : {
        "caption" : "",
        "include_post" : true,
        "id" : "36",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-4-11",
        "text" : "",
        "title" : "Day 22",
        "img" : "/img/breck-seattle-2011/8-4-11.jpg"
    },
    "37" : {
        "caption" : "Steven's Pass",
        "include_post" : true,
        "id" : "37",
        "latitude" : "47.747",
        "longitude" : "-121.117",
        "date" : "8-4-11",
        "text" : "Steven's Pass and the PCT... No more CDT worries, now it's time to relive my PCT glory days.  The PCT goes right through Steven's Pass, so I went for a little hike (a VERY little hike, I was wearing biking shoes, which are not the most comfortable to walk in).  Even the PCT was still covered in snow, in July/August.  It's crazy, 2011 was a ridiculous snow year everywhere, not just on the CDT.  What in the world made me think that 2011 would be a good year to go hiking?  I'm really dumb sometimes.  And yes, I am flashing a peace sign here.  In addition to being really dumb, I'm also a dork.",
        "title" : "Day 22",
        "img" : "/img/breck-seattle-2011/8-4-11b.jpg"
    },
    "38" : {
        "caption" : "The cascades",
        "include_post" : true,
        "id" : "38",
        "latitude" : "47.764",
        "longitude" : "-122.383",
        "date" : "8-4-11",
        "text" : "The cascades were *very* pretty.  But I think that's it, I apparently didn't take any pictures of Seattle.  So overall, the bike ride was a huge success!  Sure, I had several mechanical issues, broke many spokes, had to buy and build a new rear wheel, etc, etc... But I never got lost, so that's an improvement over the CDT.  I really liked the ride, I met a lot of interesting people, and had a lot of fun.  Ugh, now I have TWO hobbies that require massive amounts of time and effort to complete.  How did I let this happen?  Don't worry, I'll be ok, I just need to finish the CDT.  I feel like it's a chain wrapped around my neck and I want to be done with it.  That sounds bad, I should hike it because I want to, not because I feel like I have to, right?  Anyway, that's enough babbling for now...",
        "title" : "Day 22",
        "img" : "/img/breck-seattle-2011/8-4-11c.jpg"
    }
}