{
    "1" : {
        "caption" : "Glacier National Park",
        "include_post" : true,
        "id" : "1",
        "latitude" : "48.996",
        "longitude" : "-113.659",
        "date" : "9-11-12",
        "text" : "This was the start of my final backpacking trip of 2012. I decided to hike Glacier National Park, mainly following the CDT. Glacier is suppose to be one of the most beautiful areas of the CDT and I wanted to hike it when the weather was nice and I didn't have to fight snow and carry an ice axe or use crampons or other crazy things that you have to do if you hike Glacier on a thru-hike. I just wanted to enjoy it.  So I actually started at the Canadian Border, it was just easier with the shuttle system to do the shuttle first and to then hike back to my car. Blah, blah, blah, not that anyone cares where my car was or how I got around.",
        "title" : "Day 1",
        "img" : "/img/cdt-2012/9-11-12.jpg"
    },
    "2" : {
        "caption" : "",
        "include_post" : true,
        "id" : "2",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-11-12",
        "text" : "",
        "title" : "Day 1",
        "img" : "/img/cdt-2012/9-11-12b.jpg"
    },
    "3" : {
        "caption" : "",
        "include_post" : true,
        "id" : "3",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-12-12",
        "text" : "The snow on these peaks is fresh from the night before. I figured that was a good sign. ",
        "title" : "Day 2",
        "img" : "/img/cdt-2012/9-12-12.jpg"
    },
    "4" : {
        "caption" : "",
        "include_post" : true,
        "id" : "4",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-12-12",
        "text" : "This was a really pretty high alpine meadow, along the highline trail. Everyone always talks about the highline trail in glacier like it's something scared and not-to-be-missed. I thought it was nice but overrated. Maybe I'm getting bitter and jaded in my old age?",
        "title" : "Day 2",
        "img" : "/img/cdt-2012/9-12-12b.jpg"
    },
    "5" : {
        "caption" : "",
        "include_post" : true,
        "id" : "5",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-12-12",
        "text" : "The second campsite of the trip. They have communal food prep and eating areas, which at first I thought would be a huge pain in the ass, but it turned out to be fantastic, you can actually meet and talk to the other hikers. For instance, these hikers carried Jiffy Pop for a week to have a special treat that night. Sadly, it didn't work, the popcorn never popped. Life just isn't fair sometimes.",
        "title" : "Day 2",
        "img" : "/img/cdt-2012/9-12-12c.jpg"
    },
    "6" : {
        "caption" : "",
        "include_post" : true,
        "id" : "6",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-13-12",
        "text" : "Sunset. No, wait, this was a sunrise. No, a sunset?  I can't remember anymore, and isn't all really the same anyway?",
        "title" : "Day 3",
        "img" : "/img/cdt-2012/9-13-12.jpg"
    },
    "7" : {
        "caption" : "",
        "include_post" : true,
        "id" : "7",
        "latitude" : "48.860",
        "longitude" : "-113.844",
        "date" : "9-13-12",
        "text" : "The Sue Lake overlook. I had to hike an extra 0.3 miles to get to this overlook. An extra 0.3 miles!! One way! That's over half a mile total. As you can tell, I'm really good at math. The view was worth it though. The stupid sun got in the way of the best pictures though. Stupid sun.",
        "title" : "Day 3",
        "img" : "/img/cdt-2012/9-13-12b.jpg"
    },
    "8" : {
        "caption" : "",
        "include_post" : true,
        "id" : "8",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-13-12",
        "text" : "I know this doesn't look like much, but it's actually the famous and feared Ahern Drift. You see, early in the hiking season, snow slumps down from the cliffs above the trail and forms an icy ~60 degree slope that must be crossed. One wrong move will result in instant death. Yes, that's right, *instant death*. The Ahern Drift strikes fear into the hearts of all thru-hikers who attempt Glacier in June. So much so that many of them will take easier alternate trails to avoid it, that's how much they fear this slab of ice. Obviously it loses a little of its luster as the summer rolls on.",
        "title" : "Day 3",
        "img" : "/img/cdt-2012/9-13-12c.jpg"
    },
    "9" : {
        "caption" : "",
        "include_post" : true,
        "id" : "9",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-13-12",
        "text" : "I believe this was the end of the highline trail for me. From this point I took the trail over Swiftcurrent pass to the touristy-resorty area of Many Glacier. Why? Simple, they have ice cream at Many Glacier. Oh the things I do for ice cream.",
        "title" : "Day 3",
        "img" : "/img/cdt-2012/9-13-12d.jpg"
    },
    "10" : {
        "caption" : "",
        "include_post" : true,
        "id" : "10",
        "latitude" : "48.745",
        "longitude" : "-113.739",
        "date" : "9-13-12",
        "text" : "From the top of Swiftcurrent Pass. I decided to do this thing where I take a picture of my feet instead of trying to get a bad photo of my face. I rather like it.",
        "title" : "Day 3",
        "img" : "/img/cdt-2012/9-13-12e.jpg"
    },
    "11" : {
        "caption" : "",
        "include_post" : true,
        "id" : "11",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-13-12",
        "text" : "The view from Swiftcurrent. This was suppose to be one of the most spectacular passes in Glacier. At this point I was underwhelmed and beginning to think that my trip to Glacier might be a bust.",
        "title" : "Day 3",
        "img" : "/img/cdt-2012/9-13-12f.jpg"
    },
    "12" : {
        "caption" : "",
        "include_post" : true,
        "id" : "12",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-13-12",
        "text" : "This, however, is why Swiftcurrent is awesome! They blasted the trail into the side of these cliffs. It was super impressive in person, but hard to really get a feel for the scope in pictures.",
        "title" : "Day 3",
        "img" : "/img/cdt-2012/9-13-12g.jpg"
    },
    "13" : {
        "caption" : "Lake Josephine",
        "include_post" : true,
        "id" : "13",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-14-12",
        "text" : "Lake Josphine",
        "title" : "Day 4",
        "img" : "/img/cdt-2012/9-14-12.jpg"
    },
    "14" : {
        "caption" : "",
        "include_post" : true,
        "id" : "14",
        "latitude" : "48.719",
        "longitude" : "-113.688",
        "date" : "9-14-12",
        "text" : "The trail up to Piegan Pass",
        "title" : "Day 4",
        "img" : "/img/cdt-2012/9-14-12b.jpg"
    },
    "15" : {
        "caption" : "",
        "include_post" : true,
        "id" : "15",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-14-12",
        "text" : "",
        "title" : "Day 4",
        "img" : "/img/cdt-2012/9-14-12c.jpg"
    },
    "16" : {
        "caption" : "",
        "include_post" : true,
        "id" : "16",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-14-12",
        "text" : "The one thing Glacier National Park seemed to be lacking were actual glaciers. This is what passes for a glacier here, to me it just looks like a sad little snow field. Most of the glaciers were like that, they are all disappearing. If you want to see them, better hurry, they're all suppose to be gone by 2020, or maybe 2030, either way, it's a shockingly short amount of time. You know, I'm not actually very confident that this is really a glacier, it might not be, I'm just a hiker, what do I know?",
        "title" : "Day 4",
        "img" : "/img/cdt-2012/9-14-12d.jpg"
    },
    "17" : {
        "caption" : "",
        "include_post" : true,
        "id" : "17",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-14-12",
        "text" : "Looking back on Piegan Pass. This really was one of my favorite passes of the park, there was just something about it.",
        "title" : "Day 4",
        "img" : "/img/cdt-2012/9-14-12e.jpg"
    },
    "18" : {
        "caption" : "",
        "include_post" : true,
        "id" : "18",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-14-12",
        "text" : "",
        "title" : "Day 4",
        "img" : "/img/cdt-2012/9-14-12f.jpg"
    },
    "19" : {
        "caption" : "",
        "include_post" : true,
        "id" : "19",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-14-12",
        "text" : "he open air, outdoor pit toilet! Yay! And yes, I did use it :)",
        "title" : "Day 4",
        "img" : "/img/cdt-2012/9-14-12g.jpg"
    },
    "20" : {
        "caption" : "",
        "include_post" : true,
        "id" : "20",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-15-12",
        "text" : "More pretty waterfalls",
        "title" : "Day 5",
        "img" : "/img/cdt-2012/9-15-12.jpg"
    },
    "21" : {
        "caption" : "",
        "include_post" : true,
        "id" : "21",
        "latitude" : "48.57",
        "longitude" : "-113.516",
        "date" : "9-15-12",
        "text" : "Triple divide pass. If I were to stand up at this moment, spin in a circle and pee, 1/3 of it would go to the pacific, 1/3 to the atlantic, and 1/3 to the hudson bay/arctic ocean. Neat, 'eh?",
        "title" : "Day 5",
        "img" : "/img/cdt-2012/9-15-12b.jpg"
    },
    "22" : {
        "caption" : "",
        "include_post" : true,
        "id" : "22",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-16-12",
        "text" : "Pitamakan Pass. Once you're at the top, you have the choice of going left and immediately down to Two Medicine (a campground/ranger station/road access). Or, you can turn right and traverse around Mt. Morgan, then around Flinsch Peak, and then over Dawson Pass to get to Two Medicine. The traverse around Mt. Morgan is suppose to be one of the most amazing in all of Glacier. Guess which way I went!",
        "title" : "Day 6",
        "img" : "/img/cdt-2012/9-16-12.jpg"
    },
    "23" : {
        "caption" : "",
        "include_post" : true,
        "id" : "23",
        "latitude" : "48.513",
        "longitude" : "-113.472",
        "date" : "9-16-12",
        "text" : "The west side of Morgan was spectacular, easily the best views in all of Glacier (that I saw, at least). It was worth the extra 3 or so miles to do it.  The pictures don't do it justice, it really was amazing.",
        "title" : "Day 6",
        "img" : "/img/cdt-2012/9-16-12b.jpg"
    },
    "24" : {
        "caption" : "",
        "include_post" : true,
        "id" : "24",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-16-12",
        "text" : "The trail around the mountain was, well, let's just say steep. Thank goodness there was no snow.",
        "title" : "Day 6",
        "img" : "/img/cdt-2012/9-16-12c.jpg"
    },
    "25" : {
        "caption" : "",
        "include_post" : true,
        "id" : "25",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-16-12",
        "text" : "Travis: 'There's no way I'm going out on that ledge'  Random Hiking Girl: 'Don't be an idiot'",
        "title" : "Day 6",
        "img" : "/img/cdt-2012/9-16-12d.jpg"
    },
    "26" : {
        "caption" : "",
        "include_post" : true,
        "id" : "26",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-16-12",
        "text" : "She was right.  I love this picture! Thank you, random hiking girl.",
        "title" : "Day 6",
        "img" : "/img/cdt-2012/9-16-12e.jpg"
    },
    "27" : {
        "caption" : "",
        "include_post" : true,
        "id" : "27",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-16-12",
        "text" : "",
        "title" : "Day 6",
        "img" : "/img/cdt-2012/9-16-12f.jpg"
    },
    "28" : {
        "caption" : "",
        "include_post" : true,
        "id" : "28",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-18-12",
        "text" : "",
        "title" : "Day 7",
        "img" : "/img/cdt-2012/9-18-12.jpg"
    },
    "29" : {
        "caption" : "",
        "include_post" : true,
        "id" : "29",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-18-12",
        "text" : "They had no intention of leaving, and why should they? They were there first, we were the ones interrupting their lunch. This seems like a good place to list the total animal count for my short week in Glacier: Sheep - 9, Bears - 6 (3 were cubs, none were close), Elk - a few, Deer - too many, Moose - 1, Bald Eagle - 1 (Probably, I just saw the ass end of it, but another hiker swore it was a bald eagle), CDT Thru-Hikers about to finish - 1 (Jim).  That's it.",
        "title" : "Day 7",
        "img" : "/img/cdt-2012/9-18-12b.jpg"
    },
    "30" : {
        "caption" : "",
        "include_post" : true,
        "id" : "30",
        "latitude" : "48.407",
        "longitude" : "-113.233",
        "date" : "7-6-13",
        "text" : "I know this CDT list sequence is a little confusing, it is for me too, and I'm the one who hiked it.  So I hiked the Glacier National Park section in 2012 as a quick, fall backpacking trip.  Then, in 2013 I decided to finish the rest of the CDT, so I started from when I left off after the GNP trip.  This particular trip also happens after I did a bike ride from Seattle to South Dakota (which should be in the adventure list).  So yeah, it's confusing and the CDT has become a jumbled mess, but this will be the last segment of it!",
        "title" : "Day 1",
        "img" : "/img/cdt-2013/7-6-13.jpg"
    },
    "31" : {
        "caption" : "",
        "include_post" : true,
        "id" : "31",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-6-13",
        "text" : "First bear on my first day. Yay!  So the total bear count: there was this guy and then 2 more in Montana (one walked within 20 yards of my campsite, and it sounded like he had friends with him, so let's just say I decided to move to a different location). Then there was pretty much a bear or two everyday in Yellowstone.  I finally broke down and bought some bear spray in Yellowstone, I only had to take it out once, a bear was walking down the trail towards me, not aggressively, it seemed like he just happened to be going in that direction. He finally turned away and went into the forest just before he got a little too close for comfort.",
        "title" : "Day 1",
        "img" : "/img/cdt-2013/7-6-13b.jpg"
    },
    "32" : {
        "caption" : "",
        "include_post" : true,
        "id" : "32",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-6-13",
        "text" : "Oh Glacier. I didn't actually hike through the pretty part of the park (I hiked it last year). It was almost painful to be this close to the good stuff and still go right on by.",
        "title" : "Day 1",
        "img" : "/img/cdt-2013/7-6-13c.jpg"
    },
    "33" : {
        "caption" : "",
        "include_post" : true,
        "id" : "33",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-6-13",
        "text" : "I technically did go through Glacier, but just the very southern edge of the park.  Someday I'll be back to hike it again, I have to, I love it too much to not do it again.",
        "title" : "Day 1",
        "img" : "/img/cdt-2013/7-6-13d.jpg"
    },
    "34" : {
        "caption" : "",
        "include_post" : true,
        "id" : "34",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-7-13",
        "text" : "My first full day, I did about 30 miles, which was probably not a good idea, but I guess I survived.",
        "title" : "Day 2",
        "img" : "/img/cdt-2013/7-7-13.jpg"
    },
    "35" : {
        "caption" : "Dean Lake",
        "include_post" : true,
        "id" : "35",
        "latitude" : "47.924",
        "longitude" : "-113.108",
        "date" : "7-7-13",
        "text" : "Dean Lake. Probably? I really should have my maps in front of me so that I can have a chance at identifying these things in my photos. Instead I think I'll just randomly guess, it's more fun that way.",
        "title" : "Day 4",
        "img" : "/img/cdt-2013/7-9-13.jpg"
    },
    "36" : {
        "caption" : "",
        "include_post" : true,
        "id" : "36",
        "latitude" : "47.689",
        "longitude" : "-113.150",
        "date" : "7-10-13",
        "text" : "The Chinese Wall. This is suppose to be one of the best parts of the Bob Marshall Wilderness. It was ok, not the most spectacular, but still nice.",
        "title" : "Day 5",
        "img" : "/img/cdt-2013/7-10-13.jpg"
    },
    "37" : {
        "caption" : "",
        "include_post" : true,
        "id" : "37",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-10-13",
        "text" : "",
        "title" : "Day 5",
        "img" : "/img/cdt-2013/7-10-13b.jpg"
    },
    "38" : {
        "caption" : "",
        "include_post" : true,
        "id" : "38",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-10-13",
        "text" : "This was a random lucky photo. I was hiking in dense forest and all of a sudden there was a break in the trees and a convenient meadow, giving me a great view. I love unexpected stuff like that.",
        "title" : "Day 5",
        "img" : "/img/cdt-2013/7-10-13c.jpg"
    },
    "39" : {
        "caption" : "Do I have to start wearing a helmet now?!?",
        "include_post" : true,
        "id" : "39",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-10-13",
        "text" : "The birds have declared war on my ass. I was hiking along, minding my own business when I felt something hit my head. I looked around and saw a bird fly away and land in a nearby tree. While I was standing there trying to identify it, it swooped down for a second attack. Apparently shrieking like a little girl is not an effective defense mechanism, because it got me again. After that I got the heck out of there. This hole in my hat was the only real damage. My poor hat, it'll get a lot worse later on....",
        "title" : "Day 5",
        "img" : "/img/cdt-2013/7-10-13d.jpg"
    },
    "40" : {
        "caption" : "",
        "include_post" : true,
        "id" : "40",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-11-13",
        "text" : "Butterflies were a constant companion during the many, many, MANY stream crossings. Thank goodness I was wearing my Chacos (sandals) for the first part of my hike, I didn't even have to think about the crossing, I just walked right through, and then laughed at the other hikers who had to sit down, take off their boots/shoes, put something else on... Chacos.  Why hike in anything else?",
        "title" : "Day 6",
        "img" : "/img/cdt-2013/7-11-13.jpg"
    },
    "41" : {
        "caption" : "",
        "include_post" : true,
        "id" : "41",
        "latitude" : "47.093",
        "longitude" : "-112.785",
        "date" : "7-12-13",
        "text" : "Finally up on the Divide. The first part of my hike was mostly along river valleys, which was nice hiking, but not much for views. This part of the trail finally went higher.",
        "title" : "Day 7",
        "img" : "/img/cdt-2013/7-12-13.jpg"
    },
    "42" : {
        "caption" : "",
        "include_post" : true,
        "id" : "42",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-12-13",
        "text" : "Helpful hints from previous hikers. The trail isn't exactly 'well-marked', so sometimes we have to help each other out.",
        "title" : "Day 7",
        "img" : "/img/cdt-2013/7-12-13b.jpg"
    },
    "43" : {
        "caption" : "",
        "include_post" : true,
        "id" : "43",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-12-13",
        "text" : "I got blasted by an afternoon thunderstorm, right on top of a ridge, winds so strong I could barely move. There *was* a pretty rainbow afterwards though, so I guess that makes it worth it?",
        "title" : "Day 7",
        "img" : "/img/cdt-2013/7-12-13c.jpg"
    },
    "44" : {
        "caption" : "",
        "include_post" : true,
        "id" : "44",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-13-13",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/cdt-2013/7-13-13.jpg"
    },
    "45" : {
        "caption" : "",
        "include_post" : true,
        "id" : "45",
        "latitude" : "46.481",
        "longitude" : "-112.270",
        "date" : "7-14-13",
        "text" : "Isn't this a pretty scene? A nice pasture, cows, it's all very peaceful, right? What this photo doesn't show is that this little stream is the only water source for ~20 miles (you can't really see it, but there is a stream). Oh look, I think you can see a cow pooping directly into the water. How lovely. Wait, correction, there was another water source, a fenced-off spring a few miles back. The spring was a tank of water with a lid; guess what I found when I opened the lid? That's right, a couple of dead animals floating in the water. Well, those are your choices: dead animal water or cow sh*t water. Which would you prefer? These are the choices we often have to make on the CDT.",
        "title" : "Day 9",
        "img" : "/img/cdt-2013/7-14-13.jpg"
    },
    "46" : {
        "caption" : "",
        "include_post" : true,
        "id" : "46",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-15-13",
        "text" : "Lots of wild flowers at the beginning of the hike.",
        "title" : "Day 10",
        "img" : "/img/cdt-2013/7-15-13.jpg"
    },
    "47" : {
        "caption" : "",
        "include_post" : true,
        "id" : "47",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-17-13",
        "text" : "I really like this photo",
        "title" : "Day 12",
        "img" : "/img/cdt-2013/7-17-13.jpg"
    },
    "48" : {
        "caption" : "",
        "include_post" : true,
        "id" : "48",
        "latitude" : "45.881",
        "longitude" : "-112.114",
        "date" : "7-19-13",
        "text" : "Getting close to Butte, the terrain was definitely getting more desert-like. I did *not* sign up for desert hiking, well, except for the Great Divide Basin, but that's another story.  Somewhere around here was my first town stop: Whitehall, Montana (12 days into the hike. Yikes!). It's not even a regular CDT town, but from this point I was taking an alternate east to Yellowstone to see more of the park. Anyway, all I wanted was about 20 burgers from McDonald's, but the town didn't have one. It's right off of the interstate, any exit on an interstate should have a McD's, it should be some sort of law.",
        "title" : "Day 14",
        "img" : "/img/cdt-2013/7-19-13.jpg"
    },
    "49" : {
        "caption" : "",
        "include_post" : true,
        "id" : "49",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-19-13",
        "text" : "Gotta love it",
        "title" : "Day 14",
        "img" : "/img/cdt-2013/7-19-13b.jpg"
    },
    "50" : {
        "caption" : "",
        "include_post" : true,
        "id" : "50",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-20-13",
        "text" : "Guess who hiked over the road anyway :) In my defense, this was the only road over the pass to the other side of the mountains, and there was no such sign on the other side where I started.",
        "title" : "Day 15",
        "img" : "/img/cdt-2013/7-20-13.jpg"
    },
    "51" : {
        "caption" : "Ennis Lake",
        "include_post" : true,
        "id" : "51",
        "latitude" : "45.432",
        "longitude" : "-111.689",
        "date" : "7-20-13",
        "text" : "Ennis Lake. There was a little public campground at the lake (free!) and before the lake there was suppose to be a little bar/restaurant, but it was closed (NO!!), but luckily people camped at the lake took pity on my and gave me food (delicious!), and as an added bonus it was such a pretty sunset (beautiful!).",
        "title" : "Day 15",
        "img" : "/img/cdt-2013/7-20-13b.jpg"
    },
    "52" : {
        "caption" : "",
        "include_post" : true,
        "id" : "52",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-21-13",
        "text" : "Up in the Spanish Peaks, the next range after the Tobacco Mtns. I really liked the Spanish Peaks, they were gorgeous.",
        "title" : "Day 16",
        "img" : "/img/cdt-2013/7-21-13.jpg"
    },
    "53" : {
        "caption" : "",
        "include_post" : true,
        "id" : "53",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-21-13",
        "text" : "",
        "title" : "Day 16",
        "img" : "/img/cdt-2013/7-21-13b.jpg"
    },
    "54" : {
        "caption" : "",
        "include_post" : true,
        "id" : "54",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-22-13",
        "text" : "Love this photo. I do get lucky every once-in-a-while and get a good shot.",
        "title" : "Day 17",
        "img" : "/img/cdt-2013/7-22-13.jpg"
    },
    "55" : {
        "caption" : "",
        "include_post" : true,
        "id" : "55",
        "latitude" : "45.38",
        "longitude" : "-111.42",
        "date" : "7-22-13",
        "text" : "More pretty photos of the Spanish Peaks. It's too bad more CDT hikers don't see this area.",
        "title" : "Day 17",
        "img" : "/img/cdt-2013/7-22-13b.jpg"
    },
    "56" : {
        "caption" : "",
        "include_post" : true,
        "id" : "56",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-22-13",
        "text" : "The extent of my snow encounters for this trip. Now this I can handle! Much better than the snowpocalyspe that I tried to hike through in 2011.",
        "title" : "Day 17",
        "img" : "/img/cdt-2013/7-22-13c.jpg"
    },
    "57" : {
        "caption" : "",
        "include_post" : true,
        "id" : "57",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-22-13",
        "text" : "I thought that this was the pass the trail was going over. It looks like a nice, reasonable pass, right? Of course that would be too easy, my trail went straight up a much rockier, cliffier pass. It's the first rule in trail building: Why go over an easy pass when you can hike over scary cliffs.",
        "title" : "Day 17",
        "img" : "/img/cdt-2013/7-22-13d.jpg"
    },
    "58" : {
        "caption" : "",
        "include_post" : true,
        "id" : "58",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-22-13",
        "text" : "",
        "title" : "Day 17",
        "img" : "/img/cdt-2013/7-22-13e.jpg"
    },
    "59" : {
        "caption" : "",
        "include_post" : true,
        "id" : "59",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-23-13",
        "text" : "Yes, the water really was a green color, but it looks nice in the picture.",
        "title" : "Day 18",
        "img" : "/img/cdt-2013/7-23-13.jpg"
    },
    "60" : {
        "caption" : "Skyrim Trail (Yellowstone Nat'l Park)",
        "include_post" : true,
        "id" : "60",
        "latitude" : "45.002",
        "longitude" : "-111.014",
        "date" : "7-23-13",
        "text" : "This is Yellowstone!!  I love Yellowstone, I geek out over the thermal features, so I wanted to see what hiking the backcountry of Yellowstone was like. It was nice hiking, but all of the good thermal stuff is along roads. At least now I know.",
        "title" : "Day 18",
        "img" : "/img/cdt-2013/7-23-13b.jpg"
    },
    "61" : {
        "caption" : "",
        "include_post" : true,
        "id" : "61",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-23-13",
        "text" : "A slightly scary section, the trail goes straight across a cliff. I took one look at this and said, 'Oh hell no.' Then of course I did it, and it really wasn't that bad. If I had another option I probably would have taken it, so I'm actually glad the cliff was my only option, it's good for me to do these things.",
        "title" : "Day 18",
        "img" : "/img/cdt-2013/7-23-13c.jpg"
    },
    "62" : {
        "caption" : "",
        "include_post" : true,
        "id" : "62",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-23-13",
        "text" : "I'm pretty sure this was meant to show my anxiety about hiking across the cliff. I look quite happy, don't I?",
        "title" : "Day 18",
        "img" : "/img/cdt-2013/7-23-13d.jpg"
    },
    "63" : {
        "caption" : "",
        "include_post" : true,
        "id" : "63",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-25-13",
        "text" : "Yay!! My first thermal features in Yellowstone.",
        "title" : "Day 20",
        "img" : "/img/cdt-2013/7-25-13.jpg"
    },
    "64" : {
        "caption" : "",
        "include_post" : true,
        "id" : "64",
        "latitude" : "44.967",
        "longitude" : "-110.706",
        "date" : "7-25-13",
        "text" : "Mammoth Hot Springs. I almost had a little panic attack when I was walking into this place, there were just people everywhere, and they all smelled like soap. You probably have to be a thru-hiker to understand that.",
        "title" : "Day 20",
        "img" : "/img/cdt-2013/7-25-13b.jpg"
    },
    "65" : {
        "caption" : "",
        "include_post" : true,
        "id" : "65",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-26-13",
        "text" : "There were some nice bridges in Yellowstone, which is good, because I really did not want to try and ford that particular river.",
        "title" : "Day 21",
        "img" : "/img/cdt-2013/7-26-13.jpg"
    },
    "66" : {
        "caption" : "",
        "include_post" : true,
        "id" : "66",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-26-13",
        "text" : "",
        "title" : "Day 21",
        "img" : "/img/cdt-2013/7-26-13b.jpg"
    },
    "67" : {
        "caption" : "",
        "include_post" : true,
        "id" : "67",
        "latitude" : "44.828",
        "longitude" : "-110.254",
        "date" : "7-27-13",
        "text" : "A neat elk antler pile at the top of Amethyst Mountain on Specimen Ridge.",
        "title" : "Day 22",
        "img" : "/img/cdt-2013/7-27-13.jpg"
    },
    "68" : {
        "caption" : "The most useful bridge in the world",
        "include_post" : true,
        "id" : "68",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-28-13",
        "text" : "I'm not sure that this bridge is living up to its full potential.",
        "title" : "Day 24",
        "img" : "/img/cdt-2013/7-28-13.jpg"
    },
    "69" : {
        "caption" : "",
        "include_post" : true,
        "id" : "69",
        "latitude" : "44.430",
        "longitude" : "-110.293",
        "date" : "7-28-13",
        "text" : "Camping right on Yellowstone Lake. Don't worry, it was an actual campsite, I wasn't doing anything illegal (for once).",
        "title" : "Day 24",
        "img" : "/img/cdt-2013/7-28-13b.jpg"
    },
    "70" : {
        "caption" : "",
        "include_post" : true,
        "id" : "70",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-29-13",
        "text" : "My last shot of Yellowstone. It actually felt like quite an accomplishment to hike the entire park from the NW to the SE corner, and it only took like 4 or 5 days. Not bad.",
        "title" : "Day 25",
        "img" : "/img/cdt-2013/7-29-13.jpg"
    },
    "71" : {
        "caption" : "",
        "include_post" : true,
        "id" : "71",
        "latitude" : "44.041",
        "longitude" : "-110.167",
        "date" : "7-30-13",
        "text" : "The parting of the waters! The Continental Divide separates water that flows to the Atlantic from the water that goes to the Pacific, but rarely does it actually split a stream, but in this place it does, you can see it in the next picture...",
        "title" : "Day 26",
        "img" : "/img/cdt-2013/7-30-13.jpg"
    },
    "72" : {
        "caption" : "",
        "include_post" : true,
        "id" : "72",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-30-13",
        "text" : "Isn't that awesome? One side goes to the Atlantic and the other to the Pacific.  But which is which?!?",
        "title" : "Day 26",
        "img" : "/img/cdt-2013/7-30-13b.jpg"
    },
    "73" : {
        "caption" : "",
        "include_post" : true,
        "id" : "73",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-30-13",
        "text" : "After my long, long alternate through Yellowstone, I was finally back on the official CDT. In a way it felt good to be back on the CDT, but it was nice being on my own and going wherever I felt like going. I enjoyed that freedom.",
        "title" : "Day 26",
        "img" : "/img/cdt-2013/7-30-13c.jpg"
    },
    "74" : {
        "caption" : "",
        "include_post" : true,
        "id" : "74",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-30-13",
        "text" : "Of course, as soon as I was back on the CDT the next comment on my maps was, 'This junction is not marked and is easy to miss so watch out for it.' Ahhh, it's good to be back on the CDT, where you're always confused and never really know where you are.",
        "title" : "Day 26",
        "img" : "/img/cdt-2013/7-30-13d.jpg"
    },
    "75" : {
        "caption" : "",
        "include_post" : true,
        "id" : "75",
        "latitude" : "",
        "longitude" : "",
        "date" : "7-30-13",
        "text" : "My north bounders!! They were a group of 7 hiking north and it looked like they were having SO much fun. I was jealous and wanted to turn around and join them.",
        "title" : "Day 26",
        "img" : "/img/cdt-2013/7-30-13e.jpg"
    },
    "76" : {
        "caption" : "Brooks Lake",
        "include_post" : true,
        "id" : "76",
        "latitude" : "43.754",
        "longitude" : "-110.003",
        "date" : "7-31-13",
        "text" : "Brooks Lake is home to the Brooks Lake Lodge. The most wonderful place on the trail. Well, at least that day it was. I sent a resupply package here, but as an added bonus the chef at this place came outside and gave me a stack of cookies and then invited me to eat lunch with the employees (calzones and salad, so delicious!). It was wonderful. Again, magical, good ole trail magic.",
        "title" : "Day 27",
        "img" : "/img/cdt-2013/7-31-13.jpg"
    },
    "77" : {
        "caption" : "",
        "include_post" : true,
        "id" : "77",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-1-13",
        "text" : "Hahahaha, exactly what I was thinking at this point. The trail was crap here, the next picture has the story...",
        "title" : "Day 28",
        "img" : "/img/cdt-2013/8-1-13b.jpg"
    },
    "77.1" : {
        "caption" : "",
        "include_post" : true,
        "id" : "77.1",
        "latitude" : "43.598",
        "longitude" : "-109.965",
        "date" : "8-1-13",
        "text" : "This is Fish Lake Pass, and I had a horrible time getting here. I know what you're thinking: 'But Travis, there's a road leading to it, how difficult could it be?' To which I reply: 'Aaaaggggghhhh!!! Come here so I can stab you in the eye with a rusty spoon.' Let me explain...  To get here you start out on a nice forest service road, which was fine, but then that nice road turned into a crappy road, which turned into barely a road, but you could still follow it. At that point you had to turn right onto a 'road' that hasn't seen anything other than cows in decades (and it's not marked), so you're not exactly sure it's your road, but you take it anyway because what else are you going to do? Then this cow trail disappears and you're left bushwacking through the shrubs along a creek, but every now and then there are bits of trail, so it's ok. Then you have to turn right onto a trail, which of course is not marked, but you turn right anyway, because what else are you going to do? Then after a few hundred yards that trail disappears, but it's ok because in this area there are orange snowmobile diamonds to follow, so that's fine, but you can't follow them forever because eventually you have to turn left and follow a creek. It's not marked, and at this point you're on the divide, so there's no creek way up there, you just have to guess where there *might* be a creek further down the mountain, but you turn left anyway, because what else are you going to do? You get lucky and there is a creek, but you don't really know if it's *your* creek because there's no trail, but you follow it anyway. Eventually you see faint signs of an old road, and you're so happy to see anything man-made that you run for it not caring where it leads, but it eventually turns into a nicer road that ends up at Fish Lake Pass and is actually the road you see in this picture. And that, my friends, is just a normal day on the CDT and why there are times when I just want to curl up in a little ball under a pine tree and cry.",
        "title" : "Day 28",
        "img" : "/img/cdt-2013/8-1-13.jpg"
    },
    "79" : {
        "caption" : "",
        "include_post" : true,
        "id" : "79",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-1-13",
        "text" : "Typical of Wyoming. A high desert area leading to mysterious, beautiful mountains in the distance. Some people see a wall of mountain like this and get scared. Some get excited. And some get close enough to take a pretty picture and then run away before anything exciting can happen.",
        "title" : "Day 28",
        "img" : "/img/cdt-2013/8-1-13c.jpg"
    },
    "80" : {
        "caption" : "",
        "include_post" : true,
        "id" : "80",
        "latitude" : "43.216",
        "longitude" : "-109.789",
        "date" : "8-3-13",
        "text" : "On my way up to one of the first big passes in the Winds!  I've been waiting for the Winds for years. Years. They are suppose to be absolutely amazing (and they lived up to that promise).",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13.jpg"
    },
    "81" : {
        "caption" : "",
        "include_post" : true,
        "id" : "81",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "It's such a pretty lake...",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13b.jpg"
    },
    "82" : {
        "caption" : "",
        "include_post" : true,
        "id" : "82",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13c.jpg"
    },
    "83" : {
        "caption" : "",
        "include_post" : true,
        "id" : "83",
        "latitude" : "43.154",
        "longitude" : "-109.661",
        "date" : "8-3-13",
        "text" : "Heading up to Knapsack Col. It was an off-trail, cross-country route, but once you got up there it was suppose to be one of the most amazing places on the entire CDT. How could I pass it up?!?",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13d.jpg"
    },
    "84" : {
        "caption" : "",
        "include_post" : true,
        "id" : "84",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "I don't think I took a picture of it, but when I was trying to get to Knapsack there were 2 potential passes that I could hike over. I tried to figure out for sure which one I was suppose to go over, but I had no idea. In the end I just picked one and crossed my fingers.",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13e.jpg"
    },
    "85" : {
        "caption" : "",
        "include_post" : true,
        "id" : "85",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "Of course, I picked the wrong one.  Is there really any other option for me at this point?  This is the other side of the 'wrong' pass. Once I saw this I knew I had screwed up horribly. How? Because there's a lake down there (Summer Ice Lake), and there was NOT suppose to be a lake in that spot. So I knew that either the map was wrong or I had hiked over the wrong pass. Clearly the map was wrong, because I never ever make mistakes.  But this one time, and only this one time, I seemed to have made a slight miscalculation, and there was no doubt, I definitely screwed up.... I hiked over the wrong glacier. It happens.",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13f.jpg"
    },
    "86" : {
        "caption" : "Don't hike to that pass!",
        "include_post" : true,
        "id" : "86",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "That's the 'wrong' pass. It was horrible and scary. I know what you're thinking: 'But Travis, it doesn't look that bad.' To which I reply: 'Aaaaaaggggghhhh!!!! Come here so I can kick you in the shins repeatedly.'  I'd try and explain why it was so horrible, but I think it's something you just have to experience for yourself. Let's just say that it involves hiking down a steep glacier, big boulders that were not stable, lots of loose rock and gravel, and a few cliffs thrown in for fun. Plus, I had no idea if there was even a hikeable route down to the basin below, I just went for it. I got lucky and made it out intact. It could have been so much worse. At least there was a pretty view with a lake, so that makes it all worthwhile.",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13g.jpg"
    },
    "87" : {
        "caption" : "Summer Ice Lake.  At least it's pretty.",
        "include_post" : true,
        "id" : "87",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "Yup, that's the lake at the bottom that I hiked down to. To complicate matters, I didn't know which side of the lake to hike (the left/right side), I potentially could have taken either one. One side led to a way down, the other side ended in a waterfall and certain death. For once I picked the correct route.",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13h.jpg"
    },
    "88" : {
        "caption" : "",
        "include_post" : true,
        "id" : "88",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "This is back on the actual trail.  It's one of my favorite shots of the entire hike.",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13i.jpg"
    },
    "89" : {
        "caption" : "",
        "include_post" : true,
        "id" : "89",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-3-13",
        "text" : "",
        "title" : "Day 30",
        "img" : "/img/cdt-2013/8-3-13j.jpg"
    },
    "90" : {
        "caption" : "",
        "include_post" : true,
        "id" : "90",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-4-13",
        "text" : "",
        "title" : "Day 31",
        "img" : "/img/cdt-2013/8-4-13.jpg"
    },
    "91" : {
        "caption" : "",
        "include_post" : true,
        "id" : "91",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-5-13",
        "text" : "The Cirque of the Towers, as seen from the incorrect west side (just because the east side is spectacularly gorgous.  the west side is plain and boring). To view them from the correct east side required another off-trail, cross-country route. You'd think I would have learned from Knapsack Col, but I couldn't pass up the Cirque!",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13.jpg"
    },
    "92" : {
        "caption" : "",
        "include_post" : true,
        "id" : "92",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-5-13",
        "text" : "",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13b.jpg"
    },
    "93" : {
        "caption" : "",
        "include_post" : true,
        "id" : "93",
        "latitude" : "42.783",
        "longitude" : "-109.231",
        "date" : "8-5-13",
        "text" : "It's hard to capture the awesomeness of the Cirque with pictures, but trust me, it's not something to be missed",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13c.jpg"
    },
    "94" : {
        "caption" : "",
        "include_post" : true,
        "id" : "94",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-5-13",
        "text" : "Argh!! Once again I hiked over the wrong pass! I was suppose to be on the other side of this lake. This mistake wasn't so bad though, I just had to rock hop along the western edge of the lake for an hour or so and then there was a little trail to connect to the 'correct' one.",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13d.jpg"
    },
    "95" : {
        "caption" : "",
        "include_post" : true,
        "id" : "95",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-5-13",
        "text" : "That's the pass I was suppose to climb over. *sigh* I really need to learn how to read a map.  Seriously, I need someone to hike with me to say, 'No! Bad Travis! That's the wrong pass!!'",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13e.jpg"
    },
    "96" : {
        "caption" : "",
        "include_post" : true,
        "id" : "96",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-5-13",
        "text" : "I wonder if Luke figured this out? :)",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13f.jpg"
    },
    "97" : {
        "caption" : "",
        "include_post" : true,
        "id" : "97",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-5-13",
        "text" : "Yup, you really do just walk up a gigantic granite slab for a few miles.",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13g.jpg"
    },
    "98" : {
        "caption" : "",
        "include_post" : true,
        "id" : "98",
        "latitude" : "42.687",
        "longitude" : "-109.15",
        "date" : "8-5-13",
        "text" : "Heading up to Temple Pass. I actually thought this area was better than the Cirque, it was pretty impressive.  And luckily, it's very hard to screw up hiking to Temple Pass, even I couldn't mess this one up",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13h.jpg"
    },
    "99" : {
        "caption" : "",
        "include_post" : true,
        "id" : "99",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-5-13",
        "text" : "",
        "title" : "Day 32",
        "img" : "/img/cdt-2013/8-5-13j.jpg"
    },
    "100" : {
        "caption" : "",
        "include_post" : true,
        "id" : "100",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-6-13",
        "text" : "The view back as I was leaving the Winds. As amazing as the Winds were, it was a pretty short section, 3 or 4 days is all it took to hike through it.",
        "title" : "Day 33",
        "img" : "/img/cdt-2013/8-6-13.jpg"
    },
    "101" : {
        "caption" : "",
        "include_post" : true,
        "id" : "101",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-6-13",
        "text" : "I got a little lost in the Wyoming sage brush (I don't even know how such a thing is possible), and was quite happy to finally see a CDT marker.",
        "title" : "Day 33",
        "img" : "/img/cdt-2013/8-6-13b.jpg"
    },
    "102" : {
        "caption" : "",
        "include_post" : true,
        "id" : "102",
        "latitude" : "42.496",
        "longitude" : "-108.730",
        "date" : "8-6-13",
        "text" : "Atlantic City! Best burgers on the trail. This was the last stop before the Great Divide Basin. The Basin is basically a huge desert wasteland. I was a little scared of it, because I was worried it would be hot and miserable and there would be no water. It turned out to be fine.",
        "title" : "Day 33",
        "img" : "/img/cdt-2013/8-6-13c.jpg"
    },
    "103" : {
        "caption" : "",
        "include_post" : true,
        "id" : "103",
        "latitude" : "42.346",
        "longitude" : "-108.288",
        "date" : "8-7-13",
        "text" : "The Basin. It all pretty much looked like this, just nothing for as far as you can see.",
        "title" : "Day 34",
        "img" : "/img/cdt-2013/8-7-13.jpg"
    },
    "104" : {
        "caption" : "",
        "include_post" : true,
        "id" : "104",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-7-13",
        "text" : "This guy was guarding one of the water sources. A creepy clown, but was he there for good or evil? I didn't get sick from the water, so he probably wasn't evil.",
        "title" : "Day 34",
        "img" : "/img/cdt-2013/8-7-13b.jpg"
    },
    "105" : {
        "caption" : "",
        "include_post" : true,
        "id" : "105",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-7-13",
        "text" : "The Basin, showing off her sunset colors. Say what you want about this area, but the sunset/sunrises were gorgeous, and unless you were behind a hill, there was nothing at all to block your view.",
        "title" : "Day 34",
        "img" : "/img/cdt-2013/8-7-13c.jpg"
    },
    "106" : {
        "caption" : "",
        "include_post" : true,
        "id" : "106",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-8-13",
        "text" : "This was suppose to be my artistic black and white shot of the Basin",
        "title" : "Day 35",
        "img" : "/img/cdt-2013/8-8-13b.jpg"
    },
    "107" : {
        "caption" : "",
        "include_post" : true,
        "id" : "107",
        "latitude" : "41.901",
        "longitude" : "-107.634",
        "date" : "8-9-13",
        "text" : "I actually did think that the Basin was pretty, and it helped that it was cloudy and relatively cool while I was hiking it, so overall I enjoyed it! Plus one of the nights, I think it was the day after Rawlins, I woke up in the middle of the night to a meteor shower. I laugh at myself, because I would wake up, see a meteor and think, 'Oh, that's neat', and immediately go back to sleep. Apparently sleep trumps all.",
        "title" : "Day 36",
        "img" : "/img/cdt-2013/8-9-13.jpg"
    },
    "108" : {
        "caption" : "",
        "include_post" : true,
        "id" : "108",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-11-13",
        "text" : "You gotta love it. I was hiding from the sun in this concrete shell on the side of the road. It worked well too.",
        "title" : "Day 38",
        "img" : "/img/cdt-2013/8-11-13.jpg"
    },
    "109" : {
        "caption" : "",
        "include_post" : true,
        "id" : "109",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-13-13",
        "text" : "Wyoming's last gift for me, a thunder-hail storm. I was hiding under a pine tree trying to avoid the hail.",
        "title" : "Day 39",
        "img" : "/img/cdt-2013/8-13-13.jpg"
    },
    "110" : {
        "caption" : "",
        "include_post" : true,
        "id" : "110",
        "latitude" : "41.002",
        "longitude" : "-106.787",
        "date" : "8-13-13",
        "text" : "The border between WY and CO wasn't marked, so hikers had to do what hikers do best, and take care of the problem themselves. Now this is a border crossing that you're not going to miss!",
        "title" : "Day 39",
        "img" : "/img/cdt-2013/8-13-13b.jpg"
    },
    "111" : {
        "caption" : "",
        "include_post" : true,
        "id" : "111",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-14-13",
        "text" : "Follow the cairns to Lost Ranger Peak. The first decent mountain you hit in Colorado.",
        "title" : "Day 40",
        "img" : "/img/cdt-2013/8-14-13.jpg"
    },
    "112" : {
        "caption" : "",
        "include_post" : true,
        "id" : "112",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-14-13",
        "text" : "",
        "title" : "Day 40",
        "img" : "/img/cdt-2013/8-14-13b.jpg"
    },
    "113" : {
        "caption" : "",
        "include_post" : true,
        "id" : "113",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-17-13",
        "text" : "",
        "title" : "Day 43",
        "img" : "/img/cdt-2013/8-17-13.jpg"
    },
    "114" : {
        "caption" : "Willow Creek Pass",
        "include_post" : true,
        "id" : "114",
        "latitude" : "40.350",
        "longitude" : "-106.092",
        "date" : "8-17-13",
        "text" : "Willow Creek Pass! I only included this because when I did my first bike tour from Breck to Seattle this pass was the first one I crossed (or one of the first, I can't remember for sure) and I remember being so worried because it seemed so high and I didn't know if I'd be able to bike over it (I did). Then when I was hiking I was annoyed because the pass was so low and I had to lose a ton of elevation to cross it. Same pass, 2 very different problems. It's amazing how quickly your perspective can change.",
        "title" : "Day 43",
        "img" : "/img/cdt-2013/8-17-13b.jpg"
    },
    "115" : {
        "caption" : "",
        "include_post" : true,
        "id" : "115",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-18-13",
        "text" : "",
        "title" : "Day 44",
        "img" : "/img/cdt-2013/8-18-13.jpg"
    },
    "116" : {
        "caption" : "",
        "include_post" : true,
        "id" : "116",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-20-13",
        "text" : "",
        "title" : "Day 46",
        "img" : "/img/cdt-2013/8-20-13.jpg"
    },
    "117" : {
        "caption" : "",
        "include_post" : true,
        "id" : "117",
        "latitude" : "39.852",
        "longitude" : "-105.690",
        "date" : "8-20-13",
        "text" : "On the way up to James Peak. There were scary looking clouds around all day, so I was a little nervous about climbing this mountain (it's a 13er), but I did anyway.",
        "title" : "Day 46",
        "img" : "/img/cdt-2013/8-20-13b.jpg"
    },
    "118" : {
        "caption" : "",
        "include_post" : true,
        "id" : "118",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-20-13",
        "text" : "",
        "title" : "Day 46",
        "img" : "/img/cdt-2013/8-20-13c.jpg"
    },
    "119" : {
        "caption" : "",
        "include_post" : true,
        "id" : "119",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-20-13",
        "text" : "In theory, you can follow the ridge and hike from peak to peak.  After James Peak, there's an option to hike right along the divide. Unfortunately, it involves crossing that cliff that you can see just above this lake. Since I'm a tiny bit scared of heights and the route was described as 'technical', I opted to not take that route. Probably a wise decision, but a part of me wishes that I had tried. Who knows, maybe I would have died or maybe I would have had a great big old adventure. Now we'll never know.",
        "title" : "Day 46",
        "img" : "/img/cdt-2013/8-20-13d.jpg"
    },
    "120" : {
        "caption" : "",
        "include_post" : true,
        "id" : "120",
        "latitude" : "39.805",
        "longitude" : "-105.736",
        "date" : "8-21-13",
        "text" : "From the top of Mt. Flora. I met 2 dayhikers on my way up and they asked me if a tiny little bump on the way down was Mt. Eva. Um, Mt. Eva is a 13er right on the divide. They didn't have a map and turned right at the top of Flora instead of left. It happens. At least I'm not the only one who goes the wrong way across these mountains.",
        "title" : "Day 47",
        "img" : "/img/cdt-2013/8-21-13.jpg"
    },
    "121" : {
        "caption" : "",
        "include_post" : true,
        "id" : "121",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-21-13",
        "text" : "",
        "title" : "Day 47",
        "img" : "/img/cdt-2013/8-21-13b.jpg"
    },
    "121.1" : {
        "caption" : "One last mistake",
        "include_post" : true,
        "id" : "121.1",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-22-13",
        "text" : "Once again, I screwed up. I got lost, hiked over the wrong pass, traversed around the wrong mountain, had to backtrack and scramble across some fairly steep slopes, finally found the trail only to lose it again a little while later, then lost it again after that. Ugh. It was a rough day. My last day on the trail too. Must have been the CDT's way of saying goodbye. Isn't that sweet?",
        "title" : "Day 48",
        "img" : "/img/cdt-2013/8-22-13d.jpg"
    },
    "122" : {
        "caption" : "The bold fashion choices of a thru-hiker",
        "include_post" : true,
        "id" : "122",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-22-13",
        "text" : "Me contemplating the view and the rapidly approaching end of my hike.... You might notice that the top of my hat is missing. My poor hat, barely made it to the end of this hike, but it hung in there as long as it could. It's amazing the uses you can find for a bandanna though! Perhaps I'll start a new style trend with this hat :)",
        "title" : "Day 48",
        "img" : "/img/cdt-2013/8-22-13.jpg"
    },
    "123" : {
        "caption" : "",
        "include_post" : true,
        "id" : "123",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-22-13",
        "text" : "The CDT wasn't going to let me go that easily, it still had one whopper of an afternoon thunderstorm waiting.",
        "title" : "Day 48",
        "img" : "/img/cdt-2013/8-22-13b.jpg"
    },
    "124" : {
        "caption" : "",
        "include_post" : true,
        "id" : "124",
        "latitude" : "39.629",
        "longitude" : "-106.071",
        "date" : "8-22-13",
        "text" : "The end! My wonderful sisters came to pick me up, had a sign, crown, balloon, and cupcakes for my finish.... That's it, Silverthorne was the end of the CDT for me. Once I finished the CDT I also had the Triple Crown. I'm actually a Triple Crowner, it's hard to believe, but it's true.",
        "title" : "Day 48",
        "img" : "/img/cdt-2013/8-22-13c.jpg"
    }
}