{
    "1208692927869053563" : {
      "caption" : "Springer Mountain!!",
      "include_post" : "Y",
      "id" : "1208692927869053563",
      "latitude" : "34.644",
      "longitude" : "-84.191",
      "date" : "2016-03-18 13:24:06",
      "text" : "Ahh, the start of the Appalachian Trail.  It's a little surreal to be back here, but so far it feels like going home, like I was meant to be back here hiking this trail again.  Of course that could just be the day 1 excitement, I'm sure tomorrow I'll be back to bitching about the trail.  Anyway, here's hoping this hike is a happy/successful one. :)",
      "title" : "Day 1",
      "img" : "at-2016-img/3-18-16.jpg"
    },
    "1208693015924271742" : {
      "caption" : "My first white blaze!",
      "include_post" : "Y",
      "id" : "1208693015924271742",
      "latitude" : "",
      "longitude" : "",
      "date" : "2016-03-18 13:24:17",
      "text" : "I decided to hike the approach trail this time around (it's ~9 miles from Amicalola state park to Springer Mtn, the other option is to drive a forest service road to ~1 mile from Springer), so it was about 4 hours until I saw my first white blaze.  I'll be seeing a lot more of those in the days to come...",
      "title" : "Day 1b",
      "img" : "at-2016-img/3-18-16b.jpg"
    },
    "1208693419063995026" : {
      "caption" : "Gooches Gap",
      "include_post" : "Y",
      "id" : "1208693419063995026",
      "latitude" : "34.717",
      "longitude" : "-83.977",
      "date" : "2016-03-18 13:25:05",
      "text" : "This is pretty typical of the AT.  I was hiking along when I arrive at Gooches Gap.  There's nothing extra special about this Gap, but it does have a forest service road to it.  Anyway, there's a bunch of people hanging out and they ask me if I want some beer and hot dogs.  Of course I do!  So I stop, talk, have a drink (never did get that hot dog). They were sucking hikers in, giving them beer, convincing them to camp there for the night; it was basically a hiker-black-hole about to turn into a giant party.  That's the AT for you, it's basically a traveling circus, with a hiker party somewhere every few days (if you want that sort of thing). You either love it or hate it, but that's the trail.",
      "title" : "Day 2",
      "img" : "at-2016-img/3-18-16c.jpg"
    },
    "1208758951356230581" : {
      "caption" : "Mountain Crossings",
      "include_post" : "Y",
      "id" : "1208758951356230581",
      "latitude" : "34.735",
      "longitude" : "-83.918",
      "date" : "2016-03-18 15:35:17",
      "text" : "This is the famous Neels Gap Crossing, ~30 miles into the trail where they'll do a gear shakedown for you to help you drop pack weight (trust me, lots of people need the help). Notice the tree, it's filled with discarded hiking boots.  Love it!",
      "title" : "Day 3 - Resupply Stop",
      "img" : "at-2016-img/3-18-16d.jpg"
    },
    "1209488648776018250" : {
      "caption" : "A typical AT view",
      "include_post" : "Y",
      "id" : "1209488648776018250",
      "latitude" : "34.822",
      "longitude" : "-83.787",
      "date" : "2016-03-19 15:45:04",
      "text" : "So I was hiking along and came to a rock outcropping with a pretty view.  Another guy was there so we chatted a bit and then he turned to leave.  A moment later I hear the weirdest grunting noises.  It sounded like either he was:  A. extremely constipated and working hard at it, or B.  having super awkward sex.  Maybe both?  He had just left me seconds before, so i knew it was improbable that either was happening... but not impossible.  Turns out he was just putting his pack on.  I hope he did a lot of yoga before the trail, because the position he had himself in required him to be both horizontal and vertical at the same time.  It's complicated.  Eventually we left and continued walking, but every once in a while he would stop, position his pack on a log, squat down and make the most amazing sigh of relief.  He didn't say much, but he did make the most magnificent noises; I wish I had taken his picture.  But someday I will find you again my bearded, grunting, magical friend.  Someday.",
      "title" : "Day 3",
      "img" : "at-2016-img/3-13-16.jpg"
    },
    "1209693386838731216" : {
      "caption" : "This felt very Pacific northwest-y to me",
      "include_post" : "Y",
      "id" : "1209693386838731216",
      "latitude" : "34.931",
      "longitude" : "-83.601",
      "date" : "2016-03-19 22:31:50",
      "text" : "Now that I have a few solid days on the AT under my belt it's time to point out some differences from the PCT.  First:  People!  There are lots of people.  Tons of people.  People everywhere.  It's been an adjustment.  I guess this is peak thru-hiker season, but by this point 20% or more of the hikers have dropped out (really!  Isn't that depressing?). Even so, it's still tough to get away, and you know I'm trying!  The other glaring difference is water.  It's everywhere here.  At first I felt guilty for passing up a perfectly good stream, but I also just hiked the PCT's desert section where 30 mile waterless stretches are common.  Here, if you tell a hiker it's 4 miles until the next source they look at you like you're insane, or that they might die.  Either way.",
      "title" : "Day 4",
      "img" : "at-2016-img/3-19-16.jpg"
    },
    "1211042213306919678" : {
      "caption" : "Yup, it snowed.",
      "include_post" : "Y",
      "id" : "1211042213306919678",
      "latitude" : "35.067",
      "longitude" : "-83.488",
      "date" : "2016-03-21 19:11:43",
      "text" : "The trail is really quite pretty with a touch of snow on it.  It's also frickin' cold.  Tomorrow is supposed to warm up though, hopefully today/tonight is as cold as it gets.  Other than that, I'm done with Georgia!  We're now hiking in North Carolina.  Yay.",
      "title" : "Day 5",
      "img" : "at-2016-img/3-21-16.jpg"
    },
    "1211668080387255200" : {
      "caption" : "It was a foggy day, perfect for a shot like this.",
      "include_post" : "Y",
      "id" : "1211668080387255200",
      "latitude" : "35.271",
      "longitude" : "-83.577",
      "date" : "2016-03-22 15:55:12",
      "text" : "I survived the cold, snowy night last night, but not without one thing that happened.  This may be tmi, but oh well... So I haven't, um, gone to the bathroom since starting the AT (if you know what I mean). So of course my body decides to punish me by deciding that the coldest, snowiest night of my hike would be the perfect time to start.  Thanks colon!  Anyway, so I go running to the trees, dig my hole, do my thing and then discover the problem:  I don't use tp, I use wet wipes (it's a hygiene thing), and wouldn't you know it, my entire stash of wipes was frozen solid.  Yay.  That led to quite a few 'what the F&+!' expressions and a few very cold, uncomfortable moments as I figured out my next move.  Take notes kids and learn from my mistakes, because friends don't let friends turn their only source of toilet paper into a solid ball of ice.",
      "title" : "Day 6",
      "img" : "at-2016-img/3-22-16.jpg"
    },
    "1211914093983263260" : {
      "caption" : "My 2 new friends",
      "include_post" : "Y",
      "id" : "1211914093983263260",
      "latitude" : "35.364",
      "longitude" : "-83.716",
      "date" : "2016-03-23 00:03:59",
      "text" : "This morning I was hiking along and came across these 2 furry friends.  It's fairly common for people to hike with dogs, so I was expecting a hiker to come along at any moment.  No one showed up.  Sadly, it's also fairly common to find lost or abandoned dogs on the trail.  These two had collars and tags, so when I got to the highway I tried calling the number, but no one answered.  They were super friendly dogs though, hiked right behind me for the 4 miles or so to the road (they may also have gotten all the rest of my tasty treats). I'm not sure what happened to them, they probably started following another hiker with better snacks.  I'll miss them though.",
      "title" : "Day 7",
      "img" : "at-2016-img/3-23-16.jpg"
    },
    "1214545687764101932" : {
      "caption" : "Fontana Dam",
      "include_post" : "Y",
      "id" : "1214545687764101932",
      "latitude" : "35.546",
      "longitude" : "-83.794",
      "date" : "2016-03-26 15:12:30",
      "text" : "I know this picture doesn't look like much, but at this very spot in 2005 when I originally hiked the AT is where I almost quit and headed home.  I often wonder about that, if I had quit back in 2005 where would I have ended up in life?  I certainly wouldn't be a triple crowner, or have biked across the country, or wandered randomly around Japan.  My crystal ball and psychic powers are a little rusty so I have no idea what would have become of me, but it likely would have been vastly different.  Is that good or bad?  Who knows.  But that one seemingly small decision (to keep hiking or go home) had profound impacts on my life, for better or worse.",
      "title" : "Day 8",
      "img" : "at-2016-img/3-26-16.jpg"
    },
    "1214546674717387617" : {
      "caption" : "Darn hikers always blocking my views",
      "include_post" : "Y",
      "id" : "1214546674717387617",
      "latitude" : "35.6",
      "longitude" : "-83.4",
      "date" : "2016-03-26 15:14:27",
      "text" : "Made it past Clingman's Dome (the high point of the AT). Unfortunately it started raining around 5pm, and it was, oh, about 40 degrees, so I'm pretty cold, wet, tired and grumpy.  Luckily I'm in a nice dry shelter tonight.  Tomorrow will be a better day.",
      "title" : "Day 9",
      "img" : "at-2016-img/3-26-16b.jpg"
    },
    "1214546917953465192" : {
      "caption" : "Hiking above the clouds is pretty awesome!",
      "include_post" : "Y",
      "id" : "1214546917953465192",
      "latitude" : "35.728",
      "longitude" : "-83.181",
      "date" : "2016-03-26 15:14:56",
      "text" : "Hiking in a national park (the Smokies in this case) has some advantages, like how every trail junction is marked with nice signs giving a direction and distance.  The problem is when they lie.  For example, last night there was a sign outside our shelter that said water was 0.1 miles away.  It was closer to 0.3.  I know, 0.1, 0.3, what's the big deal?  I'll let you in on a secret:  thru-hikers are lazy.  Super lazy.  Incredibly lazy.  We don't want to walk one foot more than we have to.  If you say something is 0.1 miles away, it better be 0.1 miles away, or prepare to feel our wrath.  In other words, we'll unzip our sleeping bag, stumble towards you, and throw a small-ish rock at you.  A bigger rock would take too much energy.  Of course a small rock needs to be close, we're certainly not going to look for one.  I suppose we could fling a stick at you, but that seems like a lot of effort too.  Oh screw it, let's just eat some pop tarts and go to bed, but we will glare at you the entire time we're eating, and you will feel our wrath!!!",
      "title" : "Day 10",
      "img" : "at-2016-img/3-26-16c.jpg"
    },
    "1214831678445938955" : {
      "caption" : "Today was trail magic day!",
      "include_post" : "Y",
      "id" : "1214831678445938955",
      "latitude" : "35.821",
      "longitude" : "-82.937",
      "date" : "2016-03-27 00:40:43",
      "text" : "Not one but 2 trail magics happened today!  This guy is the craziest one though.  He was parked at the top of Snowbird Mtn and I was the only hiker there at the time so we started chatting about the trail.  Turns out that we had met before.  You see, he drives around to all of the long trails and sets up camp for a few weeks doing trail magic for the hikers (aka giving them sodas, candy, etc). I met him on the Colorado Trail I'm 2009 or 2010, whenever it was that I hiked that one.  What're the odds?!? Trail magic from the same guy on 2 different trails.  It's a crazy world.  When we figured all of this out, he laughed and said: 'we both need to get a life...' Sad but true.",
      "title" : "Day 11",
      "img" : "at-2016-img/3-27-16.jpg"
    },
    "1214835545636170091" : {
      "caption" : "The first trail magic!",
      "include_post" : "Y",
      "id" : "1214835545636170091",
      "latitude" : "",
      "longitude" : "",
      "date" : "2016-03-27 00:48:24",
      "text" : "So this was the first trail magic of the day, a wonderful lady from Texas who happens to be living in the area for a little while.  Her son hiked the trail 4 years ago so she decided she wanted to do a little trail magic for Easter (who knew it was already Easter? I sure didn't). Anyway, she had quite the spread, she just kept pulling more and more stuff out of her vehicle:  ham, croissants, fruit, carrots, cookies, candy, I don't think I've ever seen a trail magic quite like that.  I was almost expecting to turn around and see her pulling some freshly baked muffins out of a secret oven in her car.  The moral here folks is if you ever want to amaze and delight hikers just drive to the trail, set up camp for the day (a few lawn chairs will do), and feed some hikers.  You will instantly become their new favorite person!",
      "title" : "Day 11 - part 2",
      "img" : "at-2016-img/3-27-16b.jpg"
    },
    "1215552015521376983" : {
      "caption" : "Max Patch!",
      "include_post" : "Y",
      "id" : "1215552015521376983",
      "latitude" : "35.890",
      "longitude" : "-82.832",
      "date" : "2016-03-28 00:31:53",
      "text" : "Max Patch is one of the North Carolina balds (just a series of mountains that don't have trees on their summits for some reason). I got to it on a beautiful Saturday afternoon and it was filled with people laying on the grass, having a picnic, playing frisbee.  Basically it was like a city park, except the closest city was probably 30 miles away.  I loved it, it was just a lovely way to spend an afternoon.  Max Patch quickly became one of my favorite places on the AT, and I've now added it to my spouse list.  That's just a list of places that I intend to take my spouse to someday, if I ever get married, of course.  The list is getting pretty long, so I better find him soon!  Come on people, feel free to set me up, I need all the help I can get!",
      "title" : "Day 12",
      "img" : "at-2016-img/3-28-16.jpg"
    },
    "1216257549044115994" : {
      "caption" : "A thru-hiker Easter gathering!",
      "include_post" : "Y",
      "id" : "1216257549044115994",
      "latitude" : "36.026",
      "longitude" : "-82.712",
      "date" : "2016-03-28 23:53:40",
      "text" : "This was at a hostel in Hot Springs, and since it was Easter, the staff was nice enough to cook us all an Easter dinner.  Hiker hostels are pretty awesome, we ate a ton of food, drank beer, had a fire at night, laughed, talked, and there was even a midnight show:  a couple that had formed on the trail had a very loud and public screaming match in the middle of the night (a lot of beer may have helped contribute to causing the fight.  Gotta love drunk hikers).... Welcome to the AT!",
      "title" : "Day 13",
      "img" : "at-2016-img/3-28-16b.jpg"
    },
    "1216996159091468918" : {
      "caption" : "This picture didn't turn out how I expected",
      "include_post" : "Y",
      "id" : "1216996159091468918",
      "latitude" : "35.982",
      "longitude" : "-82.502",
      "date" : "2016-03-30 00:21:09",
      "text" : "When I was hiking, this area almost looked like it had a little bit of fresh snow (the picture doesn't quite do it justice). It's not snow though, it's thousands of little white flowers.  Spring is finally on its way!",
      "title" : "Day 14",
      "img" : "at-2016-img/3-30-16.jpg"
    },
    "1219027076790184455" : {
      "caption" : "Hmm....",
      "include_post" : "Y",
      "id" : "1219027076790184455",
      "latitude" : "36.105",
      "longitude" : "-82.12",
      "date" : "2016-04-01 19:36:13",
      "text" : "Sometimes you're hiking along and you come across a chimney in the middle of the trail.  Why wouldn't you put a chimney in the middle of a hiking trail, it just makes sense.  I'm surprised that more trails haven't picked up on this trend yet and installed chimneys in the middle of all of their trails.",
      "title" : "Day 16",
      "img" : "at-2016-img/4-1-16.jpg"
    },
    "1219027309028796943" : {
      "caption" : "Just a pretty little section of trail",
      "include_post" : "Y",
      "id" : "1219027309028796943",
      "latitude" : "36.110",
      "longitude" : "-82.362",
      "date" : "2016-04-01 19:36:41",
      "text" : "There's not much to say, the weather has been beautiful, the trail has been pretty reasonable, and I've just been hiking along; nothing exciting has happened.  I really shouldn't say things like that or I'll jinx it and something catastrophic will happen.  But yeah, everything has been going smoothly...",
      "title" : "Day 15",
      "img" : "at-2016-img/4-1-16b.jpg"
    },
    "1219591022278437824" : {
      "caption" : "More pretty hiking along NC's balds",
      "include_post" : "Y",
      "id" : "1219591022278437824",
      "latitude" : "36.221",
      "longitude" : "-82.019",
      "date" : "2016-04-02 14:16:41",
      "text" : "This may be one of the last photos of North Carolina's bald mountains.  For one, we're now in Tennessee.  Also, I just have a feeling that I've hiked over the last of them, which is too bad, I really enjoy them, especially on foggy mornings (like today!). Hopefully I'm wrong and the trail still has a few surprises left for me...",
      "title" : "Day 17",
      "img" : "at-2016-img/4-2-16.jpg"
    },
    "1219591049382030274" : {
      "caption" : "Foggy mornings!",
      "include_post" : "Y",
      "id" : "1219591049382030274",
      "latitude" : "",
      "longitude" : "",
      "date" : "2016-04-02 14:16:44",
      "text" : "I know it's not the most exciting picture, but I do truly love my foggy mornings on the AT, they make me happy!",
      "title" : "Day 17b",
      "img" : "at-2016-img/4-2-16b.jpg"
    },
    "1219909219040979335" : {
      "caption" : "Jones Falls",
      "include_post" : "Y",
      "id" : "1219909219040979335",
      "latitude" : "36.376",
      "longitude" : "-82.048",
      "date" : "2016-04-03 00:48:53",
      "text" : "This beautiful, amazing waterfall was 0.1 miles off the trail.  I probably sat there and debated if I should go to it for about 5 minutes (longer than it took to actually walk there). It was the usual argument: 'but it's 0.1 off the trail.  That's 0.2 round trip!  Do I really want to see another waterfall?' And so on... I'm almost never disappointed when I go see these side trail things, and yet I always, always debate going.  When am I going to learn to just shut up and go see whatever is down that side trail?!? Probably never, I'm kinda stupid.",
      "title" : "Day 18",
      "img" : "at-2016-img/4-3-16.jpg"
    },
    "1220602052513196149" : {
      "caption" : "Virginia!",
      "include_post" : "Y",
      "id" : "1220602052513196149",
      "latitude" : "36.617",
      "longitude" : "-81.813",
      "date" : "2016-04-03 23:45:25",
      "text" : "It's always exciting to hit a new state, but for some reason Virginia seems extra special.  Probably because to get here we had to survive rain, hail, snow, the Smokies, the Highlands, the Georgias; that's a lot of stuff.  Plus, Virginia has the most trail miles of any state, by the time we finish Virginia we'll almost be halfway done, so I guess it's a big deal when you both get to and leave Virginia.",
      "title" : "Day 19",
      "img" : "at-2016-img/4-3-16b.jpg"
    },
    "1221756607611365720" : {
      "caption" : "Damascus, Virginia",
      "include_post" : "Y",
      "id" : "1221756607611365720",
      "latitude" : "36.647",
      "longitude" : "-81.672",
      "date" : "2016-04-05 13:59:18",
      "text" : "Damascus is a trail town (the AT literally goes down main street), some would even say it's THE trail town because it hosts 'Trail Days', the biggest hiker festival on the AT.  Besides all of that, I love this town; it's really cute and small (maybe 1000 people???) but still has 3 outfitters and a supermarket.  This was my first supermarket since Atlanta (I've basically been resupplying out of convenience stores) and I was in awe, just wandering aimlessly up and down the aisles looking at all the stuff I couldn't buy.  There's so much!!! Clearly it doesn't take much to impress or entertain me these days...",
      "title" : "Day 20",
      "img" : "at-2016-img/4-5-16.jpg"
    },
    "1223160047675730181" : {
      "caption" : "The Grayson Highlands Ponies!",
      "include_post" : "Y",
      "id" : "1223160047675730181",
      "latitude" : "36.696",
      "longitude" : "-81.506",
      "date" : "2016-04-07 12:27:42",
      "text" : "Today was all about 2 things:  passing Mt. Rogers and the Ponies in Grayson Highlands state park.  The entire area is really pretty (I'm sure it's super popular in the summer, there were camping spots everywhere...). The highlight though were the Ponies, they're just super adorable and although technically are wild, they don't care about people at all.  Unless you feed them.  Which you're not supposed to do.  I, of course, would never try to bribe a pony to come over to me with food....",
      "title" : "Day 21",
      "img" : "at-2016-img/4-7-16.jpg"
    },
    "1223160077321070854" : {
      "caption" : "It's amazing!",
      "include_post" : "Y",
      "id" : "1223160077321070854",
      "latitude" : "36.854",
      "longitude" : "-81.364",
      "date" : "2016-04-07 12:27:45",
      "text" : "Don't you hate it when you're on your daily 28 mile walk and your source of water is a beautiful spring but the flow is so low that the water just trickles down the rocks making it nearly impossible to fill your bottles?!? Well we have a brand new, totally amazing invention for just this situation: Leaf Technique!  Yes, Leaf Technique is revolutionary new technology that lets you transform an ordinary green leaf and a rock into an instant spout to make collecting water easy!  If you order now, we'll send you not one but 2 leaves.  That's right, 2 for the price of 1!  And that's not all: order in the next 30 minutes and we'll also send you a rock for free.  That's right, you'll have your very own rock!  Act quickly, supplies are limited. (Patent pending.  This message brought to you by every thru-hiker ever.)",
      "title" : "Day 22",
      "img" : "at-2016-img/4-7-16b.jpg"
    },
    "1224123388313299390" : {
      "caption" : "1/4 Done!",
      "include_post" : "Y",
      "id" : "1224123388313299390",
      "latitude" : "37.049",
      "longitude" : "-81.419",
      "date" : "2016-04-08 20:21:41",
      "text" : "That's right, I've now passed the 1/4 point of the AT!!! The mileages on the sign are a little outdated, but the basic concept is right.  So the hard part is done, it's all easy from here, right?",
      "title" : "Day 23",
      "img" : "at-2016-img/4-8-16.jpg"
    },
    "1224227980472576195" : {
      "caption" : "Winter's not quite done with us yet.",
      "include_post" : "Y",
      "id" : "1224227980472576195",
      "latitude" : "37.132",
      "longitude" : "-81.051",
      "date" : "2016-04-08 23:49:29",
      "text" : "It's been a little chilly lately, and tomorrow is supposed to be the coldest day yet with more snow.  Yay.  Can't wait.  The one bad thing about being able to hike with a smart phone is that you're obsessively checking the weather every chance you get.  I guess that's a good thing, but it does take a bit of the element of surprise out of things.  Anyway, cold and snowy tomorrow.  Bring it on.",
      "title" : "Day 24",
      "img" : "at-2016-img/4-8-16b.jpg"
    },
    "1226888619271743954" : {
      "caption" : "...",
      "include_post" : "Y",
      "id" : "1226888619271743954",
      "latitude" : "37.274",
      "longitude" : "-80.828",
      "date" : "2016-04-12 15:55:42",
      "text" : "I miss being warm and dry.",
      "title" : "Day 25",
      "img" : "at-2016-img/4-12-16.jpg"
    },
    "1226888681431329241" : {
      "caption" : "He was hiking fast, way out of my hiking league",
      "include_post" : "Y",
      "id" : "1226888681431329241",
      "latitude" : "37.384",
      "longitude" : "-80.466",
      "date" : "2016-04-12 15:55:49",
      "text" : "Virginia has lots of nice hiking along ridges.  Sometimes you even get nice views.  Yeah, Virginia's been alright so far.",
      "title" : "Day 27",
      "img" : "at-2016-img/4-12-16b.jpg"
    },
    "1226888714348227034" : {
      "caption" : "It was a good day!",
      "include_post" : "Y",
      "id" : "1226888714348227034",
      "latitude" : "37.373",
      "longitude" : "-80.746",
      "date" : "2016-04-12 15:55:53",
      "text" : "I know what you all were thinking when you saw this picture: 'that's not enough food!!'. And you would be correct.  Luckily, however, this was a Chinese buffet, so about 4 more delicious plates followed this one.  Weather wise, it finally started to warm up today, but during the previous 2 cold, snowy days I saw a grand total of 1 other hiker.  Apparently the rest fled the trail for the closest town or hostel like rats from a sinking ship.  Anyone can hike when it's sunny and 60 degrees outside; embrace the brutality!!!",
      "title" : "Day 26",
      "img" : "at-2016-img/4-12-16c.jpg"
    },
    "1227150752911813390" : {
      "caption" : "The Keffer Oak",
      "include_post" : "Y",
      "id" : "1227150752911813390",
      "latitude" : "37.390",
      "longitude" : "-80.192",
      "date" : "2016-04-13 00:36:31",
      "text" : "This tree is the second biggest on the AT.  I guess there's some upstart whippersnapper in New York that's a hair bigger.  Damn you New York and your unusually large trees!! Actually, trees like this were probably common before this area was logged and stripped of everything.  It makes me a little sad.  Anyway, the other event today happened around 3pm.  I was hiking along and this guy was headed towards me from the other direction.  We stop and say hello and he asks me one question: 'Are you hungry?' Of course I am!  I spend most of the day dreaming about what flavor of ice cream I'm going to have at the next town. (The answer:  All of them.) He then proceeded to pull a McDonald's double cheeseburger and a Gatorade out of his little day pack, handed them to me and took off.  I was so flabbergasted that I barely knew what to do.  I've never been walking down the trail and randomly had someone hand me a cheeseburger.  Best.  Trail.  Magic.  Ever!!!!",
      "title" : "Day 28",
      "img" : "at-2016-img/4-13-16.jpg"
    },
    "1227879991701236263" : {
      "caption" : "McAfee Knob - the classic AT picture.",
      "include_post" : "Y",
      "id" : "1227879991701236263",
      "latitude" : "37.416",
      "longitude" : "-79.955",
      "date" : "2016-04-14 00:45:23",
      "text" : "Oh Virginia, we use to be such good friends, and then you went and pulled the crap you did today.  I knew this day was coming, but I still got surprised by it.  Today was the day Virginia decided to route the trail along ridges lines with big slabs of pointy rocks at the top.  So all day long I was scrambling over these rocks and getting super annoyed because there was perfectly reasonable forest to hike through right below us.  Anyway, I'm just tired, and grumpy, and my legs feel like they barely move anymore.  I need a day off.  And some ice cream.  But mostly a day off.",
      "title" : "Day 29",
      "img" : "at-2016-img/4-14-16.jpg"
    },
    "1228675002168601250" : {
      "caption" : "Oh yes, I ate both of them",
      "include_post" : "Y",
      "id" : "1228675002168601250",
      "latitude" : "37.392",
      "longitude" : "-79.908",
      "date" : "2016-04-15 03:04:55",
      "text" : "Today was day 30, my one-monthiversary!  So I celebrated by hiking a few miles to Daleville VA, getting a hotel room, and just relaxing for the rest of the day.  And yes, massive amounts of ice cream were enjoyed by all. :)",
      "title" : "Day 30",
      "img" : "at-2016-img/4-15-16.jpg"
    },
    "1229316886113118703" : {
      "caption" : "The Blue Ridge Parkway",
      "include_post" : "Y",
      "id" : "1229316886113118703",
      "latitude" : "37.530",
      "longitude" : "-79.634",
      "date" : "2016-04-16 00:20:14",
      "text" : "The trail in this section does its best to follow the Blue Ridge Parkway, which means we're back to nice, reasonable, perfectly lovely trail.  Way to go Virginia, I guess this means we can be friends again.",
      "title" : "Day 31",
      "img" : "at-2016-img/4-16-16.jpg"
    },
    "1230505716023388241" : {
      "caption" : "They call this 'The Guillotine'",
      "include_post" : "Y",
      "id" : "1230505716023388241",
      "latitude" : "37.599",
      "longitude" : "-79.414",
      "date" : "2016-04-17 15:42:13",
      "text" : "The weather was absolutely gorgeous today, plus it was a weekend, and you know what that means: lots and lots of weekenders!  I didn't realize at first what was going on because, well, I'm kinda stupid, but I kept noticing more and more people on the trail.  Finally I figured it out; aren't you proud of me?  It almost feels like Georgia and the start of the AT out here, everywhere you turn there are people.  It's not quite as bad as Georgia, but I definitely got some flashbacks.  Don't get me wrong, I'm glad people are out here enjoying the mountains, it was just a bit of a shock to see all of them.  Where were all of these people last weekend when it was 20 degrees and snowing, 'eh?!?",
      "title" : "Day 32",
      "img" : "at-2016-img/4-17-16.jpg"
    },
    "1232084475302210333" : {
      "caption" : "The James River",
      "include_post" : "Y",
      "id" : "1232084475302210333",
      "latitude" : "37.740",
      "longitude" : "-79.225",
      "date" : "2016-04-19 19:58:56",
      "text" : "It was just another beautiful day along the Appalachian trail.",
      "title" : "Day 33",
      "img" : "at-2016-img/4-19-16.jpg"
    },
    "1232084507422190367" : {
      "caption" : "Pretty Flowers",
      "include_post" : "Y",
      "id" : "1232084507422190367",
      "latitude" : "37.893",
      "longitude" : "-78.992",
      "date" : "2016-04-19 19:59:00",
      "text" : "The wild flowers have started showing up for their annual appointment.  It does seem a little late, but this is Virginia, what do I know?  The flowers are nice, but I'm patiently waiting for the trees to finally get their leaves.  What's the point of hiking the long green tunnel (as the AT is sometimes called) if there's no shade?  I want my cool, shady hiking trail!  Come on you lazy trees, winter is over, get your act together, I'm a busy man, I've got things to do and places to go, let's get a move on.... Oh wait, I'm unemployed, homeless, and going for really long walks everyday; I have nothing but time...",
      "title" : "Day 34",
      "img" : "at-2016-img/4-19-16b.jpg"
    },
    "1232127692781479938" : {
      "caption" : "Waynesboro, VA",
      "include_post" : "Y",
      "id" : "1232127692781479938",
      "latitude" : "38.031",
      "longitude" : "-78.859",
      "date" : "2016-04-19 21:24:48",
      "text" : "Yet another Chinese buffet!  Now you may be thinking that I hike simply to go from buffet to buffet, and you wouldn't be entirely right, but you wouldn't be entirely wrong either....",
      "title" : "Day 35",
      "img" : "at-2016-img/4-19-16c.jpg"
    },
    "1234058777790605866" : {
      "caption" : "Taken from a fast moving ranger truck",
      "include_post" : "Y",
      "id" : "1234058777790605866",
      "latitude" : "38.325",
      "longitude" : "-78.587",
      "date" : "2016-04-22 13:21:31",
      "text" : "Oh no!! The Shenandoah's are on fire!  Apparently it started last Saturday and it's not going very well.  They closed part of Skyline Drive and a section of the AT, so that sucks, but I have absolutely no interest in walking through a burning forest so I don't mind.  Still trying to figure out what happens next, as usual I'm just sort of winging it and hoping for the best.",
      "title" : "Day 36",
      "img" : "at-2016-img/4-22-16.jpg"
    },
    "1234059497231182404" : {
      "caption" : "An evening visitor to my camp",
      "include_post" : "Y",
      "id" : "1234059497231182404",
      "latitude" : "38.555",
      "longitude" : "-78.404",
      "date" : "2016-04-22 13:22:57",
      "text" : "After the fire-filled fun yesterday, today was pretty anticlimactic.  All day long was just perfectly nice, reasonable trail.  Nothing was on fire, no trucks were speeding down the highway; it was just boring old hiking all day long.  I did get a couple deer wandering through my camp right when it was getting dark, maybe they were there to tuck me in and read me a bedtime story.  Wouldn't that be nice?",
      "title" : "Day 37",
      "img" : "at-2016-img/4-22-16b.jpg"
    },
    "1235123739829037519" : {
      "caption" : "Goodbye SNP!",
      "include_post" : "Y",
      "id" : "1235123739829037519",
      "latitude" : "38.940",
      "longitude" : "-78.036",
      "date" : "2016-04-24 00:37:25",
      "text" : "Today marked the end of my hike through the SNP.  It's not exactly the most scenic hiking ever, but it was pleasant enough.  The big draw of the park (for hikers at least) is the abundance of food: there's the restaurants, Waysides, and the random tourists who stop to hand you a blueberry scone from Panera (it was delicious!). I'll miss you, SNP, and all of your delicious food...",
      "title" : "Day 39",
      "img" : "at-2016-img/4-24-16.jpg"
    },
    "1235123845869431250" : {
      "caption" : "It finally rained!",
      "include_post" : "Y",
      "id" : "1235123845869431250",
      "latitude" : "38.754",
      "longitude" : "-78.289",
      "date" : "2016-04-24 00:37:37",
      "text" : "A random Travis quote from today: 'Yeah, the fire sucks, but it's fine, I found a breakfast buffet today so everything's going to be ok'.",
      "title" : "Day 38",
      "img" : "at-2016-img/4-24-16b.jpg"
    },
    "1236351477848042223" : {
      "caption" : "Drama on the AT!",
      "include_post" : "Y",
      "id" : "1236351477848042223",
      "latitude" : "39.156",
      "longitude" : "-77.817",
      "date" : "2016-04-25 17:16:43",
      "text" : "Today was noteworthy for 3 reasons: #1.  I passed the 1000 mile mark today.  Yay me.  #2.  We're done with Virginia!  Yes, I am now in West Virginia.  Virginia don't go quietly though, it ended with 'The Roller Coaster': a 13.5 mile stretch of tightly packed ascents and descents.  Thanks Virginia!  And finally, #3.  I was hiking along and heard a commotion ahead of me.  I get there and find the scene in the picture above.  Apparently a little girl was playing in the rocks and got stuck, then tried to get out and got even more stuck.  She had been trapped for over 2 and a half hours by the time I hiked by.  You could hear her crying and screaming all the way down the trail, it was pretty agonizing.  Hopefully they got her out!",
      "title" : "Day 40",
      "img" : "at-2016-img/4-25-16.jpg"
    },
    "1236645815287114489" : {
      "caption" : "Harper's Ferry, WV",
      "include_post" : "Y",
      "id" : "1236645815287114489",
      "latitude" : "39.317",
      "longitude" : "-77.756",
      "date" : "2016-04-26 03:01:30",
      "text" : "This is it for a bit, I have a cousin in DC so I'm heading into the city for a few days of relaxing and sight seeing.  While I'm there I'm sure Obama and members of Congress will want to meet with me and get my opinion on the economy, global warming, that pesky middle East situation, etc.  It's tough being a thru-hiker, everyone wants to meet with you and have you solve all of their problems, but with great power comes great responsibility, so I'll do what I can =)",
      "title" : "Day 41",
      "img" : "at-2016-img/4-26-16.jpg"
    },
    "1238531052971583899" : {
      "caption" : "Tomb of the Unknown Soldier",
      "include_post" : "Y",
      "id" : "1238531052971583899",
      "latitude" : "38.876",
      "longitude" : "-77.072",
      "date" : "2016-04-28 17:27:08",
      "text" : "Just doing a little sight seeing around DC...",
      "title" : "Day 42",
      "img" : "at-2016-img/4-28-16.jpg"
    },
    "1238543602421427065" : {
      "caption" : "Natural History Museum",
      "include_post" : "Y",
      "id" : "1238543602421427065",
      "latitude" : "38.891",
      "longitude" : "-77.026",
      "date" : "2016-04-28 17:52:04",
      "text" : "More touristy fun in DC...",
      "title" : "Day 43",
      "img" : "at-2016-img/4-28-16b.jpg"
    },
    "1238795880260790626" : {
      "caption" : "The best view in DC",
      "include_post" : "Y",
      "id" : "1238795880260790626",
      "latitude" : "39.324",
      "longitude" : "-77.690",
      "date" : "2016-04-29 02:13:18",
      "text" : "Well, I'm back on the AT after a few much needed days off (my legs almost feel normal again). A big thanks to Leif and Lindsey for letting me stay with them, feeding me, and showing me around DC!  I really liked DC, which made it a little difficult to go back to the trail, but Maine is calling, it's time to get back to hiking....",
      "title" : "Day 44",
      "img" : "at-2016-img/4-28-16.jpg"
    },
    "1239472279871121488" : {
      "caption" : "Civil War stuff",
      "include_post" : "Y",
      "id" : "1239472279871121488",
      "latitude" : "39.649",
      "longitude" : "-77.541",
      "date" : "2016-04-30 00:37:11",
      "text" : "Well, I'm in Maryland, but not for long, there's only about 40 miles of trail in this state and then it's on to Pennsylvania.  So far Maryland has been great though, the trail runs right through a bunch of old Civil War battlefields, so there's lots of neat history along the trail in this section.  Bring it on, might as well do a little learnin' while I'm hiking!",
      "title" : "Day 45",
      "img" : "at-2016-img/4-30-16.jpg"
    },
    "1240696477947881968" : {
      "caption" : "Beautiful, scenic Maryland.",
      "include_post" : "Y",
      "id" : "1240696477947881968",
      "latitude" : "39.942",
      "longitude" : "-77.485",
      "date" : "2016-05-01 17:09:27",
      "text" : "We're now in Pennsylvania, which is known for its rocks (and not in a good way). I haven't hit them yet, but don't worry, I'm sure I'll be super annoyed and grumpy about them any day now...",
      "title" : "Day 46",
      "img" : "at-2016-img/5-1-16.jpg"
    },
    "1242742490225273399" : {
      "caption" : "The halfway point!!",
      "include_post" : "Y",
      "id" : "1242742490225273399",
      "latitude" : "40.110",
      "longitude" : "-77.110",
      "date" : "2016-05-04 12:54:31",
      "text" : "Well, I made it.  To the halfway point of the AT that is.  I've now walked over half of the trail, that's over 1100 miles (from where I'm sitting right now). 1100 miles.  And I still have well over a thousand to go.  That's both exciting and a little daunting.",
      "title" : "Day 47",
      "img" : "at-2016-img/5-4-16.jpg"
    },
    "1242742566586772026" : {
      "caption" : "Just in case you forget...",
      "include_post" : "Y",
      "id" : "1242742566586772026",
      "latitude" : "40.365",
      "longitude" : "-77.069",
      "date" : "2016-05-04 12:54:40",
      "text" : "So far Pennsylvania has been nice, I'm sure you're all eagerly awaiting the 'Travis is now angrily screaming at rocks' post, but so far the trail has been pleasant.  Today we even hiked through the Cumberland Valley, which means lots of farmland and many opportunities for ice cream; I went with cookie dough this time, it's a classic for a reason.",
      "title" : "Day 48",
      "img" : "at-2016-img/5-4-16b.jpg"
    },
    "1242742633662081598" : {
      "caption" : "PA",
      "include_post" : "Y",
      "id" : "1242742633662081598",
      "latitude" : "40.486",
      "longitude" : "-76.633",
      "date" : "2016-05-04 12:54:48",
      "text" : "Today was just another day of easy hiking.  It has been raining everyday for the past 5 days, but that's ok, I'm enjoying the cool, damp weather.",
      "title" : "Day 49",
      "img" : "at-2016-img/5-4-16c.jpg"
    },
    "1243100429880485913" : {
      "caption" : "The Doyle",
      "include_post" : "Y",
      "id" : "1243100429880485913",
      "latitude" : "",
      "longitude" : "",
      "date" : "2016-05-05 00:45:40",
      "text" : "The Doyle was one of the fondest memories from my 2005 hike...",
      "title" : "Duncannon, PA",
      "img" : "at-2016-img/5-5-16.jpg"
    },
    "1243100619798571041" : {
      "caption" : "Tired of drinking plain water?  Well PA streams now come fully equipped with Gatorade!",
      "include_post" : "Y",
      "id" : "1243100619798571041",
      "latitude" : "40.532",
      "longitude" : "-76.187",
      "date" : "2016-05-05 00:46:03",
      "text" : "The trail has been interesting lately, I've been running into a lot of flip-floppers (people who start their hike in Harper's Ferry, hike to Maine, and then go back and do the southern half). They're all shiny and new, so I try to give them words of encouragement when I pass, like: 'Your feet will only hurt so much that you want to chop them off for the first 2000 miles.  After that they go numb and you just can't feel them anymore, so.... Problem solved!', or 'At some point you'll get an intestinal problem and have to poop 10 times a day.  Eventually random people will walk by, see you doing this, and you just won't care', and so on.  They seem to really like my motivational speeches, so I feel like I'm doing my good deed for the day.  Carry on, flip-floppers, Travis believes in you!!",
      "title" : "Day 50",
      "img" : "at-2016-img/5-5-16b.jpg"
    },
    "1244426707485158015" : {
      "caption" : "The view from The Pinnacle",
      "include_post" : "Y",
      "id" : "1244426707485158015",
      "latitude" : "40.606",
      "longitude" : "-75.958",
      "date" : "2016-05-06 20:40:45",
      "text" : "Today was a quick town stop in Hamburg, PA.  It was a good day because within walking distance of the trail (less than a mile) was a Walmart AND a buffet AND a McDonald's AND it wasn't raining.  Yay!! You may be wondering why I needed both a buffet AND a McDonald's (I don't know why I keep capitalizing AND, but now that I've started I can't seem to stop). Clearly, you go to the buffet for lunch to eat massive amounts of food, then you get your trail food at a grocery store, do any other little town chores, and on your way out you grab a dozen McDoubles for dinner that night.  Duh.  It's so obvious.  I can't believe that I need to explain this to you, have you learned nothing from all of my previous posts? =)",
      "title" : "Day 51",
      "img" : "at-2016-img/5-6-16.jpg"
    },
    "1244553862701476236" : {
      "caption" : "Fun with Geology",
      "include_post" : "Y",
      "id" : "1244553862701476236",
      "latitude" : "40.794",
      "longitude" : "-75.599",
      "date" : "2016-05-07 00:53:23",
      "text" : "Ha!  Oh Appalachian Trail, I laugh at your pathetic attempts to crush my morale with a week and a half of rainy days.  Luckily, I have a secret weapon for just such occasions: an umbrella!  And with it I will destroy you and then vengeance will be mine.  VENGEANCE WILL BE MINE!!!! -- (I decided that until we see the sun again that I would hike each day as a different character.  Today was evil supervillain.  I think tomorrow will be Disney princess.  Are you excited?!? I sure am!). Oh, the picture:  the vertical rocks were a stream bed, the horizontal ones were ocean floor. Thanks to the magic of plate tectonics they were crammed together, thrust upwards, and 450 million years later one slightly soggy supervillain was taking its picture.  Isn't that neat?  I wonder how they know that stuff?  I should have majored in Geology.  I suppose I still could, you know, after I'm done destroying the world and stuff...",
      "title" : "Day 52",
      "img" : "at-2016-img/5-7-16.jpg"
    },
    "1245272641861413257" : {
      "caption" : "His name was Sixty and he hated the rocks just as much as I did",
      "include_post" : "Y",
      "id" : "1245272641861413257",
      "latitude" : "40.938",
      "longitude" : "-75.183",
      "date" : "2016-05-08 00:41:28",
      "text" : "Rain + Large slippery rocks = One very tired and slightly bruised Travis.  Luckily, nothing was sprained, twisted, broken, or bent in a direction that nature didn't intend it to be bent, so I guess that makes today a success.... My character-a-day theme quickly came to an end though, mainly because I had that stupid 'Let It Go' song stuck in my head all day long.  All Day Long!!! Even I have my limits.",
      "title" : "Day 53",
      "img" : "at-2016-img/5-8-16.jpg"
    },
    "1246007435880654960" : {
      "caption" : "Crossing the border into New Jersey",
      "include_post" : "Y",
      "id" : "1246007435880654960",
      "latitude" : "41.112",
      "longitude" : "-74.897",
      "date" : "2016-05-09 01:01:22",
      "text" : "Well, we're now done with Pennsylvania and have moved on to the lovely state of New Jersey.  Overall, I really enjoyed Pennsylvania, I think it gets a bad rap (it's known as Rocksylvania), but it's really one of the easiest states on the AT.  The vast majority of the trail in Pennsylvania is flat, really loooooong ridge walks; then you go down to a gap, cross a highway or river, and right back up to another long ridge line.  Pretty easy!  Sure, there are some tough areas, like Lehigh Gap (it's a really steep, rocky climb), but the majority is pretty reasonable.  Anyway, I continue my hike North to Maine with yet another state checked off the list...",
      "title" : "Day 54",
      "img" : "at-2016-img/5-9-16.jpg"
    },
    "1246716048592955720" : {
      "caption" : "New Jersey's High Point",
      "include_post" : "Y",
      "id" : "1246716048592955720",
      "latitude" : "41.319",
      "longitude" : "-74.614",
      "date" : "2016-05-10 00:29:16",
      "text" : "Sunshine!  We actually got sunshine today!! It was beautiful all day long, not a drop of rain to be seen.  I'm actually dry, my socks are dry, even my tent is dry.  It's so nice to not have to crawl into a damp tent at the end of the day.  Something as simple as that shouldn't make me this happy, but it does.",
      "title" : "Day 55",
      "img" : "at-2016-img/5-10-16.jpg"
    },
    "1250252222750091653" : {
      "caption" : "Why, NY?",
      "include_post" : "Y",
      "id" : "1250252222750091653",
      "latitude" : "41.279",
      "longitude" : "-74.059",
      "date" : "2016-05-14 21:35:00",
      "text" : "My guidebook for this section says: 'despite the unassuming elevation profile, many rocky abrupt ups and downs make this a challenging section'. I agree.  Sure, the motto of the AT seems to be:  if there's a big pile of rocks somewhere, we're going to go straight up and over it!  But NY takes it to a whole new level.  Look at you being an overachiever, NY.  Way to go!!",
      "title" : "Day 57",
      "img" : "at-2016-img/5-14-16.jpg"
    },
    "1250252266421184904" : {
      "caption" : "NJ",
      "include_post" : "Y",
      "id" : "1250252266421184904",
      "latitude" : "41.211",
      "longitude" : "-74.316",
      "date" : "2016-05-14 21:35:06",
      "text" : "Already, we're done with New Jersey and have moved on to New York.  There wasn't a whole lot of trail in NJ, so it's hard to come to any big conclusions about the state, but 2 things stick out for me:  1. It seemed really swampy, lots of areas were just boggy (as you can see in the picture above). Not that this is a bad thing, just different after very dry Pennsylvania.  2.  You never felt very far from civilization.  Often you were quite literally hiking behind someone's backyard.  It's hard to feel like you're out in the wilderness when you're watching some guy mow his lawn.  Anyway, that's it for NJ, we'll see what NY has in store for me!",
      "title" : "Day 56",
      "img" : "at-2016-img/5-14-16b.jpg"
    },
    "1250252308490054026" : {
      "caption" : "If you look closely at the horizon you can see the NYC skyline",
      "include_post" : "Y",
      "id" : "1250252308490054026",
      "latitude" : "41.410",
      "longitude" : "-73.881",
      "date" : "2016-05-14 21:35:11",
      "text" : "Yup, today was the day we got views of NYC.  I think tomorrow there's a train stop directly on the AT that will let you get on a train to the city.  I think it only runs on the weekends, but I don't know, I've never taken it.  Maybe this year will be different and I'll spontaneously hop a train to the bright lights of NYC!  I'll be fine, they allow camping in Central Park, right?",
      "title" : "Day 58",
      "img" : "at-2016-img/5-14-16c.jpg"
    },
    "1250252401595214222" : {
      "caption" : "I think this was actually NJ, I just like the picture...",
      "include_post" : "Y",
      "id" : "1250252401595214222",
      "latitude" : "41.609",
      "longitude" : "-73.638",
      "date" : "5-14-16",
      "text" : "Meanwhile, somewhere by a pretty little lake in NY... 'Trail Journal - Log Entry #59b:  I made a tactical mistake and decided to camp near a pretty lake on a weekend.  I have paid for that decision dearly: the boy scouts have me surrounded.  I can hear them whispering and giggling as they plot their nefarious schemes.  I fear this may be the end!  If you don't hear from me after today, avenge me.  AVENGE ME!!!!!'.",
      "title" : "Day 59",
      "img" : "at-2016-img/5-14-16d.jpg"
    },
    "1250294865425165193" : {
      "caption" : "Connecticut",
      "include_post" : "Y",
      "id" : "1250294865425165193",
      "latitude" : "41.725",
      "longitude" : "-73.477",
      "date" : "5-14-16",
      "text" : "Yesterday was New York, today is Connecticut.  The long, slow march to Maine continues.",
      "title" : "Day 60",
      "img" : "at-2016-img/5-14-16e.jpg"
    },
    "1252996379176430134" : {
      "caption" : "Pretty little waterfalls",
      "include_post" : "Y",
      "id" : "1252996379176430134",
      "latitude" : "42.167",
      "longitude" : "-73.304",
      "date" : "5-15-16",
      "text" : "Check another state off of the list, we're now in Massachusetts.  I started hiking the AT on March 16th, so I guess this is my 2 month mark.  2 months on the trail, does this mean that I only have one more month to go?!? Finishing the AT in 3 months is pretty crazy fast, but I only have about 662 miles to go (I've done 1527 to this point), so it's actually possible.  The northern part of the trail will slow me down quite a bit, the Whites in particular are beautiful but pretty nasty hiking, so who knows.  I guess it doesn't matter: 3 months, 4 months, 6 months, what difference does it make?",
      "title" : "Day 62",
      "img" : "at-2016-img/5-15-16.jpg"
    },
    "1252996463909759547" : {
      "caption" : "The Housatonic River",
      "include_post" : "Y",
      "id" : "1252996463909759547",
      "latitude" : "42.002",
      "longitude" : "-73.434",
      "date" : "5-13-16",
      "text" : "For a good chunk of Connecticut the trail is either near or crossing the Housatonic River and the many small towns located near it.  Today, I ambled down to a town called Cornwall Bridge and found the scene in the photo above:  some sort of kayak race was going on, so I grabbed some food and sat there for awhile watching the racers go by.  It was a great afternoon!",
      "title" : "Day 61",
      "img" : "at-2016-img/5-13-16.jpg"
    },
    "1252996545094707773" : {
      "caption" : "My favorite flower so far",
      "include_post" : "Y",
      "id" : "1252996545094707773",
      "latitude" : "42.342",
      "longitude" : "-73.163",
      "date" : "5-14-16",
      "text" : "Today was just a beautiful day of hiking in Massachusetts.",
      "title" : "Day 63",
      "img" : "at-2016-img/5-14-16f.jpg"
    },
    "1253048943913822536" : {
      "caption" : "Care package day!",
      "include_post" : "Y",
      "id" : "1253048943913822536",
      "latitude" : "42.482",
      "longitude" : "-73.178",
      "date" : "5-15-16",
      "text" : "Dalton, MA was the location for my first trail care package!  It's always like Christmas when you get something in the mail; this one came from my lovely friends at UCH and had a little bit of everything in it.  Thanks everyone, you're awesome!! =)",
      "title" : "Day 64",
      "img" : "at-2016-img/5-15-16b.jpg"
    },
    "1253983272475126426" : {
      "caption" : "Mt Greylock, the highest point in MA.",
      "include_post" : "Y",
      "id" : "1253983272475126426",
      "latitude" : "42.785",
      "longitude" : "-73.124",
      "date" : "5-16-16",
      "text" : "After Greylock it's not very far until you cross the border from MA to VT, and there just happens to be a town right there, so I decided to add a little challenge to my hike: I'm going to go through Vermont without stopping to resupply.  It's only 155 miles from North Adams, MA to Hanover, NH, so I'm not doing anything extreme here, but with the AT there are towns and resupply options everywhere, I don't think I've carried more than 3 days of food this entire trip.  It was quite a shock then to pick up my pack and its 6 days worth of food.  It doesn't help that I decided that I had to have a package of Oreos everyday.  Don't judge me, they're essential for hiking!! But still: so heavy!  This would just be a normal resupply on the PCT, but the AT has turned me into a wimp and I must now face the consequences of that.",
      "title" : "Day 65",
      "img" : "at-2016-img/5-16-16.jpg"
    },
    "1255233511441918018" : {
      "caption" : "Oh those silly hikers.",
      "include_post" : "Y",
      "id" : "1255233511441918018",
      "latitude" : "43.031",
      "longitude" : "-73.039",
      "date" : "5-17-16",
      "text" : "Mmmmm... Mint Oreos.  Worth every sinful ounce of extra weight.",
      "title" : "Day 66",
      "img" : "at-2016-img/5-17-16.jpg"
    },
    "1256042054168438809" : {
      "caption" : "View from Mt Bromley (a ski mountain).",
      "include_post" : "Y",
      "id" : "1256042054168438809",
      "latitude" : "43.256",
      "longitude" : "-72.937",
      "date" : "5-18-16",
      "text" : "Well, today was interesting, I was attacked by 2 dogs.  German Shepherds.  The AT was following a gravel road for about a mile, which is fine, and when it turned right to go back into the woods I noticed a guy about 100 yards down the road holding 2 dogs.  For some reason, he let them go.  They came racing towards me at full speed and when they got to me they surrounded me: they were barking, growling, hair standing up, snapping at me, the works.  One even bit me.  It wasn't bad, the bite didn't draw blood, but still.  When the owners finally pulled the dogs off of me all they said was: 'Oh, sorry about that'. Really?!? Oh sorry about that?!? I should have called 911 and had animal control come pick them up.  I know that sounds mean, but super aggressive, violent dogs like that should never be off leash.  What if next time they attack a little 5 year old girl?  I hate people.",
      "title" : "Day 67",
      "img" : "at-2016-img/5-18-16.jpg"
    },
    "1256604060227300152" : {
      "caption" : "A little fog makes everything better.",
      "include_post" : "Y",
      "id" : "1256604060227300152",
      "latitude" : "43.524",
      "longitude" : "-72.913",
      "date" : "5-19-16",
      "text" : "Today was the polar opposite dog day from yesterday.  Several times during the day a nice, friendly dog would appear on the trail, run up to me while wagging its tail, sniff, say hi, and let me pet it for a minute.  It restored my faith in people and dogs.  At least a little bit.",
      "title" : "Day 68",
      "img" : "at-2016-img/5-19-16.jpg"
    },
    "1257276247045138967" : {
      "caption" : "Only 500 miles to go.  Ha. 'Only'.",
      "include_post" : "Y",
      "id" : "1257276247045138967",
      "latitude" : "43.692",
      "longitude" : "-72.731",
      "date" : "5-20-16",
      "text" : "Help!  I'm turning into a wild animal!  So I was headed down the trail around 7:30pm, and as I'm walking I smell something.  It's orange-y and definitely a human caused smell, but I can't quite place it.  I know it's not from the shelter that I'm headed for, because it's too far away, so I'm walking and sniffing and trying to figure out what this amazing smell is and how I can get some of whatever it is when I see it:  off in the trees is a tent.  I was totally smelling someone's dinner.  Let's add it all up:  I haven't showered or done laundry since Harper's Ferry (that was back in April!) so I smell like an animal, with my crazy beard I look like an animal, and now apparently I'm ready to pounce on poor unsuspecting hikers in an attempt to steal their delicious delicious food.  I'm one  mauling away from being a weak, puny bear.  I'm out of control!  I need a town stop, a day off, and a bar of soap - quickly, before it's too late and there's no going back....",
      "title" : "Day 69",
      "img" : "at-2016-img/5-20-16.jpg"
    },
    "1258059390400424620" : {
      "caption" : "When cows attack",
      "include_post" : "Y",
      "id" : "1258059390400424620",
      "latitude" : "43.702",
      "longitude" : "-72.439",
      "date" : "5-21-16",
      "text" : "The day of the cows... So I was hiking along when the AT crossed into a field, which isn't that unusual, and this time there happened to be cows in the field, again, not unusual.  Normally, the cows will look at you, ignore you, and go back to eating grass.  Today, they all looked up in unison and started running towards me.  Well, they are cows, so it was more like a quick lumber towards me.  They tell you what to do for bears, bobcats, bison, but what about cows?  What do you do when the cows attack?!? As usual, I did nothing and waited to see what would happen.  When they got to me, they surrounded me and were a little timid at first but then... then they started licking me: my legs, sandals, hiking poles.  I assume they were trying to get the salt, but who knows. (FYI, cow tongues are amazingly rough; if you ever get the chance to be licked by a herd of cows, I'd highly recommend it). That's it, the cows confirmed it, a day off and a bar of soap will not save me:  I am no longer human, I have become wild animal and initiated into World of Cow.  They also followed me down the trail once I decided I had been licked enough, so apparently I'm also their leader.  All hail King Cow.  Moo.",
      "title" : "Day 70",
      "img" : "at-2016-img/5-21-16.jpg"
    },
    "1258368431894915386" : {
      "caption" : "Yes, that really is the AT, it goes right up a ladder.",
      "include_post" : "Y",
      "id" : "1258368431894915386",
      "latitude" : "43.702",
      "longitude" : "-72.289",
      "date" : "5-22-16",
      "text" : "I'm technically in New Hampshire, we're done with Vermont!  I really liked Vermont, it's a pretty state with a lot of amazingly nice people.  For example: I was walking down the road towards Norwich, VT and there was a little cooler by someone's mailbox that said 'trail magic', so of course I stopped to check it out.  While I was sitting there a car pulled up and a lady got out to say hello.  We chatted for a bit and she asked me if I needed a place to stay (of course I did!), so now I'm sitting in her basement after taking a long hot shower, my clothes are actually clean and smell like soap again, and they fed me an amazing dinner complete with homemade ice cream.  The generosity of people always amazes me.  Life doesn't get much better than this!",
      "title" : "Day 71",
      "img" : "at-2016-img/5-22-16.jpg"
    },
    "1259055232397699656" : {
      "caption" : "The Holts Ledges",
      "include_post" : "Y",
      "id" : "1259055232397699656",
      "latitude" : "43.79",
      "longitude" : "-72.10",
      "date" : "5-23-16",
      "text" : "Today was a slackpacking day for me, which is where you leave your heavy backpack in town and someone drives you up to a trailhead and you walk back to town.  It's just a way to hike the miles without having to carry a super heavy pack.  I've never done it before, but it's definitely quite popular on the AT.  I've gotta say, I almost forgot how pleasant it can be to hike with just a little day pack, it was so nice!  Yes, Hanover is definitely going to spoil me, I don't know if I'll be able to go back to my 'normal' way of hiking.",
      "title" : "Day 72",
      "img" : "at-2016-img/5-23-16.jpg"
    },
    "1260243652121815558" : {
      "caption" : "Bill Ackerly (aka The Ice Cream Man), may he rest in peace",
      "include_post" : "Y",
      "id" : "1260243652121815558",
      "latitude" : "43.951",
      "longitude" : "-71.946",
      "date" : "5-24-16",
      "text" : "I finally made it out of the wonderful black hole known as Hanover, NH.  Now it's onto the White Mountains, the most difficult section of the AT.  If I get there, that is.  Today I was climbing up Smarts Mtn and apparently decided that I needed to practice up for the summer Olympics, so I slipped on a rock and did a beautiful double twisting back flip with a hard belly-flop landing onto the muddy rocks below.  The Russian judge was quite mean and said it was 'sloppy and poorly executed'. But seriously, I slipped and took a hard fall several feet down; it's absolutely amazing that nothing was broken, that very easily could have been the end of my hike.  Let's hope the rest of the Whites are kinder to me....",
      "title" : "Day 73",
      "img" : "at-2016-img/5-24-16.jpg"
    },
    "1261018587064789500" : {
      "caption" : "On the way to Mt Moosilauke, the entrance to the Whites.",
      "include_post" : "Y",
      "id" : "1261018587064789500",
      "latitude" : "44.101",
      "longitude" : "-71.742",
      "date" : "5-25-16",
      "text" : "I've definitely entered the Whites and they are doing their best to kick my ass.  So far they're succeeding.  I'm already exhausted and I just started this section.  Ugh.",
      "title" : "Day 74",
      "img" : "at-2016-img/5-25-16.jpg"
    },
    "1262363759002347556" : {
      "caption" : "This was hilarious",
      "include_post" : "Y",
      "id" : "1262363759002347556",
      "latitude" : "44.118",
      "longitude" : "-71.647",
      "date" : "5-26-16",
      "text" : "Tomorrow I begin the first above treeline section of the Whites.  It's also supposed to rain tomorrow, of course.  I'm pretty sure it rained the last time I was on the Franconia Ridge, apparently it's just my destiny to get crappy weather for that.  Oh, the picture.... so the bridge over that stream was out, so instead of actually fording the stream those people were doing some sort of human bridge thing where the big guy was catching people as they jumped across.  I waded through the water and laughed at them as they nearly fell in...",
      "title" : "Day 75",
      "img" : "at-2016-img/5-26-16.jpg"
    },
    "1262364036480722985" : {
      "caption" : "Views from the Franconia Ridge",
      "include_post" : "Y",
      "id" : "1262364036480722985",
      "latitude" : "44.193",
      "longitude" : "-71.489",
      "date" : "5-27-16",
      "text" : "Shockingly, it didn't rain on me while I was hiking the Franconia Ridge!  It rained last night and then stopped just in time for me to pack everything up and head out.  I thought for sure it was going to rain all day, I guess my curse must be lifted.  But with the fog and cloudy weather the views up there were incredible!",
      "title" : "Day 76",
      "img" : "at-2016-img/5-27-16.jpg"
    },
    "1263870696948853368" : {
      "caption" : "That's not my tent, I just liked the image",
      "include_post" : "Y",
      "id" : "1263870696948853368",
      "latitude" : "44.310",
      "longitude" : "-71.168",
      "date" : "5-28-16",
      "text" : "That's it.  The Whites have won.  They've beaten me into submission.... They just never let up, it's unrelenting brutal trail.  This has to end eventually, right?",
      "title" : "Day 78",
      "img" : "at-2016-img/5-28-16.jpg"
    },
    "1263870767010507387" : {
      "caption" : "Mt Washington (the one with the stuff on top)",
      "include_post" : "Y",
      "id" : "1263870767010507387",
      "latitude" : "44.279",
      "longitude" : "-71.255",
      "date" : "5-29-16",
      "text" : "I'm getting tired of the White Mountains and dealing with AMC nonsense.  The AMC (Appalachian Mountain Club) runs a series of huts and campsites in the White Mountains, all for a fee, of course.  Well, around Mt Washington they have a hut called 'Lakes of the Clouds' that you can stay in for a very large fee.  However, they have a bunk room for thru-hikers for 10 bucks a night, which is acceptable.  The reason I bring this up is that this hut is the last option for a place to sleep on the trail for 14 miles (because everything is above treeline in this section and camping is forbidden). Anyway, the plan was to stay at the hut and hike the above treeline section tomorrow.  I got to the hut around 5pm and they were still 'setting up' for the season.  Thru hiker request to sleep there denied.  My only option then was to take a side trail down the mountain, losing about 3000 feet of elevation, in order to find a place to camp.  Travis is not a very happy camper tonight.",
      "title" : "Day 77",
      "img" : "at-2016-img/5-29-16.jpg"
    },
    "1264107691214203198" : {
      "caption" : "A typical climb in the Whites",
      "include_post" : "Y",
      "id" : "1264107691214203198",
      "latitude" : "44.423",
      "longitude" : "-71.105",
      "date" : "5-30-16",
      "text" : "It's hard to get a picture to show just how horrible the hiking is in the Whites, but I tried.  That is actual trail.  I use the term 'trail' pretty loosely here.  It goes right up those rocks to the boulder at the very top.  This is just normal trail in the Whites.  Oh well, what can you do?  It is what it is.  Tomorrow I should be in Maine, less than 300 miles to go!",
      "title" : "Day 79",
      "img" : "at-2016-img/5-30-16.jpg"
    },
    "1265217176343243184" : {
      "caption" : "The Mahoosuc Notch",
      "include_post" : "Y",
      "id" : "1265217176343243184",
      "latitude" : "44.546",
      "longitude" : "-70.977",
      "date" : "5-31-16",
      "text" : "Today was the Mahoosuc Notch, which is described as: 'the most difficult or fun mile of the AT, depending on your point-of-view'. It's a jumbled maze of boulders that has you going up, over, and under the boulders.  Yes, under.  Those were the worst, because you had to take your pack off, crawl through, yank your pack through after you.  It was a pain in the ass.  But love it or hate it, the Mahoosuc Notch is an AT institution!",
      "title" : "Day 80",
      "img" : "at-2016-img/5-31-16.jpg"
    },
    "1266882214216952022" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1266882214216952022",
      "latitude" : "44.671",
      "longitude" : "-70.884",
      "date" : "6-1-16",
      "text" : "I'm tired of complaining about rocks and boulders and crappy trail.  Instead, I'm going to post pretty waterfall pictures and dream of finding a never-ending bowl of ice cream.",
      "title" : "Day 81",
      "img" : "at-2016-img/6-1-16.jpg"
    },
    "1266882244407552215" : {
      "caption" : "It rained all day and I didn't take a single picture, so you get pretty flowers from weeks ago instead",
      "include_post" : "Y",
      "id" : "1266882244407552215",
      "latitude" : "44.835",
      "longitude" : "-70.723",
      "date" : "6-2-16",
      "text" : "One of the consequences of this tough trail is that I tend to vastly overestimate how many miles I can do everyday.  As a result, I'm basically out of food.  I have whatever is left in my jar of peanut butter to get me to Rangeley tomorrow.  It'll be fine, I'll get there, I'm just not use to cutting it this close, I'm usually quite conservative with my food and water.",
      "title" : "Day 82",
      "img" : "at-2016-img/6-2-16.jpg"
    },
    "1266884296705665325" : {
      "caption" : "Not the greatest picture, sorry about that.",
      "include_post" : "Y",
      "id" : "1266884296705665325",
      "latitude" : "44.965",
      "longitude" : "-70.643",
      "date" : "6-3-16",
      "text" : "This post is coming from Rangeley, Maine.  That's right, we're well into Maine now!  It's a nice little town, so I'm taking the afternoon off to relax and enjoy it a little bit.  Only 220 miles to go!",
      "title" : "Day 83",
      "img" : "at-2016-img/6-3-16.jpg"
    },
    "1267738673226017143" : {
      "caption" : "View from Saddleback Mountain",
      "include_post" : "Y",
      "id" : "1267738673226017143",
      "latitude" : "45.011",
      "longitude" : "-70.329",
      "date" : "6-4-16",
      "text" : "Several people sent me a New York Times article about Inchworm, an AT hiker who wandered off the trail, got lost and eventually died.  I was thinking about her a lot, because the area I walked through today was where it all happened.  I was wondering if I'm really that different from her, when I think about all of the times I've been hiking and could have had a horrible outcome: like all the times I was above treeline and a thunderstorm rolled in, or when I hiked over a glacier and a blizzard swept in, or when I got lost and hiked to the wrong pass and instead of turning around I hiked down over a crumbly melty glacier, etc.  You get the idea.  Is it just dumb luck that I'm still out here hiking and she's gone?  I don't know.  I do know that it's really easy to analyze her decisions and actions and try to find the flaw that caused everything.  If something horrible happened to me would people analyze me looking for that one critical hiker rule that I broke and use it as a cautionary tale?  Probably.  I think we should take a different approach though.  Instead of using her death to scare people, let's celebrate her and her courage to leave behind her life, friends, family in order to go on an incredible adventure.  So here's to you, Inchworm: may your life be an inspiration to everyone who hears about it!",
      "title" : "Day 84",
      "img" : "at-2016-img/6-4-16.jpg"
    },
    "1268473695121795240" : {
      "caption" : "2000 miles!  Woo hoo!!!",
      "include_post" : "Y",
      "id" : "1268473695121795240",
      "latitude" : "45.146",
      "longitude" : "-70.282",
      "date" : "6-5-16",
      "text" : "There was a more official 2000 mile marker, but I like the hiker-made one way better.  Lately, I've been crossing Maine's High Peaks: the Bigelows, the Crocketts, the Mahoosucs, the Saddlebacks, etc.  Tomorrow I just have to climb Avery Peak and I'll pretty much be done with the Bigelows and Maine's High Peaks.  After that it's smooth sailing all the way to Katahdin.  Hopefully at least!!",
      "title" : "Day 85",
      "img" : "at-2016-img/6-5-16.jpg"
    },
    "1270492160754018639" : {
      "caption" : "Pretty moss-covered trail in Maine",
      "include_post" : "Y",
      "id" : "1270492160754018639",
      "latitude" : "45.240",
      "longitude" : "-70.055",
      "date" : "6-6-16",
      "text" : "We've been running into a lot of Southbounders (or SOBOs) lately - SOBOs are people who start their hike in Maine and head to Georgia.  They're still all happy to be out here and they get really excited about the last mountain that they climbed.  It's so cute, I just want to pinch their cheeks and pat them on the head and say: 'Good SOBO, you're such a good SOBO!' Oh I'm just kidding, but it is nice to see people with energy out here instead of that dirty, tired, broken-down look that most Northbounders have by this point.",
      "title" : "Day 86",
      "img" : "at-2016-img/6-6-16.jpg"
    },
    "1270492247265732946" : {
      "caption" : "This is why we love Maine, look at that view.",
      "include_post" : "Y",
      "id" : "1270492247265732946",
      "latitude" : "45.283",
      "longitude" : "-69.730",
      "date" : "6-7-16",
      "text" : "Tomorrow will be a better day.",
      "title" : "Day 87",
      "img" : "at-2016-img/6-7-16.jpg"
    },
    "1270495029272078785" : {
      "caption" : "Bigelow Mountain.  Obviously it was a beautiful day.",
      "include_post" : "Y",
      "id" : "1270495029272078785",
      "latitude" : "45.286",
      "longitude" : "-69.501",
      "date" : "6-8-16",
      "text" : "I'm sitting in Monson, Maine: this is pretty much it, this is my last resupply point, after this it's the hundred mile wilderness, then I just have to climb one little mountain and I'm done.  The slow, steady march to Maine and Mt Katahdin continues, but is almost over...",
      "title" : "Day 88",
      "img" : "at-2016-img/6-8-16.jpg"
    },
    "1273456797053184247" : {
      "caption" : "Lots and lots of ponds in Maine",
      "include_post" : "Y",
      "id" : "1273456797053184247",
      "latitude" : "45.465",
      "longitude" : "-69.266",
      "date" : "6-9-16",
      "text" : "I don't know how it happened, but somehow when I was buying my resupply in Monson I managed to get granola with no sugar in it.  I didn't even know such a thing existed, isn't the whole point of granola to get massive amounts of sugar but to have it with oatmeal so you can feel like it's healthy?  Without the sugar it's just, well, oatmeal.  Not to worry though, luckily I always carry a 2-pound sack of brown sugar for just such emergencies.  It's the first thing they teach you in hiking school: always be prepared for these catastrophic events.",
      "title" : "Day 89",
      "img" : "at-2016-img/6-9-16.jpg"
    },
    "1273456942008330491" : {
      "caption" : "The Hiker Hut - an amazing hostel!",
      "include_post" : "Y",
      "id" : "1273456942008330491",
      "latitude" : "45.640",
      "longitude" : "-69.088",
      "date" : "6-10-16",
      "text" : "It was another foggy, rainy day today so I didn't take any pictures.  Instead, you get a picture of the Hiker Hut in Rangeley Maine, one of my favorite places along the trail so far.  I'd say that I'm getting tired of the rain, but I'm only 3 days away from finishing my hike, so at this point I just don't care.  Rain, snow, hurricanes, bring it on....",
      "title" : "Day 90",
      "img" : "at-2016-img/6-10-16.jpg"
    },
    "1273457008840370431" : {
      "caption" : "There it is, my first view of Katahdin.",
      "include_post" : "Y",
      "id" : "1273457008840370431",
      "latitude" : "45.799",
      "longitude" : "-69.170",
      "date" : "6-11-16",
      "text" : "Today was a good day!  The trail was actually flat, I was able to do 30 miles again for the first time in a long time.  I can feel the end getting closer, but it doesn't really feel real yet.  It's hard to explain, it just doesn't feel like I'm about to be done and yet it does.  The trail is weird.  Anyway, tomorrow is Abol Bridge (camp store, restaurant, etc) and the end of the 100 mile wilderness.  I'm definitely looking forward to massive amounts of food one last time!!",
      "title" : "Day 91",
      "img" : "at-2016-img/6-11-16.jpg"
    },
    "1273584786583677100" : {
      "caption" : "One last picture of pretty trail in Maine.",
      "include_post" : "Y",
      "id" : "1273584786583677100",
      "latitude" : "45.835",
      "longitude" : "-68.969",
      "date" : "6-12-16",
      "text" : "Help!  So... Many.... Southbounders.... They haven't seen enough Northbounders yet, so we're still a novelty to them and they tend to stop us and ask a lot of questions, like: SOBO: 'What is the trail like south of here?' Travis: 'Umm... Rocky.' SOBO: 'No, really, give me a mile-by-mile description of the trail from here to Georgia.' Travis: 'Umm... Rocks?' SOBO: 'You are useless.' Travis:  Nods head.  Walks away.",
      "title" : "Day 92",
      "img" : "at-2016-img/6-12-16.jpg"
    },
    "1274261055415609664" : {
      "caption" : "Katahdin",
      "include_post" : "Y",
      "id" : "1274261055415609664",
      "latitude" : "45.904",
      "longitude" : "-68.922",
      "date" : "6-13-16",
      "text" : "That's it, made it to Katahdin and the end of the trail!",
      "title" : "Day 93",
      "img" : "at-2016-img/6-13-16.jpg"
    },
    "1274598223963057103" : {
      "caption" : "Tinman and Travis",
      "include_post" : "Y",
      "id" : "1274598223963057103",
      "latitude" : "44.491",
      "longitude" : "-68.373",
      "date" : "6-17-16",
      "text" : "I just wanted to add a bonus picture of the Tinman, we hiked through a lot of Maine together!",
      "title" : "Post AT Day",
      "img" : "at-2016-img/6-17-16.jpg"
    },
    "1274611107447269695" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1274611107447269695",
      "latitude" : "",
      "longitude" : "",
      "date" : "6-17-16",
      "text" : "This was on the way down from Katahdin, the trail is called 'The Knife Edge'. I thought it was going to be horrible and terrifying (I'm a tiny bit afraid of heights), but it really wasn't that bad.  A little rock climb-y in places, but overall gorgeous and well worth it!",
      "title" : "Bonus Katahdin Pics",
      "img" : "at-2016-img/6-17-16b.jpg"
    },
    "1274612855037585790" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1274612855037585790",
      "latitude" : "",
      "longitude" : "",
      "date" : "6-17-16",
      "text" : "I thought it would be hilarious to have my 'Katahdin sign' photo to be of me shoving cookies into my mouth.  Ice cream would have been more appropriate, but you gotta work with what you have.  It's hard to tell what I'm doing in the photo though, I was a little disappointed.",
      "title" : "Bonus Katahdin Pics",
      "img" : "at-2016-img/6-17-16c.jpg"
    },
    "1274614244392397241" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1274614244392397241",
      "latitude" : "",
      "longitude" : "",
      "date" : "6-17-16",
      "text" : "Probably my favorite picture of the Tinman, just lounging around outside of Abol Bridge (a little camp store right before Katahdin).",
      "title" : "Bonus AT pics",
      "img" : "at-2016-img/6-17-16d.jpg"
    },
    "1274615308940306915" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1274615308940306915",
      "latitude" : "",
      "longitude" : "",
      "date" : "6-17-16",
      "text" : "The Knife Edge.  That ridge was the trail we hiked down from the top of Katahdin.  Doesn't it look fun?!?",
      "title" : "Bonus Katahdin Pics",
      "img" : "at-2016-img/6-17-16e.jpg"
    },
    "1274616126192052729" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1274616126192052729",
      "latitude" : "",
      "longitude" : "",
      "date" : "6-17-16",
      "text" : "I just really liked this picture...",
      "title" : "Bonus Katahdin Pics",
      "img" : "at-2016-img/6-17-16f.jpg"
    },
    "1274617886281394743" : {
      "caption" : "Sunrise in Acadia",
      "include_post" : "Y",
      "id" : "1274617886281394743",
      "latitude" : "",
      "longitude" : "",
      "date" : "6-17-16",
      "text" : "Tinman and his mom were kind enough to give me a ride back to civilization, and on the way back we figured: why not go through Acadia, it's right there? So we woke up early, watched the sunrise from the top of Cadillac Mountain and then drove through the park.  So pretty!",
      "title" : "Bonus AT pics",
      "img" : "at-2016-img/6-17-16g.jpg"
    },
    "1274617886281394744" : {
      "caption" : "I agree",
      "include_post" : "Y",
      "id" : "1274617886281394744",
      "latitude" : "",
      "longitude" : "",
      "date" : "6-17-16",
      "text" : "",
      "title" : "Bonus AT pics",
      "img" : "at-2016-img/6-17-16h.jpg"
    }
  }