{
    "1" : {
        "caption" : "My HK Airbnb.  The perfect size.",
        "include_post" : true,
        "id" : "1",
        "latitude" : "22.31",
        "longitude" : "114.17",
        "date" : "2019-2-23",
        "text" : "I arrived in Hong Kong at night, took a bus from the airport and then somehow navigated through the streets to my Airbnb.  When I got there, I found this... A room just barely big enough for a bed, a tiny bathroom, and I suppose I'll be generous and call that a kitchen.  But it was perfect!  It had everything that I needed and no one to bother me.  I loved it and would happily go back.",
        "title" : "Hong Kong - Day 1",
        "img" : "/img/cambodia-2019/2-23-19.jpg"
    },
    "2" : {
        "caption" : "The street outside of my Airbnb",
        "include_post" : true,
        "id" : "2",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-23",
        "text" : "This was right out my door.  It's hard to find someplace in HK that isn't in the middle of super tall buildings, but it still felt very vibrant and alive when I was walking around this area at night.",
        "title" : "Hong Kong - Day 1",
        "img" : "/img/cambodia-2019/2-23-19b.jpg"
    },
    "4" : {
        "caption" : "It was the year of the pig.  Lots of decorations like this everywhere.",
        "include_post" : true,
        "id" : "4",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-24",
        "text" : "",
        "title" : "Hong Kong - Day 2",
        "img" : "/img/cambodia-2019/2-24-19.jpg"
    },
    "5" : {
        "caption" : "My dumplings",
        "include_post" : true,
        "id" : "5",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-24",
        "text" : "I went to this place specifically because they were supposed to have some of the best dumplings in HK.  They were ok, honestly, I was expecting better.",
        "title" : "Hong Kong - Day 2",
        "img" : "/img/cambodia-2019/2-24-19b.jpg"
    },
    "6" : {
        "caption" : "Inside a temple",
        "include_post" : true,
        "id" : "6",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-24",
        "text" : "These temples were beautiful, but as soon as I walked into them I would always gasp for breath (they were filled with hundreds?  Thousdands?  Millions?  Of burning incense.  It was... something.",
        "title" : "Hong Kong - Day 2",
        "img" : "/img/cambodia-2019/2-24-19c.jpg"
    },
    "7" : {
        "caption" : "Bike Path in HK",
        "include_post" : true,
        "id" : "7",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-24",
        "text" : "Hong Kong has an amazing bike path... the water was on one side and the obligatory super tall buildings were on the other.  I spent a lot of time wandering around on and near this bike path.",
        "title" : "Hong Kong - Day 2",
        "img" : "/img/cambodia-2019/2-24-19d.jpg"
    },
    "8" : {
        "caption" : "A ferry",
        "include_post" : true,
        "id" : "8",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-24",
        "text" : "You could easily get from one side of HK to the other with their amazing subway system, but for a mere dollar (I think?  I don't remember exactly, but it was cheap), you can take a ferry and get some incredible views of HK in the process.",
        "title" : "Hong Kong - Day 2",
        "img" : "/img/cambodia-2019/2-24-19e.jpg"
    },
    "9" : {
        "caption" : "One of my favorite pics of the HK skyline",
        "include_post" : true,
        "id" : "9",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-25",
        "text" : "I just really like this picture.  It was probably taken from a bike path",
        "title" : "Hong Kong - Day 3",
        "img" : "/img/cambodia-2019/2-25-19.jpg"
    },
    "10" : {
        "caption" : "The night market",
        "include_post" : true,
        "id" : "10",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-25",
        "text" : "A few blocks from where I stayed was the night market.  Several blocks of outdoor stalls like this, mostly selling tourist crap, but if you were looking for something specific you could probably find it.  Haggling is required though, which made me less inclined to actually try to buy things.",
        "title" : "Hong Kong - Day 3",
        "img" : "/img/cambodia-2019/2-25-19b.jpg"
    },
    "11" : {
        "caption" : "These were everywhere near where I was staying",
        "include_post" : true,
        "id" : "11",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-25",
        "text" : "In addition to the night market, there were tons of restaurants like this in the area.  Yummy food and pretty cheap too, what's not to love?!?",
        "title" : "Hong Kong - Day 3",
        "img" : "/img/cambodia-2019/2-26-19.jpg"
    },
    "12" : {
        "caption" : "My sleeping boys",
        "include_post" : true,
        "id" : "12",
        "latitude" : "13.75",
        "longitude" : "100.5",
        "date" : "2019-2-26",
        "text" : "I wanted to spend a day in Bangkok, mostly to say that I had been to Bangkok.  I didn't get to see a whole lot, I got there in the afternoon, took a bus to my hotel, wandered around a bit, and then went to sleep.  The next day I suppose I could have flown to Cambodia, but I wanted to try and experience a little bit of the Thailand/Cambodia countryside, so I took a bus.  It wasn't the most scenic, but it WAS filled with backpackers looking to get to Cambodia on the cheap.  They were a hoot.  When they were awake, at least.",
        "title" : "Bangkok - Day 4",
        "img" : "/img/cambodia-2019/2-27-19a.jpg"
    },
    "13" : {
        "caption" : "Siem Reap.  The closest town to Angkor Wat.  I hated it.",
        "include_post" : true,
        "id" : "13",
        "latitude" : "13.35",
        "longitude" : "103.85",
        "date" : "2019-2-27",
        "text" : "If you're going to explore Angkor Way, you're probably going to be staying in Siem Reap, the closest town (maybe 5 miles away?).  It's a horrible, horrible tourist trap of a city.  I couldn't walk 10 feet down the street without someone annoying me and trying to get me to buy something.  One of my very favorite things to do is to simply wander around a new place, and Siem Reap ruined that for me by constantly hassling me.  Ugh.  Angor Wat was so amazing, I wish Siem Reap had been as well :(",
        "title" : "Cambodia - Day 5",
        "img" : "/img/cambodia-2019/2-27-19b.jpg"
    },
    "14" : {
        "caption" : "Ta Prohm (The Tomb Raider Temple)",
        "include_post" : true,
        "id" : "14",
        "latitude" : "13.43",
        "longitude" : "103.89",
        "date" : "2019-2-28",
        "text" : "Angkor Wat is actually made up of a series of individual temples.  To get to them, you have to either rent a bike, walk, or hire a tuk-tuk driver.  Since it's miles between temples and temperatures were over 90 everyday, I decided to be lazy and hire a tuk-tuk driver.  So I woke up bright and early (in an futile attempt to beat the crowds) and went to Ta Prohm, also known as the Tomb Raider temple, because it was featured in Angelina Jolie's movie.  The giant trees covering the stone temples are the distinguishing feature here, and it was pretty amazing, it set the bar pretty high as my first temple.",
        "title" : "Cambodia - Day 6",
        "img" : "/img/cambodia-2019/2-28-19.jpg"
    },
    "15" : {
        "caption" : "More Ta Prohm",
        "include_post" : true,
        "id" : "15",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-28",
        "text" : "Another pic from Ta Prohm.  There are probably more pics of this temple in the extra section, it was very photogenic :)",
        "title" : "Cambodia - Day 6",
        "img" : "/img/cambodia-2019/2-28-19b.jpg"
    },
    "16" : {
        "caption" : "You get used to climbing stairs after awhile",
        "include_post" : true,
        "id" : "16",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-28",
        "text" : "I forget the name of this temple, but it was beautiful.  Loved it.",
        "title" : "Cambodia - Day 6",
        "img" : "/img/cambodia-2019/2-28-19c.jpg"
    },
    "17" : {
        "caption" : "The East(?) Gate of Bayon",
        "include_post" : true,
        "id" : "17",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-28",
        "text" : "Bayon was my third or fourth temple of the day, and by this time the tourist hourde was starting to descend.  The temple this belongs to is probably the 2nd busiest after Angkor Wat itself, and it was craaaazy when I was there.  People.  Everywhere.  I couldn't handle it, so I escaped and took a dirt road east to this gate.  There was no one else there, which is absolutely perfect for me.  It was a really beautiful structure too, it's too bad that most people won't walk the extra mile to get here.  Well, bad for them, good for me.",
        "title" : "Cambodia - Day 6",
        "img" : "/img/cambodia-2019/2-28-19d.jpg"
    },
    "18" : {
        "caption" : "The tourists have arrived",
        "include_post" : true,
        "id" : "18",
        "latitude" : "13.44",
        "longitude" : "103.86",
        "date" : "2019-2-28",
        "text" : "Ugh.  This might not look too bad, but this was just the entrance to the temple, once inside there are far fewer places for all of the people to go, so they get even more bunched together.  Add it all up and you get one cranky Travis, which is why I had to escape to the east gate in the previous picture",
        "title" : "Cambodia - Day 6",
        "img" : "/img/cambodia-2019/2-28-19e.jpg"
    },
    "19" : {
        "caption" : "The highest level in Angkor Wat",
        "include_post" : true,
        "id" : "19",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-2-28",
        "text" : "The main Angkor Wat temple itself is a series of different levels, these stairs take you to the highest level, and oofta, they were not for the faint of heart, they're more a ladder than a set of stairs, I can't even imagine how many tourists would die if they hadn't built the stairs and railings on top of the stone ones.",
        "title" : "Cambodia - Day 6",
        "img" : "/img/cambodia-2019/2-28-19f.jpg"
    },
    "20" : {
        "caption" : "Angkor Wat, via the reflecting pools",
        "include_post" : true,
        "id" : "20",
        "latitude" : "13.41",
        "longitude" : "103.86",
        "date" : "2019-2-28",
        "text" : "There are pools on either side of Angkor Wat, which make for lovely places to take a picture.  If you can fight through the crowds of people all trying to do the same thing that you are...",
        "title" : "Cambodia - Day 6",
        "img" : "/img/cambodia-2019/2-28-19g.jpg"
    },
    "21" : {
        "caption" : "I have no idea who she is, but I love her anyway",
        "include_post" : true,
        "id" : "21",
        "latitude" : "13.435",
        "longitude" : "103.92",
        "date" : "2019-3-1",
        "text" : "For my second day of temples, I hired the same tuk-tuk driver and he took me to all of the temples that we didn't get to on the first day.  Since we hit the biggest and most popular temples the first day, all that was left were the smaller ones.  I actually liked them better, fewer people, just as pretty.  Yup, give me the small ones anyday.",
        "title" : "Cambodia - Day 7",
        "img" : "/img/cambodia-2019/3-1-19.jpg"
    },
    "22" : {
        "caption" : "I don't think this is Ta Prohm, it's another temple with one tree-covered door, but I forget the name of it.",
        "include_post" : true,
        "id" : "22",
        "latitude" : "13.4",
        "longitude" : "103.9",
        "date" : "2019-3-1",
        "text" : "When I was going through my pictures (admitedly a few months later), I thought this was another picture from Ta Prohm, but I don't think it is, there was another temple that had a single tree like this, and EVERYONE was crowded around this one doorway trying to get a picture.  I had to wait for like 20 minutes to get a shot without any random people in it.",
        "title" : "Cambodia - Day 7",
        "img" : "/img/cambodia-2019/3-1-19b.jpg"
    },
    "23" : {
        "caption" : "The market in Siem Reap",
        "include_post" : true,
        "id" : "23",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-2",
        "text" : "This place was Siem Reap's only redeeming feature:  the market.  I could wander around here for hours just looking at everything.  Really good food in here too.  Really good food if you like slightly questionable food served from a food stall, which I do.  Bring.  It.  On.",
        "title" : "Cambodia - Day 8",
        "img" : "/img/cambodia-2019/3-2-19.jpg"
    },
    "24" : {
        "caption" : "Hong Kong money",
        "include_post" : true,
        "id" : "24",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "I don't know why I like taking pictures of the local money so much.  But whatever.",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra1.jpg"
    },
    "25" : {
        "caption" : "I guess this means the food is fresh?",
        "include_post" : true,
        "id" : "25",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "These were sitting outside, on the sidewalk, in front of one of those Hong Kong outdoor restaurants.  I don't know if you walk up to a bucket and pick out your dinner, or if this is just to prove that the seafood is fresh?  Not sure, didn't eat here, couldn't walk away from it all fast enough.",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra2.jpg"
    },
    "26" : {
        "caption" : "Hong Kong Subway, it really is this clean and beautiful",
        "include_post" : true,
        "id" : "26",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "Pay attention USA, this is what a clean, beautiful subway looks like.",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra3.jpg"
    },
    "27" : {
        "caption" : "The view from the ferry in HK",
        "include_post" : true,
        "id" : "27",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "Taking the ferry at least once was definitely worth it.  They run like every 5 minutes, cost maybe a dollar (you can even use your subway card to pay!), and you get views like this.  Worth it!",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra4.jpg"
    },
    "28" : {
        "caption" : "",
        "include_post" : true,
        "id" : "28",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "I forget the name of this, but it was beautiful",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra5.jpg"
    },
    "29" : {
        "caption" : "The inside of the previous temple",
        "include_post" : true,
        "id" : "29",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "I never did quite get the reason for leaving food at these alters, but it was always there.  Every once-in-a-while, I'd be walking around, would be super hungry, and a little part of me wondered:  'Would I go straight to hell for taking some of this temple food?'  I never did, of course, but I do admit to thinking about it...",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra6.jpg"
    },
    "30" : {
        "caption" : "The Thailand Cambodia border",
        "include_post" : true,
        "id" : "30",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "Crossing the border into Cambodia from Bangkok via the bus.  It was an interesting experience.  Luckily, I got an e-visa before I left, so my entry was pretty quick and painless",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra7.jpg"
    },
    "31" : {
        "caption" : "A tuk-tuk scooter traffic jam.",
        "include_post" : true,
        "id" : "31",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "There were definitely more little scooters and tuk-tuks than actual cars in Siem Reap",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra8.jpg"
    },
    "32" : {
        "caption" : "A random 'restaurant' in HK",
        "include_post" : true,
        "id" : "32",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "I was hungry and literally just picked the first place that I saw to eat in.  The menu was entirely in Chinese, so I just pointed at something and hoped for the best.  It wasn't bad",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra9.jpg"
    },
    "33" : {
        "caption" : "Not even sure which Cambodia temple this is",
        "include_post" : true,
        "id" : "33",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "Some random Angkor Wat temple, but I like the picture",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra10.jpg"
    },
    "34" : {
        "caption" : "Me.  Angkor Wat.",
        "include_post" : true,
        "id" : "34",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "I suppose I had to include one selfie to prove that I was really at Angkor Wat?",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra11.jpg"
    },
    "35" : {
        "caption" : "",
        "include_post" : true,
        "id" : "35",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "I actually liked the temples that were more run down and crumbly better than the restored ones.  Angkor Wat itself is beautiful, but a little too 'pristine' for me, everything has been restored, I prefer something like this",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra12.jpg"
    },
    "36" : {
        "caption" : "",
        "include_post" : true,
        "id" : "36",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra13.jpg"
    },
    "37" : {
        "caption" : "My tuk-tuk driver",
        "include_post" : true,
        "id" : "37",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "My driver!  The poor guy, he must get so bored waiting for tourists at each of these temples, I would often get done exploring and come back to find him taking a nap.  I almost didn't want to wake him, but I had things to see and places to go...",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra14.jpg"
    },
    "38" : {
        "caption" : "Monks plus elephants",
        "include_post" : true,
        "id" : "38",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "Monks riding an elephant, what more do you want?!?",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra15.jpg"
    },
    "39" : {
        "caption" : "",
        "include_post" : true,
        "id" : "39",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra16.jpg"
    },
    "40" : {
        "caption" : "Ta Prohm.  Again.",
        "include_post" : true,
        "id" : "40",
        "latitude" : "",
        "longitude" : "",
        "date" : "2019-3-3",
        "text" : "This one is definitely Ta Prohm.  Well, I'm like 90% sure it is.",
        "title" : "Extra pics",
        "img" : "/img/cambodia-2019/extra17.jpg"
    }
}