{
  "1": {
    "caption": "The Camino de Santiago",
    "include_post": true,
    "id": "1",
    "latitude": "",
    "longitude": "",
    "date": "10-17-19",
    "text": "There are a LOT of caminos in Europe.  They're all pilgrimage trails, but the most famous and most heavily used one is the 'Camino Frances', the French Way.  The traditional starting point is St Jean, just over the border in France.  I didn't think that I had enough time to start at St. Jean, so I started in Pamplona (turns out that I did have enough time, just barely.  But how was I to know that before I started?  You do the best you can with what you have).  This map just shows the general route, mine is the bold red line, going from Pamplona to Santiago.  Approximately 450 miles (725 km).  2 weeks.  Oh yeah.",
    "title": "Day 0",
    "img": "/img/camino-2019/camino2.png"
  },
  "1.1": {
    "caption": "The beautiful streets of Pamplona",
    "include_post": true,
    "id": "1.1",
    "latitude": "42.81",
    "longitude": "-1.65",
    "date": "10-18-19",
    "text": "Oh Pamplona.  It really is a beautiful city.  I didn't really get to appreciate it though, this day was all about traveling from Nashville to Spain.  My flight out of Nashville was delayed and I was connecting through Dulles, so I literally had to run from my plane to the gate in Dulles.  Except I don't run, so I walked quickly while muttering very bad things about airlines the entire way.  Just barely made it.  Then once I got to Pamplona, I spent an hour trying to track down where I could buy a Pilgrim's Credential (you have to get stamps along the way to prove you actually walked the Camino, those stamps are kept in an 'official' credential passport), and then I was off to walk 15 miles or so to the town I was planning to sleep in.  I really should have spent more time in Pamplona.  Oh well, next trip, I suppose.",
    "title": "Day 1 - Pamplona",
    "img": "/img/camino-2019/10-18-19e.jpg"
  },
  "2": {
    "caption": "",
    "include_post": true,
    "id": "2",
    "latitude": "",
    "longitude": "",
    "date": "10-18-19",
    "text": "",
    "title": "Day 1b",
    "img": "/img/camino-2019/10-18-19d.jpg"
  },
  "3": {
    "caption": "",
    "include_post": true,
    "id": "3",
    "latitude": "",
    "longitude": "",
    "date": "10-18-19",
    "text": "The Camino is REALLY well marked.  Like super well marked.  Better marked than the Appalachian Trail even.  There are signs like this EVERYWHERE, and when there aren't signs, there are hand-painted yellow arrows pointing you in the right direction.  I almost never had to even think about which way to go, there was always something there to show you the way.",
    "title": "Day 1c",
    "img": "/img/camino-2019/10-18-19c.jpg"
  },
  "4": {
    "caption": "'Your Camino is very important, but no more than others'",
    "include_post": true,
    "id": "4",
    "latitude": "",
    "longitude": "",
    "date": "10-18-19",
    "text": "My spanish is a little rusty, so I'm not 100% sure about that translation, but it's close, right?  Anyway, I loved this, reminded me that I wasn't the center of the universe just because I was hiking the Camino de Santiago.  It's important to remember that; I'm not entitled to anything just because I'm walking.",
    "title": "Day 1d",
    "img": "/img/camino-2019/10-18-19b.jpg"
  },
  "5": {
    "caption": "A little monument at the top of the hill",
    "include_post": true,
    "id": "5",
    "latitude": "",
    "longitude": "",
    "date": "10-18-19",
    "text": "The first 'big' climb for me was on the first day, up to this point.  And this would be the last climb for, oh, about a week?  The Camino is really, really flat, especially in the middle, you're mostly walking through farmland for much of it.  If you start in St. Jean, you have to cross the Pyrenees mountains, which are *probably* not flat, but I didn't hike them, so how would I know?",
    "title": "Day 1e",
    "img": "/img/camino-2019/10-18-19a.jpg"
  },
  "6": {
    "caption": "A VERY typical view on the Camino",
    "include_post": true,
    "id": "6",
    "latitude": "42.67",
    "longitude": "-1.81",
    "date": "10-19-19",
    "text": "You'll see a lot of this on the Camino:  a gravel road, farmland, maybe some vineyards, and other Pilgrims walking along.  If you plan to hike the Camino, I hope you really enjoy this photo, because this is basically what you'll be seeing 90% of the time.",
    "title": "Day 2 - Puente la Reina",
    "img": "/img/camino-2019/10-19-19a.jpg"
  },
  "7": {
    "caption": "The wine fountain!!",
    "include_post": true,
    "id": "7",
    "latitude": "",
    "longitude": "",
    "date": "10-19-19",
    "text": "This was AWESOME!  This is a wine fountain, as in you open the spigot and out comes beautiful, delicious, red wine.  As much as you want, I guess.  It's free, just sitting there waiting to be used.  I'm not a huge fan of red wine, so I just sampled it and moved on, but I could see a certain type of hiker or a certain groups of hikers hanging out here and enjoying this place a little too much.  Maybe eventually a cranky out caretaker comes out to shoo people away?!?",
    "title": "Day 2b",
    "img": "/img/camino-2019/10-19-19b.jpg"
  },
  "8": {
    "caption": "",
    "include_post": true,
    "id": "8",
    "latitude": "",
    "longitude": "",
    "date": "10-19-19",
    "text": "I feel like I take this picture a lot.  Most of the towns we go through are like this: narrow, winding streets.  I love it, and could wander around them all day.",
    "title": "Day 2c",
    "img": "/img/camino-2019/10-19-19c.jpg"
  },
  "9": {
    "caption": "Pilgrim graffiti",
    "include_post": true,
    "id": "9",
    "latitude": "",
    "longitude": "",
    "date": "10-19-19",
    "text": "What is it with people and the need to write on everything?  If it's stationary and along the Camino, it probably has been written on.  I actually enjoyed this quote though.",
    "title": "Day 2d",
    "img": "/img/camino-2019/10-19-19d.jpg"
  },
  "10": {
    "caption": "An olive oasis",
    "include_post": true,
    "id": "10",
    "latitude": "",
    "longitude": "",
    "date": "10-19-19",
    "text": "Occasionally, you come across an oasis on the Camino.  This is one of those.  It's a little field of olive trees, with benches and whatnot.  In the summer there are probably people seeing fruit and food here, but in October, it's pretty quiet and empty.",
    "title": "Day 2e",
    "img": "/img/camino-2019/10-19-19e.jpg"
  },
  "11": {
    "caption": "Cirauqui, Spain",
    "include_post": true,
    "id": "11",
    "latitude": "",
    "longitude": "",
    "date": "10-19-19",
    "text": "Hey look, more narrow, winding streets.  This town was the best though: Cirauqui.  The town was like a maze, and all of the streets looked like this.  Usually, the main street through a town is the picturesque narrow winding street, and the rest are normal, but not Cirauqi, the entire town was like this.  It was spectacular.",
    "title": "Day 2f",
    "img": "/img/camino-2019/10-19-19f.jpg"
  },
  "12": {
    "caption": "Vineyards",
    "include_post": true,
    "id": "12",
    "latitude": "42.55",
    "longitude": "-2.27",
    "date": "10-20-19",
    "text": "In addition to hiking through lots of farmland, you also hike through lots of vineyards, which I actually enjoyed.  Sometimes there were evens still a few grapes left out there.  Not that I would sample them, no, I'd never, ever do something like that...",
    "title": "Day 3 - Torres del Rio",
    "img": "/img/camino-2019/10-20-19b.jpg"
  },
  "13": {
    "caption": "The Iglesia de la Asuncion in Navarrete, Spain.",
    "include_post": true,
    "id": "13",
    "latitude": "",
    "longitude": "",
    "date": "10-20-19",
    "text": "This was one of the most amazing Baroque Retablos I have ever seen (I'm not exactly sure what a Baroque Retablos is, but it was in the guidebook, so, um, yeah).  Anyway, this was the best one that I saw, and I didn't even know it was about to happen, I just saw an open door to a church, popped inside, and there it was.  It almost took my breath away.",
    "title": "Day 3b",
    "img": "/img/camino-2019/10-20-19c.jpg"
  },
  "14": {
    "caption": "A handy highway crossing",
    "include_post": true,
    "id": "14",
    "latitude": "",
    "longitude": "",
    "date": "10-20-19",
    "text": "Thousands and thousands of people hiking the Camino every year, the estimate for 2018 is 327,378.  Over 300,000 people!  Each year!  And it's increasing, 10 years ago it was 125,000.  That's a lot of people.  Anyway, my point is that Spain has made a lot of improvements to the Camino to make it safer for all of those people who are walking, so there are often things like this overpass to make crossing highways safer.  Thanks Spain!",
    "title": "Day 3c",
    "img": "/img/camino-2019/10-20-19d.jpg"
  },
  "15": {
    "caption": "A Pilgrim dinner in Najera",
    "include_post": true,
    "id": "15",
    "latitude": "",
    "longitude": "",
    "date": "10-20-19",
    "text": "This is pretty typical, most restaurants along the way offer a 'Pilgrim's Menu', which is a 3-course meal: appetizer, main course, and desert, plus bread and wine for 10 to 12 euros.  The food usually isn't amazing, but the company almost always is.  This table represented people from England, France, Germany, Sicily, and the US.  This is one of the main reasons that I wanted to hike the Camino, because you get to meet people from all over the world.  I mean, over 300,000 people hiked it this year, you're bound to run into them at some point ;)",
    "title": "Day 3d",
    "img": "/img/camino-2019/10-20-19a.jpg"
  },
  "16": {
    "caption": "Sunrise on the Camino",
    "include_post": true,
    "id": "16",
    "latitude": "42.41",
    "longitude": "-2.73",
    "date": "10-21-19",
    "text": "I tend to wake up early and therefore start hiking early.  The problem?  The sun doesn't rise until about 8am, and I start hiking before 7, so for the first hour it's quite dark.  It does lead to some amazing sunrises though.  Plus, as I was leaving town, there was a group of Asian Pilgrims, and when we got out of Najera and onto the dark gravel roads, they looked up and gasped.  It was just a normal night sky, but then I realized, if they're from Seoul or Tokyo or something, they might have never really seen stars before....",
    "title": "Day 4 - Najera",
    "img": "/img/camino-2019/10-21-19d.jpg"
  },
  "17": {
    "caption": "",
    "include_post": true,
    "id": "17",
    "latitude": "",
    "longitude": "",
    "date": "10-21-19",
    "text": "Eventually I'm going to stop with these pictures, but I love them so much",
    "title": "Day 4b",
    "img": "/img/camino-2019/10-21-19a.jpg"
  },
  "18": {
    "caption": "Lots of pretty houses along the way",
    "include_post": true,
    "id": "18",
    "latitude": "",
    "longitude": "",
    "date": "10-21-19",
    "text": "When I saw this I thought: 'Oh, my sister will like that'.  So I took this picture for her.  Plus, it *is* pretty.",
    "title": "Day 4c",
    "img": "/img/camino-2019/10-21-19b.jpg"
  },
  "19": {
    "caption": "The creepy, empty ghost town",
    "include_post": true,
    "id": "19",
    "latitude": "",
    "longitude": "",
    "date": "10-21-19",
    "text": "This was super weird.  There's a town called Ciruena along the way, and when you get to it you see this picture: sealed up condo buildings, one after another.  All empty, all just sitting there.  Once-in-a-while, you'll actually see signs that one of them is inhabited by someone, and then that seems strange and out of place.  Anyway, according to the guidebook, the town is the result of the financial crash and a cautionary tale.  But for me, I love these empty places that feel like they should be teeming with life, I always have.",
    "title": "Day 4d",
    "img": "/img/camino-2019/10-21-19c.jpg"
  },
  "20": {
    "caption": "This just made me laugh",
    "include_post": true,
    "id": "20",
    "latitude": "42.40",
    "longitude": "-3.26",
    "date": "10-22-19",
    "text": "",
    "title": "Day 5 - Villambistia",
    "img": "/img/camino-2019/10-22-19d.jpg"
  },
  "21": {
    "caption": "I LOVE the doors on this church",
    "include_post": true,
    "id": "21",
    "latitude": "",
    "longitude": "",
    "date": "10-22-19",
    "text": "",
    "title": "Day 5b",
    "img": "/img/camino-2019/10-22-19c.jpg"
  },
  "22": {
    "caption": "Another empty Camino Oasis",
    "include_post": true,
    "id": "22",
    "latitude": "",
    "longitude": "",
    "date": "10-22-19",
    "text": "",
    "title": "Day 5c",
    "img": "/img/camino-2019/10-22-19e.jpg"
  },
  "23": {
    "caption": "",
    "include_post": true,
    "id": "23",
    "latitude": "",
    "longitude": "",
    "date": "10-22-19",
    "text": "I realized that this was my 5th day on the Camino and I had yet to take a selfie, so I grabbed a quick one with this lovely sign.",
    "title": "Day 5d",
    "img": "/img/camino-2019/10-22-19f.jpg"
  },
  "24": {
    "caption": "The main albergue in Burgos",
    "include_post": true,
    "id": "24",
    "latitude": "",
    "longitude": "",
    "date": "10-22-19",
    "text": "Along the way there are albergues, which are basically hostels.  Usually lots of bunk beds crammed into small spaces.  Anyway, Burgos is a larger city (~350,000 or so), and there aren't a lot of options for hostels, except the main one, which had over 150 beds in it.  150 seemed like a huge number to me, and I was super scared it was going to be a giant room with bunk beds stacked as far as you could see, but I was pleasantly surprised to find this.  They had walls separating the each row of beds, and each bed had a little cubby that was actually big enough for your pack.  Plus, each row had a sink at the end of it.  This place was the most organized and well-thought out hostel I have ever seen.  I wish all of them could be like this one.",
    "title": "Day 5e",
    "img": "/img/camino-2019/10-22-19b.jpg"
  },
  "25": {
    "caption": "The cathedral in Burgos",
    "include_post": true,
    "id": "25",
    "latitude": "42.34",
    "longitude": "-3.704",
    "date": "10-22-19",
    "text": "This is one of the most amazing Cathedrals I have ever seen.  And it was like a block away from the hostel.  And it was free for Pilgrims on Tuesdays after 4pm (guess what, it was a Tuesday after 4pm!!).  Simply spectacular.",
    "title": "Day 5f - Burgos",
    "img": "/img/camino-2019/10-22-19a.jpg"
  },
  "26": {
    "caption": "I dunno, just liked this picture for some reason...",
    "include_post": true,
    "id": "26",
    "latitude": "42.287",
    "longitude": "-4.257",
    "date": "10-23-19",
    "text": "Today was a fairly crappy day, lots of rain.  This was also the start of the meseta section, which is supposed to be a central high plateau that has a reputation for being boring, repetitive, and bleak.  I don't know, it seemed exactly like all of the farmland I had hiked through previously, I really didn't see what the difference was.  However, the albergue in Itero de la Vega was wonderful.  Not for the hostel itself, which was kind of a dump, but for the people.  Once again, I had the Pilgrim's Menu, and at my table were people from France, Germany, South Korea, and Canada.  It was a lot of fun!  Several bottles of wine may or may not have been consumed, I can neither confirm nor deny that.",
    "title": "Day 6 - Itero de la Vega",
    "img": "/img/camino-2019/10-23-19a.jpg"
  },
  "27": {
    "caption": "",
    "include_post": true,
    "id": "27",
    "latitude": "",
    "longitude": "",
    "date": "10-23-19",
    "text": "One of the more interesting murals along the way",
    "title": "Day 6b",
    "img": "/img/camino-2019/10-23-19b.jpg"
  },
  "28": {
    "caption": "The lovely canal",
    "include_post": true,
    "id": "28",
    "latitude": "42.33",
    "longitude": "-4.80",
    "date": "10-24-19",
    "text": "Today there was a short (~4km or so) section along a canal.  It was lovely, I wish the canal section had been much longer (the entire canal is like 200km, but it probably doesn't go in the right direction).  It was nice while it lasted.",
    "title": "Day 7 - Calzadilla de la Cueza",
    "img": "/img/camino-2019/10-24-19f.jpg"
  },
  "29": {
    "caption": "The path along a highway",
    "include_post": true,
    "id": "29",
    "latitude": "",
    "longitude": "",
    "date": "10-24-19",
    "text": "I'm not sure how I feel about this.  I imagine that back in the day, people just had to walk on the shoulder of the highway, but at some point they realized that was super dangerous and so built this nice gravel path next to the highway.  So on one hand you have a reasonably nice gravel walkway, but you're still hiking along side a busy highway, so you end up walking in a very straight line:  All.  Day.  Long.",
    "title": "Day 7b",
    "img": "/img/camino-2019/10-24-19e.jpg"
  },
  "30": {
    "caption": "A Spanish supermarket",
    "include_post": true,
    "id": "30",
    "latitude": "",
    "longitude": "",
    "date": "10-24-19",
    "text": "I learned really quickly that just because something is called 'supermercado' in Spain doesn't mean it's a supermarket like you would find back home.  Here, a supermercado might have one shelf bread and a few cookies.  But sometimes you find an actual supermarket, like this one.  I tended to load up on snacks when I found one of these",
    "title": "Day 7c",
    "img": "/img/camino-2019/10-24-19d.jpg"
  },
  "31": {
    "caption": "My artistic photo",
    "include_post": true,
    "id": "31",
    "latitude": "",
    "longitude": "",
    "date": "10-24-19",
    "text": "Trying to be artistic?  Not sure it's successful, but I do enjoy the picture regardless",
    "title": "Day 7d",
    "img": "/img/camino-2019/10-24-19c.jpg"
  },
  "32": {
    "caption": "A typical lunch",
    "include_post": true,
    "id": "32",
    "latitude": "",
    "longitude": "",
    "date": "10-24-19",
    "text": "A typical lunch for me: chips, drinkable yogurt (love this stuff!), and whatever yummy bakery item I could find.  The bread in Spain is ridiculously cheap, you can get an entire loaf of freshly baked bread for like a euro.  How do they make any money?",
    "title": "Day 7e",
    "img": "/img/camino-2019/10-24-19a.jpg"
  },
  "33": {
    "caption": "",
    "include_post": true,
    "id": "33",
    "latitude": "",
    "longitude": "",
    "date": "10-24-19",
    "text": "Another typical albergue, this was actually one of the nicer ones.  By October there are a lot fewer people hiking the Camino, so usually only the bottom bunks are taken and the top bunks are emtpy, which is really quite nice",
    "title": "Day 7f",
    "img": "/img/camino-2019/10-24-19b.jpg"
  },
  "34": {
    "caption": "Pretty little bridge before a pretty little church",
    "include_post": true,
    "id": "34",
    "latitude": "42.473",
    "longitude": "-5.35",
    "date": "10-25-19",
    "text": "Last night I was sitting in the albergue's common area, eating chocolate, writing in my journal, you know, the usual, and sitting kitty-korner from me was a middle-aged woman.  So far that's not unusual, but she seemed a little absent minded, and kept looking around.  She had this look in her eyes like she was desperately trying to find someone to latch onto and spew word vomit all over.  I decided that it was best to avoid eye contact at all costs.  She was probably lovely, but I was NOT taking any chances.",
    "title": "Day 8 - Reliegos",
    "img": "/img/camino-2019/10-25-19c.jpg"
  },
  "35": {
    "caption": "I just really liked how this looked",
    "include_post": true,
    "id": "35",
    "latitude": "",
    "longitude": "",
    "date": "10-25-19",
    "text": "",
    "title": "Day 8b",
    "img": "/img/camino-2019/10-25-19b.jpg"
  },
  "36": {
    "caption": "I loved these little hobbit holes!",
    "include_post": true,
    "id": "36",
    "latitude": "",
    "longitude": "",
    "date": "10-25-19",
    "text": "These were everywhere in this area.  No, hobbits don't live here, they were used to storing wine or cheese or some sort of food.  I would totally live in one of these though.",
    "title": "Day 8c",
    "img": "/img/camino-2019/10-25-19d.jpg"
  },
  "37": {
    "caption": "My entertainment for the evening:  Koreans making dinner",
    "include_post": true,
    "id": "37",
    "latitude": "",
    "longitude": "",
    "date": "10-25-19",
    "text": "For some reason, there are a LOT of people from South Korea doing the Camino.  Someone told me that it was because there is a tv show in Korea either based on the Camino, or deals with the Camino, or something like that.  Anyway, the result is that there are a lot of Koreans out there, and they are often cooking dinner in the albergues.  These particualar Koreans were singing and doing a little dance while cooking, so I got a free show while I sat there eating my meal.",
    "title": "Day 8d",
    "img": "/img/camino-2019/10-25-19a.jpg"
  },
  "38": {
    "caption": "It's a gorgeous cathedral",
    "include_post": true,
    "id": "38",
    "latitude": "42.599",
    "longitude": "-5.566",
    "date": "10-26-19",
    "text": "Unfortunately, the cathedral was undergoing renovations.  Seems like every large cathedral in Spain was undergoing renovations when I was there.  Maybe they're always in a constant state of repair?",
    "title": "Day 9 - Leon",
    "img": "/img/camino-2019/10-26-19b.jpg"
  },
  "39": {
    "caption": "",
    "include_post": true,
    "id": "39",
    "latitude": "",
    "longitude": "",
    "date": "10-26-19",
    "text": "Leon is a beautiful city.  Similar to Pamplona, it has a neat, old city center with lots of narrow winding streets.  I could wander around a city like Leon all day.",
    "title": "Day 9b",
    "img": "/img/camino-2019/10-26-19d.jpg"
  },
  "40": {
    "caption": "",
    "include_post": true,
    "id": "40",
    "latitude": "",
    "longitude": "",
    "date": "10-26-19",
    "text": "This was apparently someone's wedding photo location?  Sure, why not.",
    "title": "Day 9c",
    "img": "/img/camino-2019/10-26-19c.jpg"
  },
  "41": {
    "caption": "Loved these freaky sculptures",
    "include_post": true,
    "id": "41",
    "latitude": "",
    "longitude": "",
    "date": "10-26-19",
    "text": "Was this a church?  Museum?  Not sure, but I really loved the sculptures up there",
    "title": "Day 9d",
    "img": "/img/camino-2019/10-26-19a.jpg"
  },
  "42": {
    "caption": "",
    "include_post": true,
    "id": "42",
    "latitude": "42.454",
    "longitude": "-6.053",
    "date": "10-27-19",
    "text": "One of the most beautiful cathedrals of the entire trip, and it was in tiny Astorga.  I've decided that the sweet spot for Spanish towns is ~8000 - 12,000.  Big enough to be old, interesting, and have a really pretty city center, but not so big that it's overwhelming.  I mean, a city like Burgos is nice, but entirely too big.  Astorga though?  It's the perfect size and is a lovely place.",
    "title": "Day 10 - Astorga",
    "img": "/img/camino-2019/10-27-19c.jpg"
  },
  "43": {
    "caption": "",
    "include_post": true,
    "id": "43",
    "latitude": "",
    "longitude": "",
    "date": "10-27-19",
    "text": "I mean, look at that door!  The detail on that thing is astounding",
    "title": "Day 10b",
    "img": "/img/camino-2019/10-27-19d.jpg"
  },
  "44": {
    "caption": "The bridge to Hospital de Orbigo",
    "include_post": true,
    "id": "44",
    "latitude": "",
    "longitude": "",
    "date": "10-27-19",
    "text": "Not sure why this bridge is sooooo long (you can see it stretch all the way to the buildings in the picture).  Something to do with jousting, according to my guidebook.  Did they really joust on a bridge like that?  How did the spectators see anything?",
    "title": "Day 10c",
    "img": "/img/camino-2019/10-27-19f.jpg"
  },
  "45": {
    "caption": "Look closely at this sculpture",
    "include_post": true,
    "id": "45",
    "latitude": "",
    "longitude": "",
    "date": "10-27-19",
    "text": "I almost missed this when I was walking by it... But do hooded figures mean the same thing in Spain that they do in the US?  I was a little suspicious after seeing this sculpture",
    "title": "Day 10d",
    "img": "/img/camino-2019/10-27-19e.jpg"
  },
  "46": {
    "caption": "Does anyone understand Korean?",
    "include_post": true,
    "id": "46",
    "latitude": "",
    "longitude": "",
    "date": "10-27-19",
    "text": "Like I said before, there are a lot of Koreans on the Camino.  Sometimes they leave little messages on the trail.",
    "title": "Day 10e",
    "img": "/img/camino-2019/10-27-19b.jpg"
  },
  "47": {
    "caption": "",
    "include_post": true,
    "id": "47",
    "latitude": "",
    "longitude": "",
    "date": "10-27-19",
    "text": "A typical private albergue.  There's usually a bar/restaurant, and then the rooms with the bunk beds are either upstairs or in the next room.  This was one of the nicer ones.",
    "title": "Day 10f",
    "img": "/img/camino-2019/10-27-19a.jpg"
  },
  "48": {
    "caption": "The high point of the Camino",
    "include_post": true,
    "id": "48",
    "latitude": "42.488",
    "longitude": "-6.361",
    "date": "10-28-19",
    "text": "This is supposedly the highest point on the Camino de Santiago!  I slept in Foncebadon the night before, so I was here just at sunrise, which was quite lovely.  You're supposed to bring a rock to add to the pile, but I didn't know that, so I had no rock :(",
    "title": "Day 11 - Cruz Ferro",
    "img": "/img/camino-2019/10-28-19d.jpg"
  },
  "49": {
    "caption": "",
    "include_post": true,
    "id": "49",
    "latitude": "",
    "longitude": "",
    "date": "10-28-19",
    "text": "",
    "title": "Day 11b",
    "img": "/img/camino-2019/10-28-19c.jpg"
  },
  "50": {
    "caption": "This was just really pretty",
    "include_post": true,
    "id": "50",
    "latitude": "",
    "longitude": "",
    "date": "10-28-19",
    "text": "",
    "title": "Day 11c",
    "img": "/img/camino-2019/10-28-19b.jpg"
  },
  "51": {
    "caption": "The Templar Castle at Ponferrada",
    "include_post": true,
    "id": "51",
    "latitude": "42.55",
    "longitude": "-6.598",
    "date": "10-28-19",
    "text": "Ponferrada is one of the bigger towns along the way, but I didn't care for it.  It doesn't have that pretty city center like Burgos or Leon, all it had was this (admitedly very impressive) Templar Castle.",
    "title": "Day 11d - Ponferrada",
    "img": "/img/camino-2019/10-28-19a.jpg"
  },
  "52": {
    "caption": "",
    "include_post": true,
    "id": "52",
    "latitude": "42.707",
    "longitude": "-7.043",
    "date": "10-29-19",
    "text": "This was the next 'big' climb after Cruz Ferro.  It was actually a tough hike up, even though it technically was a smaller climb.  It was just steeper, but the views were incredible!",
    "title": "Day 12 - O Cebreiro",
    "img": "/img/camino-2019/10-29-19a.jpg"
  },
  "53": {
    "caption": "More pretty mountain views",
    "include_post": true,
    "id": "53",
    "latitude": "",
    "longitude": "",
    "date": "10-29-19",
    "text": "",
    "title": "Day 12b",
    "img": "/img/camino-2019/10-29-19b.jpg"
  },
  "54": {
    "caption": "Entering Galicia",
    "include_post": true,
    "id": "54",
    "latitude": "",
    "longitude": "",
    "date": "10-29-19",
    "text": "This is the entranc eto Galicia! (A region in Spain).  I loved Galicia, they get a lot of rain here, so everything is green, the trees are moss covered, and there are hills!  No more boring farmland, now we have trees and hills.  The downside is that the towns are not nearly as scenic as the ones from the first part of the trip.  I guess you have to choose:  pretty trees and scenery, or pretty towns.  You can't have both, don't be greedy.",
    "title": "Day 12c",
    "img": "/img/camino-2019/10-29-19d.jpg"
  },
  "55": {
    "caption": "",
    "include_post": true,
    "id": "55",
    "latitude": "",
    "longitude": "",
    "date": "10-29-19",
    "text": "",
    "title": "Day 12d",
    "img": "/img/camino-2019/10-29-19c.jpg"
  },
  "56": {
    "caption": "",
    "include_post": true,
    "id": "56",
    "latitude": "",
    "longitude": "",
    "date": "10-29-19",
    "text": "The start of those pretty tree-covered paths",
    "title": "Day 12e",
    "img": "/img/camino-2019/10-29-19f.jpg"
  },
  "57": {
    "caption": "",
    "include_post": true,
    "id": "57",
    "latitude": "",
    "longitude": "",
    "date": "10-29-19",
    "text": "It might not look like much compared to the enormous cathedrals in the bigger cities, but I really liked this tiny unasuming church.",
    "title": "Day 12f",
    "img": "/img/camino-2019/10-29-19g.jpg"
  },
  "58": {
    "caption": "",
    "include_post": true,
    "id": "58",
    "latitude": "",
    "longitude": "",
    "date": "10-29-19",
    "text": "Left to Santiago.  Right to France.  I went left.",
    "title": "Day 12g",
    "img": "/img/camino-2019/10-29-19h.jpg"
  },
  "59": {
    "caption": "Which way?!?  Left or Right?  Why must there always be a choice to make?",
    "include_post": true,
    "id": "59",
    "latitude": "42.807",
    "longitude": "-7.615",
    "date": "10-30-19",
    "text": "",
    "title": "Day 13 - Portomarin",
    "img": "/img/camino-2019/10-30-19d.jpg"
  },
  "60": {
    "caption": "Adorable",
    "include_post": true,
    "id": "60",
    "latitude": "",
    "longitude": "",
    "date": "10-30-19",
    "text": "It wasn't halloween yet, or maybe they celebrate on October 30th in Spain?  Anyway, I was walking through this town and suddenly there was a line of adorable children coming down the street towards me.  How can you not smile at something like that?!?",
    "title": "Day 13b",
    "img": "/img/camino-2019/10-30-19b.jpg"
  },
  "61": {
    "caption": "This made me laugh.  And it's true.",
    "include_post": true,
    "id": "61",
    "latitude": "",
    "longitude": "",
    "date": "10-30-19",
    "text": "",
    "title": "Day 13c",
    "img": "/img/camino-2019/10-30-19c.jpg"
  },
  "62": {
    "caption": "",
    "include_post": true,
    "id": "62",
    "latitude": "",
    "longitude": "",
    "date": "10-30-19",
    "text": "Sometimes there are cows on the Camino.  Hey, maybe they're trying to do a pilgrimage too?  Who am I to judge?",
    "title": "Day 13d",
    "img": "/img/camino-2019/10-30-19a.jpg"
  },
  "63": {
    "caption": "",
    "include_post": true,
    "id": "63",
    "latitude": "42.914",
    "longitude": "-8.014",
    "date": "10-31-19",
    "text": "Indeed.  Now IS the time.",
    "title": "Day 14 - Melide",
    "img": "/img/camino-2019/10-31-19d.jpg"
  },
  "64": {
    "caption": "More pretty Galicia paths",
    "include_post": true,
    "id": "64",
    "latitude": "",
    "longitude": "",
    "date": "10-31-19",
    "text": "",
    "title": "Day 14b",
    "img": "/img/camino-2019/10-31-19c.jpg"
  },
  "65": {
    "caption": "My octopus dinner!",
    "include_post": true,
    "id": "65",
    "latitude": "",
    "longitude": "",
    "date": "10-31-19",
    "text": "I had been dreaming about this meal for days.  Galicia is known for its seafood, and I love octopus, which they are also known for, so I was sooooo looking forward to this meal.  It was just ok.  They cover it in paprika, which I did not care for, leave off the paprika and I probably would have loved it... Anyway, I felt like a lazy slob today, because I 'only' hiked 40km.  Previously I was doing 50km (about 31 miles) a day, but I was covering too much ground, so I slowed down a bit so I wouldn't get to Santiago too quickly.  So the plan was to stop at Portomarin last night, Melide tonight, then a big day to just outside of Santiago, and then an easy few kilometers to the finish line Cathedral in Santiago.  That was the plan at least.  Tonight, in Melide, I decided to splurge and get a private albergue instead of the common municipal (so 10 euros instead of the normal 6 or 8).  And I'm the only one here, literally the only person.  It's actually a little spooky, because I know the person working here leaves for the night, meaning I really will be the ONLY person in this building.  That has never happened to me on the Camino, there are ALWAYS people around, I don't know what to do with myself!",
    "title": "Day 14c",
    "img": "/img/camino-2019/10-31-19a.jpg"
  },
  "66": {
    "caption": "Tourists.  Ugh.",
    "include_post": true,
    "id": "66",
    "latitude": "",
    "longitude": "",
    "date": "11-1-19",
    "text": "One annoying thing about the Camino:  In order to get your certificate for finishing it, you technically only have to walk 100 km, and the closest large-ish city to the 100 km mark is Sarria, so once you hit Sarria (which actually happend a few days ago for me), suddenly there are a LOT more people on the trail.  Like the number of people suddenly doubles or triples.  It's quite jarring, actually.  It would bother me more, but it's only a day or two to Santiago, so I just deal with it.",
    "title": "Day 15",
    "img": "/img/camino-2019/11-1-19a.jpg"
  },
  "67": {
    "caption": "There it is, the Cathedral at Santiago, the last stop",
    "include_post": true,
    "id": "67",
    "latitude": "42.880",
    "longitude": "-8.544",
    "date": "11-2-19",
    "text": "Made it to Santiago!!  Last night I stayed at an albergue only about 5 km from the Cathedral, so I didn't have far to go this morning.  It was an odd feeling walking through Santiago early in the morning, it was earily quiet and I felt?  What?  I don't know, anxious?  Nervous?  Excited?  A combination of all of them?  It was definitely interesting.",
    "title": "Day 16 - Santiago",
    "img": "/img/camino-2019/11-2-19g.jpg"
  },
  "68": {
    "caption": "The church as I first saw it",
    "include_post": true,
    "id": "68",
    "latitude": "",
    "longitude": "",
    "date": "11-2-19",
    "text": "I actually arrived when it was still dark, so I had the square all to myself, which was nice, it was quiet and relaxing, so I decided to just sit down, stare at that amazing Cathedral (it really looked more like a fortress than a Cathedral), and think about my journey.  Knowing me, I probably was only thinking about ice cream, but at least I tried.",
    "title": "Day 16b",
    "img": "/img/camino-2019/11-2-19h.jpg"
  },
  "69": {
    "caption": "Random selfies from the end",
    "include_post": true,
    "id": "69",
    "latitude": "",
    "longitude": "",
    "date": "11-2-19",
    "text": "",
    "title": "Day 16c",
    "img": "/img/camino-2019/11-2-19f.jpg"
  },
  "70": {
    "caption": "The finisher's certificate",
    "include_post": true,
    "id": "70",
    "latitude": "",
    "longitude": "",
    "date": "11-2-19",
    "text": "After finishing the Camino de Santiago, you can get a certificate.  Of course you have to wait in line, and then a slightly rude person checks your Pilgrim Credentials to make sure you actually walked the whole way.  The problem was that I was only getting one stamp at day (at the albergue where I spent the night), and you're supposed to get TWO stamps per day, so the guy almost didn't give me the certificate.  I wouldn't have been too heart broken if he had denied me, I didn't walk all this way just for a piece of paper.  But it is a rather pretty piece of paper.",
    "title": "Day 16d",
    "img": "/img/camino-2019/11-2-19a.jpg"
  },
  "71": {
    "caption": "Fisterra",
    "include_post": true,
    "id": "71",
    "latitude": "",
    "longitude": "",
    "date": "11-2-19",
    "text": "After exploring Santiago for a bit, and doing the traditional church things (you're supposed to hug a statue of Saint James and make a wish?  Or something, I'm not entirely sure, but I stood in line and did it.  Then you go down to a crypt to see his bones, except you can't see the bones because they are in a sarcophagus, but I guess I'll take their word for it that they're in there?), I decided to take a bus to Fisterra.  You can extend your Camino and walk here, but I didn't have enough time for that, but I really wanted to see it because it's on the coast and the coast looked gorgeous, so I stumbled around until I found the bus station and luckily there was a bus leaving in 5 minutes for Fisterra, so I hopped on, had a very confusing conversation with the driver (who didn't speak English), probably about my ticket or lack thereof, paid her the fare, and was off to Fisterra.  Turns out Fisterra is a really really pretty town, right on the coast, I'm so glad that I came here, I loooooved it!",
    "title": "Day 16e",
    "img": "/img/camino-2019/11-2-19b.jpg"
  },
  "72": {
    "caption": "",
    "include_post": true,
    "id": "72",
    "latitude": "",
    "longitude": "",
    "date": "11-2-19",
    "text": "A nice little path along the coast.  This is why I loved Fisterra.  I mean, look at that, it's gorgeous!",
    "title": "Day 16f",
    "img": "/img/camino-2019/11-2-19d.jpg"
  },
  "73": {
    "caption": "",
    "include_post": true,
    "id": "73",
    "latitude": "",
    "longitude": "",
    "date": "11-2-19",
    "text": "The interesting part of this picture is not the guy in the awkard position trying to take a picture, but in the background are 2 people with touring bikes.  They were sitting there, away from everyone, smoking cigars.  I imagine that they also had just finished their journey and were quietly celebrating it.  I was a little jealous of them.",
    "title": "Day 16g",
    "img": "/img/camino-2019/11-2-19e.jpg"
  },
  "74": {
    "caption": "Touching the ocean.  It's tradition.",
    "include_post": true,
    "id": "74",
    "latitude": "",
    "longitude": "",
    "date": "11-2-19",
    "text": "Gotta touch the ocean at the end of an adventure (if the adventure happens to end near an ocean, of course).",
    "title": "Day 16h",
    "img": "/img/camino-2019/11-2-19c.jpg"
  },
  "75": {
    "caption": "",
    "include_post": true,
    "id": "75",
    "latitude": "42.907",
    "longitude": "-9.265",
    "date": "11-3-19",
    "text": "I spent the night in Fisterra, but since my Camino was over, I splurged and got a hotel room all to myself.  Anyway, I woke up early and wandered down to the coast and saw this, probably my favorite picture of the entire trip.",
    "title": "Day 17 - Fisterra",
    "img": "/img/camino-2019/11-3-19a.jpg"
  },
  "76": {
    "caption": "",
    "include_post": true,
    "id": "76",
    "latitude": "",
    "longitude": "",
    "date": "11-3-19",
    "text": "",
    "title": "Day 17b",
    "img": "/img/camino-2019/11-3-19b.jpg"
  },
  "77": {
    "caption": "Panaderia",
    "include_post": true,
    "id": "77",
    "latitude": "",
    "longitude": "",
    "date": "11-3-19",
    "text": "Most of the towns along the way tended to have a Panaderia (a bakery, I assume?).  They were always tiny, and they always smelled amazing.",
    "title": "Day 17c",
    "img": "/img/camino-2019/11-3-19c.jpg"
  },
  "78": {
    "caption": "The traditional celebration ice cream",
    "include_post": true,
    "id": "78",
    "latitude": "",
    "longitude": "",
    "date": "11-3-19",
    "text": "And that's it, the end of my Camino.  I always celebrate the end of an adventure with some ice cream.  Unfortunately, Spain doesn't have very many choices when it comes to ice cream, so it was either vanilla, or, well, vanilla.  So I went with vanilla.  It was surprisingly good.  Anyway, I feel like I should write something profound about my Camino, but it was just a lovely little 2 weeks of walking in Spain.  The best part were all of the people that I met along the way, and all of the beautiful Spanish towns.  Would I hike it again?  Probably not this particular one, but I *would* hike the  northern one that goes along the northern coast of Spain, I hear that one is really beautiful, and not nearly as crowded.  I thought this one was crowded for October, I can't imagine the Camino in the middle of summer, it would be absolute insanity.  How do over 300,000 people even find enough beds to sleep in every night?  I mean, I know not all 300,000 are out there at the same time, but in summer there are still a lot of people walking the Camino.  Not that it matters, I'm just rambling now.  Ok, I'm done.  I hope you enjoyed the pictures, and stay tuned for my next adventure... I have no idea what it'll be, but I know that eventually there will always be a next adventure.",
    "title": "Day 17d",
    "img": "/img/camino-2019/11-3-19d.jpg"
  }
}
