{
    "1289863606715900356" : {
      "caption" : "Icelandic money",
      "include_post" : "Y",
      "id" : "1289863606715900356",
      "latitude" : "64.124",
      "longitude" : "-21.822",
      "date" : "7-8-16",
      "text" : "I just got into Iceland and I'm sitting here waiting for a bus, so I figured I might as well make sure the Travis Tracker is working.  The bike ride around Iceland begins tomorrow!",
      "title" : "Day 1a",
      "img" : "/img/iceland-2016/7-8-16.jpg"
    },
    "1290053211000117281" : {
      "caption" : "Near Borgarnes",
      "include_post" : "Y",
      "id" : "1290053211000117281",
      "latitude" : "64.553",
      "longitude" : "-21.907",
      "date" : "7-8-16",
      "text" : "I probably biked a grand total of about 2 km today.  Really, today was all about getting to Iceland, figuring out how to get from the airport to the city (it's about an hour away), then figuring out how to get to Borgarnes.  Why Borgarnes?  Because the only tunnel along hwy 1 that's closed to bikes is between Reykjavik and Borgarnes, so I decided to just take a bus, skip the traffic and the tunnel, and start from Borgarnes.  Did I mention it was an overnight flight, i went to the wrong bus station, etc, etc, so I didn't get to Borgarnes until about 7pm?  Aka, Travis is really really tired.",
      "title" : "Day 1b",
      "img" : "/img/iceland-2016/7-8-16b.jpg"
    },
    "1290759458116376200" : {
      "caption" : "I really liked that little bridge in front of the waterfall",
      "include_post" : "Y",
      "id" : "1290759458116376200",
      "latitude" : "65.326",
      "longitude" : "-20.892",
      "date" : "7-9-16",
      "text" : "Today I was introduced to my newest friend: the Icelandic Winds.  I had read about the wind and knew it could be a problem, but there's nothing like experiencing it for yourself!  It was sneaky too, the first half of the day was beautiful, the miles just flew by.  Then I stopped for lunch at a gas station (gas stations are pretty much the only food options in these less populated areas of Iceland) and when I was done I walked out into the head wind from hell.  Thanks Iceland! I guess the moral here is to never stop for lunch...",
      "title" : "Day 2 - Laugarbakki",
      "img" : "/img/iceland-2016/7-9-16.jpg"
    },
    "1291298502944520497" : {
      "caption" : "2 things Iceland has a lot of: sheep and water.",
      "include_post" : "Y",
      "id" : "1291298502944520497",
      "latitude" : "65.553",
      "longitude" : "-19.446",
      "date" : "7-10-16",
      "text" : "Today was just another pretty day of biking.  I did try something new though: since the wind is strongest during the day and calms down at night, I decided to wake up super early (like 1 or 2 am) and start biking then.  Since Iceland is still in their 24 hours of sun period, day/night really don't matter very much.  Plus, there are a lot fewer cars on the road at 2am.  Yay!!",
      "title" : "Day 3 - Varmahlid",
      "img" : "/img/iceland-2016/7-10-16.jpg"
    },
    "1292003910420206704" : {
      "caption" : "Old Town",
      "include_post" : "Y",
      "id" : "1292003910420206704",
      "latitude" : "65.684",
      "longitude" : "-18.095",
      "date" : "7-11-16",
      "text" : "Just a lunch stop and a few hours of wandering around Akureyri.  With 17,000 people, it's Iceland's second biggest city!  It has a neat little Old Town area, and overall is a really nice little town.",
      "title" : "Day 4a - Akureyri",
      "img" : "/img/iceland-2016/7-11-16.jpg"
    },
    "1292100284503416361" : {
      "caption" : "Climbing a pass on the way to Akureyri.",
      "include_post" : "Y",
      "id" : "1292100284503416361",
      "latitude" : "65.722",
      "longitude" : "-17.362",
      "date" : "7-11-16",
      "text" : "I don't know what to say, the weather has been nice (well, nice for Iceland), the scenery has been pretty, and the riding has been good.  I'm just tired, this whole no darkness thing is really starting to do a number on me; I haven't been sleeping well at all.  Eventually I have to adjust, right?  It's either that or I go crazy, I suppose....",
      "title" : "Day 4b - Laugar",
      "img" : "/img/iceland-2016/7-11-16b.jpg"
    },
    "1292863485730060044" : {
      "caption" : "Geothermal goodness!",
      "include_post" : "Y",
      "id" : "1292863485730060044",
      "latitude" : "65.639",
      "longitude" : "-16.810",
      "date" : "7-12-16",
      "text" : "Hverir was my favorite stop of the day.  It's a geothermal area, similar to Yellowstone but much, much smaller.  It only has a few features (like mud pots and steam vents, but no geysers). Even though it was small (relatively!) I still loved walking around it, and as an added bonus, it's not all walled off like Yellowstone: there's a small rope around some areas, but otherwise you can go anywhere you want.  As an extra added bonus, when I got there an Asian couple was taking some wedding photos.  It was just the 2 of them, no one else was around.  Did I mention it was 3 am?  I love random stuff like that!",
      "title" : "Day 5a - Hverir",
      "img" : "/img/iceland-2016/7-12-16.jpg"
    },
    "1292866790959076263" : {
      "caption" : "The Bromie taking a break.",
      "include_post" : "Y",
      "id" : "1292866790959076263",
      "latitude" : "65.258",
      "longitude" : "-14.409",
      "date" : "7-12-16",
      "text" : "Today was a good day!  No wind, some amazing geothermal areas, a huge lava bed to ride through, and then a huge barren alien-like landscape, and then a canyon full of waterfalls to finish it all off.  Yup, today was probably my favorite day so far.  Plus, I did 204 km (about 125 miles). I really wasn't planning on going that far, but there were no towns for 160 km in there, so I either had to carry extra food or ride the whole way.  I actually did bring extra food, but I was feeling good and it was a nice day so I decided to just keep going into Egilsstadir.",
      "title" : "Day 5b - Egilsstadir",
      "img" : "/img/iceland-2016/7-12-16b.jpg"
    },
    "1293686542224611818" : {
      "caption" : "Bulandstindur Mtn",
      "include_post" : "Y",
      "id" : "1293686542224611818",
      "latitude" : "64.656",
      "longitude" : "-14.284",
      "date" : "7-13-16",
      "text" : "It finally happened, I gave in and experienced the wonderfulness of Iceland's pools/hot tubs.  After my long 200 km day yesterday, I had a relatively short ride into Djupivogur; I got into town pretty early, before the grocery store was open, so I decided to pass the time by soaking in the local pool.  Pretty much every town in Iceland has some sort of pool, with most (or all?) of them geothermally heated.  It was amazing.  Even me, the guy who usually avoids water at all costs loved it.  Why did it take me so long to try this?!? Anyway, the road up until now has been near the coast but now the road is right on the coast, sandwiched between the ocean and big beautiful mountains.  In other words, I finally have my dramatic coast line that I've been waiting for!  The ride tomorrow into Hofn looks like it's going to be absolutely incredible, I can't wait!",
      "title" : "Day 6",
      "img" : "/img/iceland-2016/7-13-16.jpg"
    },
    "1293687669477408180" : {
      "caption" : "View from Oxi pass",
      "include_post" : "Y",
      "id" : "1293687669477408180",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-13-16",
      "text" : "On the way to Djupivogur, I took a side road that went up and over Oxi pass.  The views from the top were pretty spectacular...",
      "title" : "Day 6b",
      "img" : "/img/iceland-2016/7-13-16b.jpg"
    },
    "1294000078167514473" : {
      "caption" : "Just a few stickers to class things up a bit",
      "include_post" : "Y",
      "id" : "1294000078167514473",
      "latitude" : "64.253",
      "longitude" : "-15.212",
      "date" : "7-14-16",
      "text" : "I was hoping the ride today would be spectacular, and Iceland did not disappoint!  The road followed the ocean the whole way with big, steep mountains all along.  It was gorgeous.  One part even reminded me a little of the Pacific Coast highway in Sonoma County, where the highway was carved into the side of a mountain with scary cliffs on the other side.  Nothing in Iceland was quite that scary, but it was pretty dramatic nonetheless.  Tomorrow should begin the glacier section of the trip (I can already see them across the fjord), so that should be exciting!",
      "title" : "Day 7 - Hofn",
      "img" : "/img/iceland-2016/7-14-16.jpg"
    },
    "1294001365911166438" : {
      "caption" : "An extra picture from my morning ride along the coast.  I believe I took this right before I went through a 1.3km tunnel.  At least it was super early so there was no traffic in the tunnel, they're scary enough as is!",
      "include_post" : "Y",
      "id" : "1294001365911166438",
      "latitude" : "",
      "longitude" : "--Day 7b",
      "date" : "7-14-16",
      "text" : "",
      "title" : "Sunrise",
      "img" : "/img/iceland-2016/7-14-16b.jpg"
    },
    "1294625394728697080" : {
      "caption" : "Flaajokull Glacier (maybe?)",
      "include_post" : "Y",
      "id" : "1294625394728697080",
      "latitude" : "64.016",
      "longitude" : "-16.976",
      "date" : "7-15-16",
      "text" : "Today was all about 2 things: riding past a bunch of glaciers and rain.  I almost took a day off in Hofn because the forecast was for rain all day long, but there was also supposed to be an Easterly wind (which would be a tail wind for me), so I decided to endure the rain in exchange for the tailwind.  It pretty much worked out that way too, I had a nice breeze most of the day, and the rain wasn't bad at all; it did cut down on my views a little, but we can't have everything!",
      "title" : "Day 8 - Skaftafell",
      "img" : "/img/iceland-2016/7-15-16.jpg"
    },
    "1295051774016690006" : {
      "caption" : "Lava Fields",
      "include_post" : "Y",
      "id" : "1295051774016690006",
      "latitude" : "63.419",
      "longitude" : "-19.006",
      "date" : "7-16-16",
      "text" : "More rain today.  Lots of rain.  On the plus side though, I had a beautiful tailwind all day long.  You win some you lose some, I guess.  Also, the road today was exceptionally flat, we were mostly going through enormous glacial flood plains and lava fields.  The flood plains happen because there's a series of volcanoes underneath Iceland's massive ice cap, sometimes they erupt, fill a sub-glacial lake with water, eventually overflow the lake and boom: massive amounts of flood water create havoc on the poor unsuspecting area below.  Neat!",
      "title" : "Day 9 - Vik",
      "img" : "/img/iceland-2016/7-16-16.jpg"
    },
    "1295053242501308217" : {
      "caption" : "Isn't that beautiful?",
      "include_post" : "Y",
      "id" : "1295053242501308217",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-16-16",
      "text" : "I love this picture and the idea of living in this house.  Can you imagine giving directions to your place?: 'Ok, so take the highway past Skaftfell and our house is the first one under the waterfall'....",
      "title" : "Day 9b",
      "img" : "/img/iceland-2016/7-16-16b.jpg"
    },
    "1295367542579326950" : {
      "caption" : "Icelandic Snacks!",
      "include_post" : "Y",
      "id" : "1295367542579326950",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-16-16",
      "text" : "Since I posted pictures of some of the food I ate in South Korea and Japan, I figured I'd do the same for Iceland.  Most of the food is pretty unexciting, it's a lot of burgers and various sandwiches.  Of course there's lots of fish and lamb in restaurants, but I don't eat in restaurants very much (it's super expensive, food is crazy out here). I basically live on Skyr - which is sort of like Greek yogurt and very yummy.  The apple flavor wasn't necessarily my favorite, but it was ok.  The upper left package is gummy candy, and I was really hoping the one on the bottom was potato salad, because it had a picture of a potato on the lid.  Luckily I guessed correctly!  It would have quite sucked to go in thinking it was potato salad when it was really some sort of whipped fish, which happens....",
      "title" : "Extra Stuff",
      "img" : "/img/iceland-2016/7-16-16c.jpg"
    },
    "1295769029578903245" : {
      "caption" : "Lunch stop in Hvolsvollur",
      "include_post" : "Y",
      "id" : "1295769029578903245",
      "latitude" : "63.751",
      "longitude" : "-20.233",
      "date" : "7-17-16",
      "text" : "This is actually the view heading out of Vik...",
      "title" : "Day 10a",
      "img" : "/img/iceland-2016/7-17-16.jpg"
    },
    "1295772104012103594" : {
      "caption" : "This place was supposed to be haunted!",
      "include_post" : "Y",
      "id" : "1295772104012103594",
      "latitude" : "63.933",
      "longitude" : "-20.989",
      "date" : "7-17-16",
      "text" : "Today was the first day that I saw several of these cave structures.  Some were buildings built into the rocks, some were just holding caves like this one, but they were all fascinating!  Otherwise, the weather finally cleared up, I even saw the sun today.  Only for about 5 minutes, but it counts.  Oh, remember that volcano in Iceland that erupted in 2010 and caused all sorts of travel delays in Europe?  Well I rode by it today, or at least the base of it, I couldn't see the thing, of course.  It's just a constant reminder here that Iceland is a dynamic place that can change in an instant!",
      "title" : "Day 10b",
      "img" : "/img/iceland-2016/7-17-16b.jpg"
    },
    "1296511891887267179" : {
      "caption" : "Silly Icelanders",
      "include_post" : "Y",
      "id" : "1296511891887267179",
      "latitude" : "64.146",
      "longitude" : "-21.816",
      "date" : "7-18-16",
      "text" : "I did it!  I circled the entire country and am now back in Reykjavik.  It  took less than 2 weeks, so now I have 10 extra days until my return flight to the US.  What am I going to do for 10 days?  Why do I have to be such a super awesome biker that I blow past even my own expectations?!? Oh well, I'm sure I'll be able to figure out some way to pass the time.... Oh, the picture.  This was in the middle of Reykjavik; they closed off a street and put in a giant slip-n-slide that went for at least 2 blocks.  The kids loved it, they played loud American pop music, everyone stopped to take pictures; the whole thing had a very carnival-like atmosphere to it.  Oh those silly Icelanders.",
      "title" : "Day 11 - Reykjavik",
      "img" : "/img/iceland-2016/7-18-16.jpg"
    },
    "1296512921983046030" : {
      "caption" : "Street Art",
      "include_post" : "Y",
      "id" : "1296512921983046030",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-18-16",
      "text" : "There was lots of art on the sides of buildings all over Reykjavik, this one was one of my favorites.",
      "title" : "Day 11b",
      "img" : "/img/iceland-2016/7-18-16b.jpg"
    },
    "1297296640604048218" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1297296640604048218",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-19-16",
      "text" : "Today was a lazy day just aimlessly wandering around the city.  Reykjavik has a great bike path that goes along the water, so I spent a decent amount of time on that.  I also decided what I'm going to do with my extra time here: I bought a bus pass and am going to take buses up into the interior highlands!  There are no towns in the interior, and no paved roads, just somewhat sketchy gravel roads.  You can bike it, but you need a mountain bike; I don't think my little Brompton is quite up to that task.  Anyway, tomorrow I begin my Highlands adventure!",
      "title" : "Day 12 - Reykjavik",
      "img" : "/img/iceland-2016/7-19-16.jpg"
    },
    "1297299324497294583" : {
      "caption" : "Hallgrimstorg (the church)",
      "include_post" : "Y",
      "id" : "1297299324497294583",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-19-16",
      "text" : "Since this church is one of the most famous landmarks in Reykjavik, I figured that I should include a picture of it.  Luckily, one of the roads leading up to it had a series of artsy photos, which I enjoyed a lot more than the church...",
      "title" : "Day 12b",
      "img" : "/img/iceland-2016/7-19-16b.jpg"
    },
    "1298094958506505646" : {
      "caption" : "Yup, that's the Highlands",
      "include_post" : "Y",
      "id" : "1298094958506505646",
      "latitude" : "64.709",
      "longitude" : "-18.152",
      "date" : "7-20-16",
      "text" : "So today was the beginning of my adventures into the Icelandic Highlands.  Let's just say they were not what i was expecting.  This picture pretty much sums then up, it's a whole lot of nothing as far as the eye can see.  As the bus driver put it: 'it's 200 km of black sand and grey rock'. Yup, that's pretty much it.  It's pretty, in its own way though.  Surprisingly, there were a decent amount of people biking and hiking the road through there.  I could see it for a day, but a week of nothing but black sand to look at?  That might get to be a bit much....",
      "title" : "Day 13a - Nyidalur (Bus)",
      "img" : "/img/iceland-2016/7-20-16.jpg"
    },
    "1298095007823213601" : {
      "caption" : "My 2 French friends",
      "include_post" : "Y",
      "id" : "1298095007823213601",
      "latitude" : "65.640",
      "longitude" : "-16.914",
      "date" : "7-20-16",
      "text" : "There were only 3 people on the huge bus across the Highlands from Reykjavik to Myvatn (pronounced Mee-Van): myself and 2 brothers from France who were planning to hike from Myvatn back to Skogar (on the Southern coast). It was a long bus ride that took all day, so we eventually chatted it up and got to know each other a bit.  In the background is Aldeyjarfoss waterfall, which was pretty impressive!",
      "title" : "Day 13b - Myvatn (Bus)",
      "img" : "/img/iceland-2016/7-20-16b.jpg"
    },
    "1298747868865129333" : {
      "caption" : "A very pretty coastal town",
      "include_post" : "Y",
      "id" : "1298747868865129333",
      "latitude" : "66.116",
      "longitude" : "-16.911",
      "date" : "7-21-16",
      "text" : "Here we are in Husavik, the whale watching capital of Iceland (and maybe the world?). Tomorrow I plan on taking one of the early boats out to do some whale watching!",
      "title" : "Day 14a - Husavik (Bus)",
      "img" : "/img/iceland-2016/7-21-16.jpg"
    },
    "1298750648489103734" : {
      "caption" : "Dettifoss Waterfall",
      "include_post" : "Y",
      "id" : "1298750648489103734",
      "latitude" : "65.817",
      "longitude" : "-16.387",
      "date" : "7-21-16",
      "text" : "Today was all about getting to and seeing Dettifoss waterfall.  It's the largest, or the most powerful, or the most 'something' waterfall in Europe (I forget exactly how they phrased it). And yup, it was big.  You could feel the spray from it a kilometer away.  Well, maybe not quite that far.  Sadly, I was stuck with the bus timetable, so I only had an hour to spend there.  There are definitely times when I miss having my bike and my freedom!",
      "title" : "Day 14b (Bus)",
      "img" : "/img/iceland-2016/7-21-16b.jpg"
    },
    "1299307162056559101" : {
      "caption" : "A humpback whale!",
      "include_post" : "Y",
      "id" : "1299307162056559101",
      "latitude" : "66.033",
      "longitude" : "-17.581",
      "date" : "7-22-16",
      "text" : "Whale watching is awesome!! We saw a ton of humpbacks, one kept diving and then surfacing not far from the boat.  The guide said she was 'showing off' :) Sadly, this was the best picture that I got, it was raining so I tried to keep my phone protected and then when I eventually thought about taking a picture the whale was usually gone; they don't spend a lot of time at the surface before they dive again.  Anyway, it was fantastic, I'd highly recommend whale watching in Husavik to anyone!",
      "title" : "Day 15a - Husavik (Boat)",
      "img" : "/img/iceland-2016/7-22-16.jpg"
    },
    "1299307232948722905" : {
      "caption" : "Yes, it was raining.",
      "include_post" : "Y",
      "id" : "1299307232948722905",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-22-16",
      "text" : "This was my whale watching boat: the Fladur.  There were only 14 of us out there on that rainy morning, so there was only a minimum of pushing and shoving to get to the best whale spotting location, so overall I'd say that's a success!",
      "title" : "Day 15b",
      "img" : "/img/iceland-2016/7-22-16b.jpg"
    },
    "1299307284916313848" : {
      "caption" : "Don't I look good in Icelandic rain gear?!?",
      "include_post" : "Y",
      "id" : "1299307284916313848",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-22-16",
      "text" : "I realized that I haven't posted a selfie yet from my Iceland trip, so why not start with a whale watching one?  Really, I just liked the rain coats...",
      "title" : "Day 15c",
      "img" : "/img/iceland-2016/7-22-16c.jpg"
    },
    "1301658401620854924" : {
      "caption" : "The Highlands, part 2",
      "include_post" : "Y",
      "id" : "1301658401620854924",
      "latitude" : "64.865",
      "longitude" : "-19.557",
      "date" : "7-24-16",
      "text" : "I spent a few days in Akureyri (on the northern coast) and then today was a long bus ride back to the southern part of Iceland via the Highlands.  There are 2 main routes through the Highlands, an easterly one and a westerly one.  The one I originally took was the easterly version with hundreds of kilometers of black sand and grey rock.  One the way back, I took the westerly one, which also had a bit of that desolation, but not nearly as much.  This time there were little outposts along the way, some hot springs, and then at the very end Gillfoss and Geysir (probably Iceland's 2 most visited attractions). So the western route definitely had more stuff, but the eastern one was impressive in the shear amount of nothing along the way...",
      "title" : "Day 18a",
      "img" : "/img/iceland-2016/7-24-16.jpg"
    },
    "1301662176695634901" : {
      "caption" : "Gillfoss (the waterfall)",
      "include_post" : "Y",
      "id" : "1301662176695634901",
      "latitude" : "64.325",
      "longitude" : "-20.130",
      "date" : "7-24-16",
      "text" : "This is Gillfoss, probably the most visited waterfall in Iceland, mainly because it's pretty close to Reykjavik and is on the 'Golden Circle', a road that most tourists take as a day trip out of Reykjavik.",
      "title" : "Day 18c",
      "img" : "/img/iceland-2016/7-24-16b.jpg"
    },
    "1301662263584971867" : {
      "caption" : "The Hot Springs",
      "include_post" : "Y",
      "id" : "1301662263584971867",
      "latitude" : "64.865",
      "longitude" : "-19.554",
      "date" : "7-24-16",
      "text" : "As I mentioned in the previous post, this road through the Highlands had some nice hot springs along the way, they even had a little area to soak in!  Sadly, I didn't have time for a soak, maybe next time...",
      "title" : "Day 18b",
      "img" : "/img/iceland-2016/7-24-16c.jpg"
    },
    "1301664781626992502" : {
      "caption" : "The Geysir area",
      "include_post" : "Y",
      "id" : "1301664781626992502",
      "latitude" : "64.312",
      "longitude" : "-20.301",
      "date" : "7-24-16",
      "text" : "This is Geysir, well, it's one of the thermal features in the area of Geysir.  Geysir was the original 'geyser', but sadly it stopped erupting.  Now they have Stokkur as their erupting geyser, and it sure does, every 5 minutes or so, but I like these thermal features better than a geyser, so that's what you get!",
      "title" : "Day 18d",
      "img" : "/img/iceland-2016/7-24-16d.jpg"
    },
    "1302360617625095922" : {
      "caption" : "I forget the name of this lake, but it probably has 20 letters in it.",
      "include_post" : "Y",
      "id" : "1302360617625095922",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-25-16",
      "text" : "This lake was on the way to Landmannalaugar (I've heard that pronounced at least a dozen times by bus drivers and I still don't think I can even get close to pronouncing it correctly).",
      "title" : "Day 19a",
      "img" : "/img/iceland-2016/7-25-16.jpg"
    },
    "1302363861583890551" : {
      "caption" : "Hot Springs!",
      "include_post" : "Y",
      "id" : "1302363861583890551",
      "latitude" : "63.992",
      "longitude" : "-19.062",
      "date" : "7-25-16",
      "text" : "This was at Landmannalaugar, which is known as the 'Pearl of the Interior', and I would agree, it was beautiful!  The mountains surrounding this area are multiple colors and they have these hot springs; it's just a wonderful area.  The pool in the picture is fed by one cold stream and one hot stream, making where they intersect a delightful little spot.  And yes, I absolutely took a swim in it, those hot springs were the main reason I went to Landmannalaugar!",
      "title" : "Day 19b",
      "img" : "/img/iceland-2016/7-25-16b.jpg"
    },
    "1302366840437145356" : {
      "caption" : "A hiking trail",
      "include_post" : "Y",
      "id" : "1302366840437145356",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-25-16",
      "text" : "I loved how this trail looks, with that black sand for a trail it looks like it's a trail to Mordor or something.  Actually, it's the start (or end!) of Iceland's famed Laugavegur trail.  If I had been thinking a little better, or had done my research a little better, I would have brought my backpack and hiked this thing after I finished my bike ride.  It can be done in a few days and there are buses at both the start and finish, making it pretty easy and convenient logistically.  Why didn't I plan for this before I left?!? As usual, I'm kinda stupid.",
      "title" : "Day 19c",
      "img" : "/img/iceland-2016/7-25-16c.jpg"
    },
    "1302368230790294587" : {
      "caption" : "A river crossing",
      "include_post" : "Y",
      "id" : "1302368230790294587",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-25-16",
      "text" : "This is why you need a large 4 wheel drive vehicle if you want to go up into Iceland's highlands - the river crossings.  Can you imagine trying to cross this thing in a Toyota Yaris?  I'm sure someone has tried, and I doubt the results were what they had hoped for...",
      "title" : "Day 19d",
      "img" : "/img/iceland-2016/7-25-16d.jpg"
    },
    "1303301437652061340" : {
      "caption" : "The coast.",
      "include_post" : "Y",
      "id" : "1303301437652061340",
      "latitude" : "64.317",
      "longitude" : "-22.084",
      "date" : "7-26-16",
      "text" : "You know, for an island nation that has a highway circling it, I spent a surprisingly short amount of time on the actual coast.... I'm back in the Reykjavik area and I didn't want to spend my entire last few days in the city, so I took a day trip to Akranes because it was close and right on the water so I thought it might be pretty.  It was ok, it had a neat lighthouse, but the town itself was fairly blah.  Oh well.  Anyway, this is pretty much the end of my Iceland adventure, I'll have one more day to wander around Reykjavik doing whatever I want and then I'm done and headed home!",
      "title" : "Day 20 - Akranes",
      "img" : "/img/iceland-2016/7-26-16.jpg"
    },
    "1303870058430234886" : {
      "caption" : "Rockall",
      "include_post" : "Y",
      "id" : "1303870058430234886",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-27-16",
      "text" : "I don't really know what this is, I just sort of stumbled upon it when I was wandering around Reykjavik.",
      "title" : "Day 21a - Reykjavik",
      "img" : "/img/iceland-2016/7-27-16.jpg"
    },
    "1303870107461758817" : {
      "caption" : "Fish 'n Chips!",
      "include_post" : "Y",
      "id" : "1303870107461758817",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-27-16",
      "text" : "I decided that before I left Iceland that I should have at least one good seafood feast, so I found a fish 'n chips food truck and had myself a meal.  What?  It counts as seafood!!",
      "title" : "Day 21b",
      "img" : "/img/iceland-2016/7-27-16b.jpg"
    },
    "1303870192941545642" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1303870192941545642",
      "latitude" : "64.153",
      "longitude" : "-21.948",
      "date" : "7-27-16",
      "text" : "That's it, this is the end of my Icelandic adventure!  Overall, it was a fantastic trip, I loved the bike ride around the country and the Highlands were certainly interesting.  Iceland is an impossibly beautiful place and you could probably spend a lifetime exploring it all; I just got to see a small slice of what it has to offer.  Anyway, I hope you enjoyed my adventures, I'd love to be able to say for sure what was going to happen next but as usual I have no idea. :)",
      "title" : "Day 21c - Reykjavik",
      "img" : "/img/iceland-2016/7-27-16c.jpg"
    },
    "1306002991609941373" : {
      "caption" : "That's Greenland!",
      "include_post" : "Y",
      "id" : "1306002991609941373",
      "latitude" : "65.691",
      "longitude" : "-35.855",
      "date" : "7-28-16",
      "text" : "Luckily, the day I flew back to the US was sunny and beautiful, so I got some great views of Greenland as we were flying over.  I actually considered trying to take a quick trip to Greenland after my bike ride, since I had extra time, but the cheapest tickets that I could find were like 1300 dollars, which just a tad steep for me at that moment.  Oh well, I guess I'll just have to go to Greenland another time....",
      "title" : "Extra pics",
      "img" : "/img/iceland-2016/7-28-16.jpg"
    },
    "1306007014064864007" : {
      "caption" : "A typical campground",
      "include_post" : "Y",
      "id" : "1306007014064864007",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-29-16",
      "text" : "After I got home, I was talking to my parents and they were a little confused about where I slept each night, so I figured I would do a little explaining... Iceland is wonderful in that pretty much every town has a nice campground.  Not just a place to camp, they also usually have some sort of kitchen area, showers, and are either right in town or petty darn close to it.  They're super convenient!  So that's where I slept each night, a town campground.  You had to pay for the campground, of course, but it was usually only about 1500 krona (somewhere around 12 or 13 dollars), so not super cheap but not horribly expensive either.  Some of the campgrounds were small, some were enormous (hellooooo Reykjavik, your campground is basically a zoo!), but they all were adequate and got the job done.  Yup, I loved my Icelandic campgrounds!",
      "title" : "Extra pics",
      "img" : "/img/iceland-2016/7-29-16.jpg"
    },
    "1306025105524107721" : {
      "caption" : "More of Greenland!",
      "include_post" : "Y",
      "id" : "1306025105524107721",
      "latitude" : "",
      "longitude" : "",
      "date" : "7-30-16",
      "text" : "I just loved the clouds/mountains in this picture...",
      "title" : "Extra Pics",
      "img" : "/img/iceland-2016/7-30-16.jpg"
    }
  }