{
    "1152694828491434285" : {
      "caption" : "The Japanese coast. It was very pretty.",
      "include_post" : "Y",
      "id" : "1152694828491434285",
      "latitude" : "34.369",
      "longitude" : "131.056",
      "date" : "2015-04-16 07:05:53",
      "text" : "I was really happy with my decision to follow the coast. It led me to a series of small towns, hidden little beaches, and beautiful views. It wasn't quite 'Oregon Coast' level of amazing, but I still loved it.",
      "title" : "Day 6 - Heki?",
      "img" : "/img/japan-2015/4-16-15.jpg"
    },
    "1152696189652134235" : {
      "caption" : "One of the first Japanese Temples that I stumbled upon.",
      "include_post" : "Y",
      "id" : "1152696189652134235",
      "latitude" : "34.417",
      "longitude" : "131.395",
      "date" : "2015-04-17 07:08:35",
      "text" : "My riding days in Japan weren't big mile days, but that was by design. I had no 'end point', so there was no need to rush. Instead, I made a very conscious decision to explore along the way, which is quite different from how I've done my bike trips in the past. It wasn't that I didn't see things along the way on previous trips, but when I have a very specific goal in mind, it's hard to keep myself from doing everything I can to reach it. Japan was the first time I really gave myself permission to just wander and explore. Plus, my maps were entirely in Japanese, so I had no idea what I was about to stumble upon, basically all I had was a list of roads, everything else was a surprise!",
      "title" : "Day 7 - Campground off highway 191",
      "img" : "/img/japan-2015/4-17-15.jpg"
    },
    "1152696784010176885" : {
      "caption" : "A 'highway' in Japan",
      "include_post" : "Y",
      "id" : "1152696784010176885",
      "latitude" : "34.655",
      "longitude" : "131.664",
      "date" : "2015-04-17 07:09:46",
      "text" : "This photo is a good example of my wandering. I quickly learned that on my Japanese map the red colored roads were busy, green ones not quite as busy, and yellow ones would be lucky to see any cars at all. This was an example of a yellow road. I took as many of them as I possibly could, even if the red road was 20 miles shorter and much flatter, I would still usually opt for the yellow one. It's a blessing to ride a road like this with no cars and have that dense forest all around you. It almost felt like the PCT at times (that's a good thing, at least for me).",
      "title" : "Day 7 - Tamagawa Beach",
      "img" : "/img/japan-2015/4-17-15b.jpg"
    },
    "1152697383091005840" : {
      "caption" : "A really big gate.",
      "include_post" : "Y",
      "id" : "1152697383091005840",
      "latitude" : "35.077",
      "longitude" : "132.328",
      "date" : "2015-04-18 07:10:57",
      "text" : "One of the coolest places I visited in Japan was Hagi. It's an old castle town, right on the ocean. The castle has long since been destroyed, part of the wall remained, but that's about it. The neat part was the town. It was old and still had that medieval feel to it. I tried to snap a few photos, but it's hard to get the impression of what I'm talking about from a photo, guess you'll have to travel to Japan and experience it for yourself.",
      "title" : "Day 8 - Near Oda",
      "img" : "/img/japan-2015/4-18-15.jpg"
    },
    "1152698201013840307" : {
      "caption" : "Sunset on the beach.",
      "include_post" : "Y",
      "id" : "1152698201013840307",
      "latitude" : "35.526",
      "longitude" : "132.977",
      "date" : "2015-04-19 07:12:35",
      "text" : "One of the best days in Japan was around this time. I noticed a little yellow road branching off towards the ocean, so of course I took it. It led over a mountain, threw a tunnel and to a series of tiny coastal towns. I followed the road down to the ocean and sat on the beach watching the sunset. It was so peaceful and quiet I was practically in heaven. About 10 minutes later, a couple with a young child came by (the kid was maybe 2 or 3, somewhere in that range). He came right up and sat down next to me. It was pretty cute. His parents shoo'd him away, of course, but every once-in-a-while I'd see him run around from behind a rock to get a look at me. Adorable.",
      "title" : "Day 9 - Coast north of Matsue",
      "img" : "/img/japan-2015/4-19-15.jpg"
    },
    "1152698747682646469" : {
      "caption" : "The Matsue Castle.",
      "include_post" : "Y",
      "id" : "1152698747682646469",
      "latitude" : "35.464",
      "longitude" : "133.06",
      "date" : "2015-04-20 07:13:40",
      "text" : "By this time I had endured 3 or 4 days of rain. It wasn't a constant all-day rain before this, it was more annoying than anything. However, on this day I woke up to rain, and it was a solid rain for the entire 2 hour ride into Matsue. I said 'screw it' and got a hotel room for the night to dry out. My tent has seen better days (in all fairness to the tent, it has lasted through 1 1/2 thru hikes and a cross-country bike trip or two - fairly impressive) and is now starting to leak. Not a trait you want in a tent. Anyway, the point is that everything I had was wet: the tent, sleeping bag, clothes, everything. It wasn't cold enough to where it was dangerous, I just basically felt like I was starting to mold. Ugh. A day to dry out was needed to preserve my sanity. Luckily, I was in Matsue, which has a huge, awesome castle in the middle of it. Japan has a lot of castles, I like that about this place.",
      "title" : "Day 10 - Matsue",
      "img" : "/img/japan-2015/4-20-15.jpg"
    },
    "1152699355798006235" : {
      "caption" : "The Tottori Sand Dunes.",
      "include_post" : "Y",
      "id" : "1152699355798006235",
      "latitude" : "35.536",
      "longitude" : "134.225",
      "date" : "2015-04-21 07:14:52",
      "text" : "This was one of my favorite days in Japan. The weather became beautiful (and stayed beautiful for the rest of my trip), I met some super friendly Japanese ladies (I think I'll put that story in the extra photos section) and randomly found the Tottori sand dunes. Again, I was there right at sunset, so it was gorgeous, there were only a couple of people wandering around (so it didn't have that creepy-empty feeling to it), and there was some awesome camping. I probably strolled through the dunes for a couple of hours, just enjoying the coast and the sand. What more do you need?",
      "title" : "Day 11 - Tottori Sand Dunes",
      "img" : "/img/japan-2015/4-21-15.jpg"
    },
    "1152699886880778739" : {
      "caption" : "Entering the Mountains.",
      "include_post" : "Y",
      "id" : "1152699886880778739",
      "latitude" : "35.394",
      "longitude" : "134.743",
      "date" : "2015-04-22 07:15:56",
      "text" : "Around this time I had finally started forming a plan for Japan: I decided that I would bike to Kyoto and then take a train to Tokyo. There just wasn't enough time to bike all the way to Tokyo, well there probably was, but I would have to skip seeing Kyoto (practically a sin). I decided that it was more important to see and experience things like Kyoto than to stubbornly stay on the road and bike just to bike. Anyway, the point is that for the first time I had a goal, and suddenly everything changed. I wasn't sure if this was a good thing or not, but I seem to do a lot better with a mission; random wandering does not seem to agree with me, which I found quite surprising. The point is that Kyoto is in the middle of the country, which meant that I would have to leave my wonderful coast behind and start riding up into the mountains. If anyone out there is not familiar with Japan, it's not exactly what I would call a \"flat\" country. There are mountains. Lots of mountains. To get almost anywhere in the country you're going to have to cross some mountains. That's just the way it is.",
      "title" : "Day 12 - Lunch stop",
      "img" : "/img/japan-2015/4-22-15.jpg"
    },
    "1152700660847307280" : {
      "caption" : "The Ocean Arch.",
      "include_post" : "Y",
      "id" : "1152700660847307280",
      "latitude" : "35.297",
      "longitude" : "135.090",
      "date" : "2015-04-22 07:17:28",
      "text" : "I know this point isn't exactly on the coast, but I love this picture.",
      "title" : "Day 12 - Near Fukuchiyama",
      "img" : "/img/japan-2015/4-22-15b.jpg"
    },
    "1152701375967750692" : {
      "caption" : "A tunnel through the mountains.",
      "include_post" : "Y",
      "id" : "1152701375967750692",
      "latitude" : "35.167",
      "longitude" : "135.419",
      "date" : "2015-04-23 07:18:53",
      "text" : "This is the one thing that terrifies me about biking in Japan: The tunnels. These aren't nice Korean tunnels that are only open to pedestrians, oh no, these are highways through the mountain. Sometimes there's a sidewalk through the tunnel, but most of the time it's just you and the traffic. Now to be fair, Japanese drivers are some of the most courteous drivers I have ever seen. If you're riding up a hill and there's a big truck behind you and there's not enough room to safely pass because of the oncoming traffic, they will slow down and wait until it's safe to pass. Really. It's amazing, I've never seen anything like it. The same is true at crosswalks. If the little crosswalk sign is red, Japanese people will sit there and wait until it turns green before they walk across, even if it takes an hour and there isn't a car for miles. They. Will. Wait. Again, it's amazing and something I never see anywhere else. Yay Japan! What was my point? Oh yeah, the tunnels. Terrifying. Even with courteous drivers. I took this picture because of the sign in front of the tunnel, it gives the length, ~1700 meters. That's 1.7 kilometers. That's just over a mile. In a tunnel. On a bike. Absolutely horrible. So if there was an old road that went up and over a pass instead of through the tunnel, you better believe that I took it. Plus a road like that is quiet and peaceful, actually a lovely bike ride. Definitely worth it.",
      "title" : "Day 13 - Lunch stop",
      "img" : "/img/japan-2015/4-23-15.jpg"
    },
    "1152702084930955837" : {
      "caption" : "The hiking trail where I slept to escape Kyoto.",
      "include_post" : "Y",
      "id" : "1152702084930955837",
      "latitude" : "35.075",
      "longitude" : "135.718",
      "date" : "2015-04-23 07:20:18",
      "text" : "I actually made it into Kyoto today, but it was at the very end of the day and I didn't have my hostel booked until the next night, so I had no idea where I was going to sleep. Anyway, I rolled into town and immediately was in some sort of touristy area - there were people everywhere, traffic was horrible and I took one look around and said: No way, I'm outta here, and took a small road up and out of the city and back into the mountains. I didn't even know what road I was on, and it didn't matter. Eventually I stumbled upon a hiking trail, so I walked the bike a decent distance into the forest and set up camp there. I could see Kyoto in the distance below the mountain and I was so happy that I escaped the madness and was camped somewhere quiet, for one night at least.",
      "title" : "Day 13 - Outside Kyoto",
      "img" : "/img/japan-2015/4-23-15b.jpg"
    },
    "1152702882528193113" : {
      "caption" : "I don't even remember the name of this one. But it was pretty.",
      "include_post" : "Y",
      "id" : "1152702882528193113",
      "latitude" : "35.004",
      "longitude" : "135.734",
      "date" : "2015-04-24 07:21:53",
      "text" : "Kyoto was all about the sacred holy temples and shrines. The place is full of them, it seems like you can't throw a rock without hitting something sacred. After awhile you're just wandering around and you see a temple, but it's just a little one and you think: 'why bother'. I know, that's horrible, but it's sort of true. The irony is that I enjoyed the smaller temples a lot more, they are just quieter, you don't have to battle hordes of tourists when you enter one. In case you haven't noticed by now, I enjoy the quiet, peaceful things a heck of a lot more than the busy crowded ones.",
      "title" : "Day 14 - Kyoto",
      "img" : "/img/japan-2015/4-24-15.jpg"
    },
    "1152703498696616559" : {
      "caption" : "One of the more memorable temples along the way: Kinkakuji (the Golden Temple).",
      "include_post" : "Y",
      "id" : "1152703498696616559",
      "latitude" : "34.968",
      "longitude" : "135.772",
      "date" : "2015-04-25 07:23:06",
      "text" : "This place is a perfect example of the craziness of Kyoto. I had to pay to get into it, not a huge amount, but it still seems odd to me to have to pay to see someplace holy. Anyway, there were so many people that we were just herded along like cattle. If I was by myself I would have loved the place and the gorgeous garden grounds around it. With a huge vicious lot of tourists around me, I was less than thrilled (and yes, I'm well aware of the irony that I too am a tourist). The real highlight of Kyoto was not the shrines and temples, but the people I met. I stayed at a hostel, which, yes, is cheap accommodation, but the real perk of the hostel experience are the other travelers you meet. I met 2 guys (one from Australia, one from Scotland) who were working at a ski resort on Hokkaido (the northern island of Japan). The ski season was over, so they were just traveling around Japan for a few weeks before heading home. Later, I met a couple from Ireland who were doing an 8-month round-the-world trip. 8 months!! I was so jealous. We stayed up until midnight talking about our respective adventures. I told them to look me up if they make it to Colorado. How awesome would that be to have 2 Irish backpackers randomly knock on your door? Pretty awesome :)",
      "title" : "Day 15 - Kyoto",
      "img" : "/img/japan-2015/4-25-15.jpg"
    },
    "1152704854287280788" : {
      "caption" : "This was suppose to be my super impressive picture of Mt. Fuji (that was sarcasm).  Instead you get a picture of a nice little temple.",
      "include_post" : "Y",
      "id" : "1152704854287280788",
      "latitude" : "35.300",
      "longitude" : "138.934",
      "date" : "2015-04-28 07:25:48",
      "text" : "I wasted an entire day trying to see Mt Fuji. An entire day! It took me 3 hours and a couple of different trains to get to Gotemba, which is a town not far from Fuji. There are 4 or 5 routes up the mountain, and this town is near one of those routes. All I wanted was to see the mountain and maybe do a little hiking. Turns out that the bus up to the trail doesn't start running until May or possibly June (you can't hike to the top until July/August), so I was stuck in this town on a hazy day and I couldn't even see the mountain. I finally got one glimpse of the thing and tried to take a picture, but of course it turned out like crap. I would not have included it in this series, but since I spent an entire day trying to track the damn thing down, I figured I should at least mention it. Stupid mountains.",
      "title" : "Day 18 - Gotemba",
      "img" : "/img/japan-2015/4-28-15.jpg"
    },
    "1152705513229216421" : {
      "caption" : "Tokyo at night.",
      "include_post" : "Y",
      "id" : "1152705513229216421",
      "latitude" : "35.660",
      "longitude" : "139.701",
      "date" : "2015-04-27 07:27:06",
      "text" : "This is when I most enjoyed Tokyo - at night. There are bright lights, signs and people everywhere, I loved it. You've gotta be careful of which part of town you're walking around in though. Not because it's unsafe, I never felt unsafe in Tokyo, just awkward. Let me explain. I was somewhere near the Shibuya crossing (that famous super-busy street crossing from movies like 'Lost in Translation'). I was walking down the street and suddenly this pretty girl is talking to me. At first, I thought she was begging for money, because that's what I'm use to in big cities, but she was way too put together for that. Then I thought she was trying to sell me something, but I couldn't quite understand what she was saying, so I kept on walking. Turns out she was trying to sell me something, I was just too stupid to realize it. Anyway, after she backed off, another girl came up to me. This was when I started feeling weird. She was also saying things in English that I could barely understand, but then all at once I distinctly heard her say 'blowjob', which caused me to do a double take, but I kept on walking. A minute later was another girl, with much better English, and this time it was: 'massage. handjob. blowjob. free to look.' Over and over again. They were very persistent. Was there something about me that screamed: 'Hey, this guy would totally pay to have some poor Japanese girl do stuff to him'? Because there could be a decent number of people on the sidewalk and they would always target me. Why?!? Hopefully it was because I was obviously a tourist, by myself, and in what appeared to be the red-light district of Tokyo. This is what happens when you just randomly walk around a city. Eventually I got tired of saying 'No thanks' to these ladies, crossed the street, and ran away as fast as I could.",
      "title" : "Day 17 - Tokyo",
      "img" : "/img/japan-2015/4-27-15.jpg"
    },
    "1152706235656137401" : {
      "caption" : "This was suppose to be a picture of the Fish Market.  Instead it's Shibuya Crossing.  How strange.",
      "include_post" : "Y",
      "id" : "1152706235656137401",
      "latitude" : "35.663",
      "longitude" : "139.860",
      "date" : "2015-04-26 07:28:33",
      "text" : "After Kyoto, I took the Shinkasen (the bullet train) to Tokyo. I didn't have a guide book for Japan, so when I got to Tokyo I just did the best I could to find the interesting places. The free tourist maps help, but can only do so much. Anyway, my Irish friends recommended this fish market. I have no idea why it's a tourist attraction - this is where they unload the fish early in the morning, cut it up, and sell it. It's a place of work. It's not designed to accommodate tourists. It would be similar to a group of Japanese tourists walking into my hospital lab, sitting in the middle of the chemistry department, snapping tons of photos, and then having a cup of coffee right there. It's gotta be super annoying to the people who are actually working. Plus, it's gross. I found the place, took a little walk around, got disgusted, and immediately left. If that was the best Tokyo had to offer, I was not impressed.",
      "title" : "Day 16 - Tokyo",
      "img" : "/img/japan-2015/4-26-15.jpg"
    },
    "1152707036944362196" : {
      "caption" : "everyday is a new beginning. enjoy your life!",
      "include_post" : "Y",
      "id" : "1152707036944362196",
      "latitude" : "35.769",
      "longitude" : "140.386",
      "date" : "2015-04-29 07:30:08",
      "text" : "Well that's it, my entire 3-week journey across South Korea and Japan. My overall impression was that I loved them both, but I enjoyed Korea a lot more than Japan. It was just nice having that beautiful, defined bike path to follow. I didn't realize how much I liked that until it was gone. They are both gorgeous countries though, with so much to see and explore; I've barely scratched the surface. But for my very first international bike adventure, I think this was a good choice. It was exotic and adventurous without being scary or dangerous. So is this the beginning of more international trips or perhaps a much larger around-the-world adventure like my Irish friends were on? You never know. After all, everyday is a new beginning. Enjoy your life!",
      "title" : "Day 19- Return to Denver",
      "img" : "/img/japan-2015/4-29-15.jpg"
    },
    "1152710787289672553" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152710787289672553",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:37:35",
      "text" : "A typical small Japanese town. I felt like I could wander around in these little streets forever.",
      "title" : "",
      "img" : "/img/japan-2015/extra1.jpg"
    },
    "1152711121223379829" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152711121223379829",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:38:15",
      "text" : "Continuing on with my tradition of taking pictures of the snacks I buy along the way... I loved Japanese supermarkets, they almost always had a very impressive prepared foods section where you can buy all sorts of interesting things. Like this random assortment of items. Not sure what I was eating, but it was delicious. That was pretty much my usual for lunch, I would find a grocery store and try something new from the prepared section. Japan didn't really have street vendors like Korea did, so this was as close as I could get to that.",
      "title" : "",
      "img" : "/img/japan-2015/extra2.jpg"
    },
    "1152711501428648834" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152711501428648834",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:39:00",
      "text" : "Check out that bridge! No way I was crossing that thing on my bike.",
      "title" : "",
      "img" : "/img/japan-2015/extra3.jpg"
    },
    "1152711873270475665" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152711873270475665",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:39:45",
      "text" : "I read somewhere that it's totally fine to camp in Japanese parks, so that's mainly where I did my camping. On this particular night, it looked like rain, and I was lazy and didn't want to set up my tent, so I slept in the kids play tunnel. Yes, I really am that weird that I would sleep somewhere like that. Although I just now realize how quickly you go from crazy camping guy when you're in a tent to scary homeless guy when you're sleeping in a tunnel. It's amazing what a little bit of nylon and a few poles do to change the perception of a situation.",
      "title" : "",
      "img" : "/img/japan-2015/extra4.jpg"
    },
    "1152712611333761970" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152712611333761970",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:41:13",
      "text" : "Touching the ocean. You should always do it at least once on every trip along the coast.",
      "title" : "",
      "img" : "/img/japan-2015/extra5.jpg"
    },
    "1152713164294024135" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152713164294024135",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:42:18",
      "text" : "Little guardians just outside of a cemetery.\t",
      "title" : "",
      "img" : "/img/japan-2015/extra6.jpg"
    },
    "1152713771906067423" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152713771906067423",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:43:31",
      "text" : "Lunch! I love love love Calamari, it's absolutely my favorite :) I felt like I wasn't getting my fruits and vegetables, so I started buying these healthy juices. I don't know if it mattered, but I guess it made me feel a little better. The shrimp chips (maybe?) were pretty good too.",
      "title" : "",
      "img" : "/img/japan-2015/extra7.jpg"
    },
    "1152714568429562878" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152714568429562878",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:45:06",
      "text" : "Japan has mastered the toilet: Heated seats. Streams of water to, I assume, clean you off. But it was the heated seats that got me. It shocks me that America hasn't adopted that particular feature yet. We love our heated car seats, you'd think toilets would be a natural next step.",
      "title" : "",
      "img" : "/img/japan-2015/extra8.jpg"
    },
    "1152714991743887370" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152714991743887370",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:45:56",
      "text" : "Why do we love Japan? Because there are vending machines everywhere. Even this one, which had literally nothing else around, but there it was, a vending machine in case you happened to need a coffee/soda break in the middle of nowhere. Luckily, I did need a soda break, so kudos to you Japan.",
      "title" : "",
      "img" : "/img/japan-2015/extra9.jpg"
    },
    "1152716056820279340" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152716056820279340",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:48:03",
      "text" : "A beautiful, foggy day in Japan. The picture actually turned out better than I thought it would, yay me!",
      "title" : "",
      "img" : "/img/japan-2015/extra10.jpg"
    },
    "1152716369933461565" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152716369933461565",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:48:41",
      "text" : "I was starting to wonder why there were absolutely no cars on the road I was riding down. Then I came to this and suddenly it all made sense. There were probably all sorts of warning signs before this that I ignored (guess whose Japanese is even worse than his Korean), but in the end it was fine. If the landslide had taken out the entire road I really would have been screwed, I seem to remember it was hours of riding to get to this point.",
      "title" : "",
      "img" : "/img/japan-2015/extra11.jpg"
    },
    "1152716839175415890" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152716839175415890",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:49:37",
      "text" : "A rainy day at the Matsue Castle. I pretty much had the place to myself. Imagine that, no one wanted to walk around the castle grounds in the rain. Shocking!",
      "title" : "",
      "img" : "/img/japan-2015/extra12.jpg"
    },
    "1152719631575247017" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152719631575247017",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:55:09",
      "text" : "On the same day as the lemon soda lady, I met this woman. She had this tiny shack right on the road; I didn't even realize it sold food until I rolled past it and saw her cooking food through the little order window. Half a block later it finally clicked in my head what I just saw, so I stopped, turned around, and went back to buy whatever it was that she was selling. I didn't even care, I would have purchased anything. She didn't speak English, but she was the happiest person I've ever seen in my life. The entire time I was there she was laughing and kept pointing to things trying to figure out what I wanted to buy. It was so much fun, if the lemon soda lady hadn't already made my day, this lady totally would have.",
      "title" : "",
      "img" : "/img/japan-2015/extra13.jpg"
    },
    "1152720028314462389" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152720028314462389",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:55:57",
      "text" : "Turns out the shack lady was making some sort of pancake thing with various fillings. The fish shaped one looked the best, but was filled with something unusual; I want to say it was some sort of bean paste, but I'm not positive about that. Of course I ate it, but I probably wouldn't have bought another one. The round one though, oh my goodness the round one. It was filled with custard. Delicious. Absolutely delicious. The moral here: when in doubt, go with the custard over the bean paste. Trust me on this one.",
      "title" : "",
      "img" : "/img/japan-2015/extra14.jpg"
    },
    "1152720555077101769" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152720555077101769",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:57:00",
      "text" : "If you rest your bike against a little shrine on the side of the road, does that mean you're going straight to hell? I guess we'll find out!",
      "title" : "",
      "img" : "/img/japan-2015/extra15.jpg"
    },
    "1152720828302452948" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152720828302452948",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:57:32",
      "text" : "Oh my goodness this made me laugh. Nap Parking. Japan thinks of everything.\t",
      "title" : "",
      "img" : "/img/japan-2015/extra16.jpg"
    },
    "1152721104824527069" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152721104824527069",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:58:05",
      "text" : "In case anyone is curious about how I navigated Japan, these are the maps that I used. The big one is one I purchased before I left for this trip. It's just a general overview type of map, but it's in English, so at least I know the names of the towns. The smaller ones are the 'Touring Mapple' that I purchased in convenience stores along the way. They're super detailed, but in Japanese. I really just needed the roads anyway, so those maps were good enough for me.",
      "title" : "",
      "img" : "/img/japan-2015/extra17.jpg"
    },
    "1152721515144898790" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152721515144898790",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 07:58:54",
      "text" : "This was a bridge over a moat around one of the castles along the way. I was trying to be all artistic and take a black and white photo of it (plus it was a rainy, foggy sort of day, so b/w seemed appropriate). I'm not sure how great the end result is, but whatever.",
      "title" : "",
      "img" : "/img/japan-2015/extra18.jpg"
    },
    "1152722104192952570" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152722104192952570",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:00:04",
      "text" : "The first thing I came across in Kyoto. It was big and pretty, but also jam packed with tourists.",
      "title" : "",
      "img" : "/img/japan-2015/extra19.jpg"
    },
    "1152722409806719235" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152722409806719235",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:00:41",
      "text" : "This is a train station. Really, it's the Kyoto train station. It was pretty impressive.",
      "title" : "",
      "img" : "/img/japan-2015/extra20.jpg"
    },
    "1152722658537335049" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152722658537335049",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:01:10",
      "text" : "My very favorite shrine in Kyoto (heck, in all of Japan) was the one on Mt. Inari. There's a trail that goes up this mountain, and almost the entire path has these orange arches over it. It's almost as if you're walking through a tunnel, it was unique, that's for sure. At first I was super annoyed (of course), because of the massive amounts of tourists there, but as you had to work harder to get to the top of the mountain, suddenly the number of tourists dropped off significantly. People don't want to have to work hard to see something?!? Shocking! But regardless, I enjoyed the path towards the top a lot more than the path at the bottom.",
      "title" : "",
      "img" : "/img/japan-2015/extra21.jpg"
    },
    "1152723050025281816" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152723050025281816",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-05 08:01:57",
      "text" : "The orange tunnel to the top of Mt. Inari.",
      "title" : "",
      "img" : "/img/japan-2015/extra22.jpg"
    },
    "1152723545968175402" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152723545968175402",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:02:56",
      "text" : "This could be my favorite selfie of the entire trip.",
      "title" : "",
      "img" : "/img/japan-2015/extra23.jpg"
    },
    "1152723831315065139" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152723831315065139",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:03:30",
      "text" : "The only place in Japan where I found street food - the super touristy areas near the famous temples and shrines. It was worth it though, those noodles were delicious.",
      "title" : "",
      "img" : "/img/japan-2015/extra24.jpg"
    },
    "1152724189332465986" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152724189332465986",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:04:13",
      "text" : "An absolutely enormous cemetery.  I *might* have gotten lost in there...",
      "title" : "",
      "img" : "/img/japan-2015/extra25.jpg"
    },
    "1152725454451992941" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152725454451992941",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:06:44",
      "text" : "I'm sure this place had a name, but I can't seem to remember it.",
      "title" : "",
      "img" : "/img/japan-2015/extra26.jpg"
    },
    "1152725835185744256" : {
      "caption" : "This was suppose to be a picture of a giant severed fish head.  Not sure what happened, but at least it's still a picture of the fish market.",
      "include_post" : "Y",
      "id" : "1152725835185744256",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:07:29",
      "text" : "One of the many appetizing things you see in the fish market in Tokyo. Again, why is this place a tourist destination?",
      "title" : "",
      "img" : "/img/japan-2015/extra27.jpg"
    },
    "1152726345783536027" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152726345783536027",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:08:30",
      "text" : "Lots of wall art in Tokyo.",
      "title" : "",
      "img" : "/img/japan-2015/extra28.jpg"
    },
    "1152726711988218280" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152726711988218280",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:09:14",
      "text" : "As I was wandering around Tokyo, all of a sudden I was surrounded by people and cameras and then magically this lady appeared. It was some kind of photo shoot, but I have no idea who she is. I assume she's famous, or maybe just a model? I wanted to look it up, but what would I search under? It may forever be a mystery to me.",
      "title" : "",
      "img" : "/img/japan-2015/extra29.jpg"
    },
    "1152727030293948854" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152727030293948854",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:09:52",
      "text" : "This was the Harajuku district of Tokyo. It was just weird and funky and lots of fun to wander around in.",
      "title" : "",
      "img" : "/img/japan-2015/extra30.jpg"
    },
    "1152727030293948855" : {
      "caption" : "",
      "include_post" : "Y",
      "id" : "1152727030293948855",
      "latitude" : "",
      "longitude" : "",
      "date" : "2015-05-08 08:09:52",
      "text" : "This kinda sums up my Tokyo experience perfectly.",
      "title" : "",
      "img" : "/img/japan-2015/extra31.jpg"
    }
  }