{
    "1152669024302754105" : {
      "caption" : "The right way to do a country-spanning bike path.  The red part isn't a road, it's all bike path.",
      "include_post" : "Y",
      "id" : "1152669024302754105",
      "latitude" : "37.495",
      "longitude" : "126.488",
      "date" : "2015-04-10 06:14:37",
      "text" : "I wasn't really sure what to expect when I arrived in South Korea. I knew there was a bike path that spanned the country (called the 4 rivers bike path), but I had no idea what shape it would be in, how well marked it would be, if there were signs and if I'd be able to understand them (my Korean just isn't what it use to be). My fears were totally unfounded. The bike path is wonderful, it's amazing really, every single turn is marked, there are signs everywhere, and even if you don't understand Korean all of the signs for the 4 rivers trail start with a 4, so they're not hard to pick out. The point is that even someone who doesn't understand the language at all was able to easily navigate across the entire country with ease. Other countries take note: this is how you build bike paths. Go to Korea. Follow their example. Build bike paths like this one that also span your entire country and the bike tourists will follow. Well, at least I will, who cares what anyone else does.",
      "title" : "Day 0 - Seoul",
      "img" : ""
    },
    "1152671979886176679" : {
      "caption" : "Yes, this is where I slept my first night in Korea; I was too lazy to actually set up my tent and so I thought: Why not?",
      "include_post" : "Y",
      "id" : "1152671979886176679",
      "latitude" : "37.496",
      "longitude" : "127.479",
      "date" : "2015-04-11 06:20:29",
      "text" : "My first day in Korea I was torn between just hopping on that beautiful bike path and riding it as far as I could and actually taking a day to see Seoul. In the end I did a half-assed approached, I decided to ride to Seoul (the path actually starts 30km or so away in Incheon, not that it really matters) and find one of those hop on, hop off tour buses and let it take me around the city. I really liked Seoul, it seems like a great city, and I was there on a weekend, a really nice weekend so everyone was out enjoying the river and the bike path and it was just really relaxing. Well, I was as relaxed as you can be when you're brand new in a foreign country, don't speak the language, don't really know where you're going, and have no idea where you'll be sleeping that night. But other than that, it was super relaxing.",
      "title" : "Day 1 - Island near Yangpyeon Art Museum",
      "img" : ""
    },
    "1152672576643361206" : {
      "caption" : "Just some pretty Korean river scenery.",
      "include_post" : "Y",
      "id" : "1152672576643361206",
      "latitude" : "37.110",
      "longitude" : "127.810",
      "date" : "2015-04-12 06:21:40",
      "text" : "--",
      "title" : "Day 2 - Saejae Bike Path (lunch stop)",
      "img" : ""
    },
    "1152674455876102662" : {
      "caption" : "Silleuksa Temple. Well, the gate to it, at least. Yes, I rode right up through it, I'm horrible like that, and didn't even realize that might not be a proper thing to do until it was too late. Or maybe it was fine, who knows.",
      "include_post" : "Y",
      "id" : "1152674455876102662",
      "latitude" : "36.763",
      "longitude" : "128.001",
      "date" : "2015-04-12 06:25:24",
      "text" : "This day brought me the first 2 of many to come: the temples and shrines of Korea and Japan. The first one was Silleuksa, and it was a bit off the path, so I wasn't even sure if I would go, but there were tons of signs for it, so I figured it was probably a big deal and therefore I should at least make an attempt to visit it. Yes, that's really my logic, I was ridiculously close to what was probably one of the most scared places in Korea and I was debating if I should ride the 1 kilometer extra to see it. I laugh now, but I really did debate it at the time. Anyway, I'm so glad I went, it's a beautiful compound, right on the river, and there were only a handful of tourists there, a stark contrast to the shrines in Japan, but of course I didn't know that at the time. I just wandered around the place for an hour, it was incredible. I even bought a little souvenir, which I almost never do. Towards the end of the day there was another temple, this one was right on the path, but it involved climbing up a hill, so of course, again there was that debate in my head - what do I do? Ugh, you'd think I would learn by now: Just go. You almost never regret just going. This temple was Jeongsimga, or something like that. Much smaller than Silleuksa, and I was the only person there. Probably because you had to climb up a mountain to get to it. What is it with temples, you always have to climb something or travel a long ways to get to them. You'd think when they built the things a thousand years ago that they would have considered the needs of the lazy American tourist, but no, they just put their temple on top of the mountain like they didn't care at all. That was sarcasm, by the way, just in case anyone missed that. Regardless, that was my second day in Korea: Experiencing my first temples, and like most things, the first ones will always be the best. No really, Silleuksa was my favorite of the entire trip. Inari would be my second (that one is in Japan, we'll get to it later)...",
      "title" : "Day 2 - Saejae Bike Path",
      "img" : ""
    },
    "1152674908500224539" : {
      "caption" : "Friends that I met along the way.",
      "include_post" : "Y",
      "id" : "1152674908500224539",
      "latitude" : "36.048",
      "longitude" : "128.406",
      "date" : "2015-04-13 06:26:18",
      "text" : "My third day on the road was the first and really the only time I got lost and off track. As I tend to do, I missed a turn, which normally isn't a big deal, but the road I was on still had the 4-rivers signs on it, they were just pointing to something else. I have no idea what that something else is because I still don't read Korean, but whatever it was led me about an hour off course before I finally figured out that I wasn't where I was suppose to be. Oh well, getting lost is all part of the fun. The good part of this day was that I got to meet other guys biking the path. We kept running into each other throughout the day and finally towards evening Mr. Kim (who barely speaks English) asked me if I wanted Maki - Korean wine. I wasn't exactly sure what he was planning, but when someone invites you to drink Korean wine, I decided that it's best to just say yes and hope for the best. We ended up at some restaurant eating dinner and drinking, and my new Korean friends got a huge laugh at watching me attempt to use chop sticks, so it was good fun all around. Their English wasn't great, but as far as I could tell for dinner we had the standard kimchi with pickled onion and then spicy pig neck with rice. Delicious. I was a little hesitant when they described the pig neck part, but heck, I'm game for anything, bring it on!",
      "title" : "Day 3 - Chilgok-gun",
      "img" : ""
    },
    "1152675437334850096" : {
      "caption" : "An example of the festival food (and yes, I tried it!)",
      "include_post" : "Y",
      "id" : "1152675437334850096",
      "latitude" : "35.381",
      "longitude" : "128.573",
      "date" : "2015-04-14 06:27:21",
      "text" : "I've decided that one of my favorite things to do while on this path is to explore the towns along the way. The nice thing about the bike path is that it follows the rivers, so it mostly bypasses a lot of towns, or at least the main parts of towns. If you want to go into the town properly, you have to turn off of the path intentionally, so at least once a day, usually more, I turn off when a spot looks interesting and see what happens. Usually I'm just looking for a grocery store to buy food and snacks for the day, but it's also fun to just wander around checking everything out. Korean towns are awesome because you never know what you'll find. For example, in one town they were having some sort of festival with lots of booths selling food, souvenirs, etc. It was a definite carnival-like atmosphere. Anyway, I turned the corner and wandered by this tent where they were playing music, inside were people in traditional costumes and they were singing: \"Dancing in the moonlight\". Seriously. If the sight of that doesn't make you smile, nothing ever will.",
      "title" : "Day 4 - Gilgok District Park",
      "img" : ""
    },
    "1152675894807587394" : {
      "caption" : "The end of the line in Korea. The red booths are 'certification centers' where you can get a stamp to prove you were there and if you complete the whole path you get some sort of certificate. I didn't know this until I was almost done, so no certificate for me :(",
      "include_post" : "Y",
      "id" : "1152675894807587394",
      "latitude" : "35.109",
      "longitude" : "128.947",
      "date" : "2015-04-15 06:28:16",
      "text" : "My Korean adventure only lasted 5 days. That was all it took to bike from one corner of the country to the other. The difficult part came when I had figure out how to get my sorry butt to Japan. I knew there was a ferry, but I had no idea where to find it. Somewhere along the ocean was my best guess, but didn't get me very far. Luckily I found a guy who spoke no English but tried really hard to help me (thank you Google Translate!), and eventually I found the 'domestic' ferry, only to cry a little in frustration when I realized I needed the 'international' ferry. Whatever, I figured it out after awhile. Then came the task of trying to buy an actual ticket. In order to get into Japan I needed to prove that I had a flight out, which was no problem, but I also needed an address of where I was staying. 'But I'm biking and camping' was not an acceptable answer to that question. So I had to book a hotel for a night. I eventually canceled it, but it's still annoying. That poor girl at the ticket counter, I probably tried and failed at least 3 times to buy a simple ferry ticket, but eventually, eventually I got one. Crossing international borders - always such a joy. As I've said before, the world is just not set up for wandering drifters like myself.",
      "title" : "Day 5 - Busan Certification Center",
      "img" : ""
    },
    "1152676322987305554" : {
      "caption" : "The Japanese Bath",
      "include_post" : "Y",
      "id" : "1152676322987305554",
      "latitude" : "34.5",
      "longitude" : "129",
      "date" : "2015-04-16 06:29:07",
      "text" : "I added an extra random point in the ocean because I wanted to show this picture - it's some sort of Japanese bath, and at that point I hadn't showered since I arrived in Korea, so I had a little bit of the ole biker funk going on. This bath was my only option if I wanted to get cleaned up. The problem: I had no idea how this thing was suppose to work. Was it a bathing suit type of situation? Clothing optional? Did you have to wash off before going in the hot tub like area? I assumed you did, but the shower-ish area on the right side of the picture was only about waist high, so I wasn't entirely sure what to make of that. No one was in there, so like most things, I just winged it. I decided clothing was not necessary, washed off as best I could, and then sat in the hot tub things to relax. After a few minutes several old Japanese men came in, and it turns out I was pretty much right, there was a whole lot of nakedness going on, and they sit down to wash themselves off before going in. Makes sense, I suppose. At first I was a little uncomfortable with the whole situation, but after while you just get use to naked old Japanese men walking around. It doesn't seem to bother them, so I guess it shouldn't bother me.",
      "title" : "Day 6 - On the Ferry",
      "img" : ""
    },
    "1152677483442170493" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152677483442170493",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:31:25",
      "text" : "Putting the bike together at the airport. It took all of 5 minutes. Love that folding bike! And yes, that's really the bike I used. I'm pretty sure I looked like one of those circus bears riding a unicycle when I was on it, but I loved it, it's so easy to fold it up and throw it on a plane, bus, whatever. Rides like a 'real' bike too, I didn't have any issues at all with it.",
      "title" : ".",
      "img" : ""
    },
    "1152677880030390931" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152677880030390931",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:32:12",
      "text" : "In case anyone is curious, this would be an example of both Korean and Japanese money (top = Korean, bottom = Japanese). My first experience was with a Korean ATM. The only problem? I forgot to look up the exchange rate before I left, so there I was, at the ATM faced with the won choices of 100,000; 200,000; 300,000 etc and having no idea if that was a ridiculously small, large, or normal amount of money. 100,000 seems like so much! I was a little nervous pushing that button, but the exchange is ~1000:1, so it was around $100. I could live with that.",
      "title" : ".",
      "img" : ""
    },
    "1152678280284433060" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152678280284433060",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:33:00",
      "text" : "My first navigational mistake in Korea. I'm sure if you know Korean, this is perfectly obvious (plus, I missed the big sign right before it). I had no idea though, and went straight when I should have turned right. Oh well. I actually enjoyed it, I got to see a fun little slice of Korea that I otherwise would not have. Getting lost can be fun!",
      "title" : ".",
      "img" : ""
    },
    "1152678804572433101" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152678804572433101",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:34:02",
      "text" : "I decided to take pictures of some of the snacks I found along the way. Blueberry milk seemed like it would be amazingly delicious. It wasn't. I mean it was fine, I drank it, but I was expecting so much more.",
      "title" : ".",
      "img" : ""
    },
    "1152680159039023865" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152680159039023865",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:36:44",
      "text" : "The tunnels in Korea were nothing like the tunnels in Japan. These tunnels were old rail lines, so now they are exclusively for bikes (and people walking, I suppose, if you're into that sort of thing). No cars! How can you not love that!!\t",
      "title" : ".",
      "img" : ""
    },
    "1152681110827264801" : {
      "caption" : "--",
      "include_post" : "Y",
      "id" : "1152681110827264801",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:38:37",
      "text" : "One of the shrines inside the Silleuksa temple. People were in there actively praying and bowing. It felt a little strange to be snapping photos, but I've gotten use to being a horrible American.",
      "title" : ".",
      "img" : ""
    },
    "1152682015865793349" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152682015865793349",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:40:25",
      "text" : "If you snap a selfie with a holy shrine, does that mean you automatically go to Hell? I guess we'll find out!\t",
      "title" : ".",
      "img" : ""
    },
    "1152682575906040670" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152682575906040670",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:41:32",
      "text" : "I was there during the cherry blossom time. I think it was a much bigger deal to everyone else than it was for me.",
      "title" : ".",
      "img" : ""
    },
    "1152683189448829817" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152683189448829817",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:42:45",
      "text" : "Aren't they adorable?",
      "title" : ".",
      "img" : ""
    },
    "1152688063322351679" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152688063322351679",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:52:26",
      "text" : "This was the high point along the route? Maybe? I'm not sure, but it seemed like a fairly big deal.",
      "title" : ".",
      "img" : ""
    },
    "1152688816871008344" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152688816871008344",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:53:56",
      "text" : "This is why I loved Korea. At many, but not all, of the towns I went through there were these booths set up along the street. At first I thought I just happened to stumble upon a once-a-month farmer's market, or something, but it happened way too often to be a special event; I think this is just how Korea is. The best part about them? The vendors selling hot food. Oh my goodness how I loved that stuff, it's so much better than being all weird and awkward in a restaurant, with a street vendor you can just point and grunt and 30 seconds later you're eating something delicious.",
      "title" : ".",
      "img" : ""
    },
    "1152689837034793076" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152689837034793076",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:55:58",
      "text" : "The restaurant where I ate dinner with my new Korean friends!",
      "title" : ".",
      "img" : ""
    },
    "1152690470592800909" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152690470592800909",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:57:13",
      "text" : "This is what I followed to get from Incheon (Seoul) to Busan. I have no idea what the signs say, but I just looked for the 4 and blindly followed it wherever it led me. I only ever got lost once, when my 'real 4' signs got replaced with 'fake 4' signs. Again, I'm sure it was completely obvious if you know Korean. But guess who still doesn't know Korean!",
      "title" : ".",
      "img" : ""
    },
    "1152690937846655137" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152690937846655137",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 06:58:09",
      "text" : "The most amazing snack of the entire journey. Oh where have you been all of my life Grape Drink Yogurt?!? (the apple was good, but the grape was far superior). Seriously, it was the most incredible thing I put into my mouth that entire day.",
      "title" : ".",
      "img" : ""
    },
    "1152692052382279878" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152692052382279878",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 07:00:22",
      "text" : "I just thought this was pretty.",
      "title" : ".",
      "img" : ""
    },
    "1152692619829668063" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152692619829668063",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 07:01:29",
      "text" : "I thought I was on a bike path, because, well, it was pretty much a bike path. I was pleasantly surprised though when suddenly I heard a car honking behind me. Turns out my bike path was actually a road, who knew? I quickly learned that about Korea, if there's enough space for a car, someone WILL drive a car there. I'm not sure what happens if someone comes from the other direction though...",
      "title" : ".",
      "img" : ""
    },
    "1152693026517772524" : {
      "caption" : ".",
      "include_post" : "Y",
      "id" : "1152693026517772524",
      "latitude" : "--",
      "longitude" : "--",
      "date" : "2015-05-08 07:02:18",
      "text" : "One last snack picture. Yes, they were squid flavored. Yes, I ate them. It really wasn't that bad, it was actually pretty good. Come on, give squid a try!",
      "title" : ".",
      "img" : ""
    }
  }