{
    "1151579988007938096" : {
      "caption" : "My first night of camping. Very glamorous, 'eh?",
      "include_post" : "Y",
      "id" : "1151579988007938096",
      "latitude" : "44.0",
      "longitude" : "-123.66",
      "date" : "2014-09-10 18:10:53",
      "text" : "Day 1 - Disaster! I'm camped at least 30 miles from the closest source of ice cream. How could I let this happen?!? Here's hoping tomorrow is a better day.",
      "title" : "Somewhere on hwy126?",
      "img" : "/img/pacificCoast-2014/9-10-14.jpg"
    },
    "1152017444352125359" : {
      "caption" : "Touching the ocean. Gotta do it at least once.",
      "include_post" : "Y",
      "id" : "1152017444352125359",
      "latitude" : "43.97",
      "longitude" : "-124.1",
      "date" : "2014-09-11 08:40:02",
      "text" : "I made it to the 101, i'm finally back where I left off last time. I gotta say, after sleeping under the stars last night, drinking from questionable streams, pooping in the woods, it felt like I was home. Especially this morning, I got on my bike and it felt like I had jumped on an old friend and was taking him for a ride. That didn't come out quite the way I wanted, but the point is: I missed this.",
      "title" : "Florence",
      "img" : "/img/pacificCoast-2014/9-11-14.jpg"
    },
    "1152018109233195459" : {
      "caption" : "A typical hiker/biker site in an Oregon State Park.",
      "include_post" : "Y",
      "id" : "1152018109233195459",
      "latitude" : "43.15",
      "longitude" : "-124.4",
      "date" : "2014-09-11 08:41:21",
      "text" : "Day 2 - ~100 mile day, which may not have been the best idea on my first full day of biking, I'm pretty sure I'm going to feel it in the morning. It doesn't matter at the moment though, because I just have one thing to say: mmmmm.... ice cream. :)",
      "title" : "Bandon",
      "img" : "/img/pacificCoast-2014/9-11-14b.jpg"
    },
    "1152018985188420062" : {
      "caption" : "Oregon is amazing.",
      "include_post" : "Y",
      "id" : "1152018985188420062",
      "latitude" : "42.07",
      "longitude" : "-124.31",
      "date" : "2014-09-12 08:43:06",
      "text" : "Day 3- Oregon does not disappoint, today was a spectacular ride! I'd show pictures but some idiot wasn't smart enough to add picture-displaying capabilities to his app. What a ripoff, you should demand your money back. Update: Guess who figured out how to get pictures to work!!",
      "title" : "Brookings (Oregon, not South Dakota)",
      "img" : "/img/pacificCoast-2014/9-12-14.jpg"
    },
    "1152019604603234794" : {
      "caption" : "This isn't where I had lunch, it's just a big tree.",
      "include_post" : "Y",
      "id" : "1152019604603234794",
      "latitude" : "41.53",
      "longitude" : "-124.04",
      "date" : "2014-09-13 08:44:20",
      "text" : "Stopping for lunch in Redwood country and chatting with some nice local homeless people about spider bites. Good times.",
      "title" : "Klamath",
      "img" : "/img/pacificCoast-2014/9-13-14.jpg"
    },
    "1152020407820839414" : {
      "caption" : "A typical biker dinner (not the guys from England, unfortunately).",
      "include_post" : "Y",
      "id" : "1152020407820839414",
      "latitude" : "40.02",
      "longitude" : "-123.8",
      "date" : "2014-09-14 08:45:55",
      "text" : "A big perk of biking are the people you meet. The other day I met 2 guys from England who were on an around the world bike trip. Guess who got inspired! You know what that means: Travis goes global. Oh I don't know if I'd actually go, but it's one of those things that whispers to me late at night and makes me wonder, 'could I really do it...' But the things you'd see, the people you'd meet, the adventures you'd have. Oh the places you'd go!",
      "title" : "Richardson Grove State Park",
      "img" : "/img/pacificCoast-2014/9-14-14.jpg"
    },
    "1152021240641841665" : {
      "caption" : "Big trees. Pretty ride.",
      "include_post" : "Y",
      "id" : "1152021240641841665",
      "latitude" : "38.8",
      "longitude" : "-123.58",
      "date" : "2014-09-16 08:47:35",
      "text" : "So I left the Redwoods and good ole Hwy101 for the coast-hugging Hwy1. The Redwoods were impressive: they're big. Old. Round. Come on, they're just trees. But sometimes, when there were actually no cars around, the forest was eerily calm. Of course, then one of those 4-bedroom, 2-bath jumbo RVs with its own radar tower comes thundering past and nearly knocks you off the road. Sense of calm forever shattered. Thanks RVs!!",
      "title" : "Manchester",
      "img" : "/img/pacificCoast-2014/9-16-14.jpg"
    },
    "1152022093704555028" : {
      "caption" : "Look at how pretty that is.",
      "include_post" : "Y",
      "id" : "1152022093704555028",
      "latitude" : "38.34",
      "longitude" : "-123.05",
      "date" : "2014-09-16 08:49:16",
      "text" : "Well today was both spectacular and terrifying. If you've been on Hwy 1 in Sonoma county, you know what I mean. They cut the road into the side of a mountain, which provides breath-taking views along with the following scenario: Travis -> ~1 foot of space -> steep cliff -> ocean. Pretty much the whole day I was thinking: 'Wow, that's amazing... Oh crap, I'm going to die, I hate cars!!! Oh look, that's pretty.' Kept it interesting, I guess.",
      "title" : "Bodega bay",
      "img" : "/img/pacificCoast-2014/9-16-14b.jpg"
    },
    "1152022682433841696" : {
      "caption" : "Crossing the Golden Gate Bridge - not as bad as you might think.",
      "include_post" : "Y",
      "id" : "1152022682433841696",
      "latitude" : "38.02",
      "longitude" : "-122.73",
      "date" : "2014-09-16 08:50:27",
      "text" : "Taking an 'easy' day today so I can relax and enjoy San Fran tomorrow instead of blasting through it. There's no rush, there's plenty of time; I have no place to be and all day to get there. For now, at least.",
      "title" : "North of San Francisco",
      "img" : "/img/pacificCoast-2014/9-16-14c.jpg"
    },
    "1152023210396052014" : {
      "caption" : "One of my favorites.",
      "include_post" : "Y",
      "id" : "1152023210396052014",
      "latitude" : "37.47",
      "longitude" : "-122.45",
      "date" : "2014-09-18 08:51:30",
      "text" : "San Fran was the ending point for a lot of people that I had been sort of traveling with. It's just nice having friendly faces to laugh with while sitting around a campfire at the end of a long day. But unless you have dedicated travel partners, people appear and disappear in the blink of an eye. That's just the way it goes out here, and I know that, but it still leaves me feeling lonely.",
      "title" : "Half Moon Bay",
      "img" : "/img/pacificCoast-2014/9-18-14.jpg"
    },
    "1152023785217026624" : {
      "caption" : "Pretty amazing, 'eh?",
      "include_post" : "Y",
      "id" : "1152023785217026624",
      "latitude" : "36.89",
      "longitude" : "-121.82",
      "date" : "2014-09-19 08:52:38",
      "text" : "Not one, but two flat tires happened today. Now a certain someone is a little tired, grumpy and needs a nap. Unfortunately, a mom in the next campsite is reenacting Peter Pan for her kids. Quite loudly. I hate weekends.",
      "title" : "Sunset Beach State Park",
      "img" : "/img/pacificCoast-2014/9-19-14.jpg"
    },
    "1152024405235821129" : {
      "caption" : "--",
      "include_post" : "Y",
      "id" : "1152024405235821129",
      "latitude" : "35.11",
      "longitude" : "-120.62",
      "date" : "2014-09-21 08:53:52",
      "text" : "Today was all about seeing some cool ocean animals. We had elephant seals taking a nap on the beach, whales doing whatever it is whales do in the ocean, and then there were zebras. Now I know that zebras aren't exactly considered a sea animal, but they're also not something one commonly finds on a random highway, but there they were, hanging out with a bunch of cows in a field. So sure, why not, let's have some zebras.",
      "title" : "Grover Beach",
      "img" : "/img/pacificCoast-2014/9-21-14.jpg"
    },
    "1152024995391171154" : {
      "caption" : "Not the best riding ever, but certainly not the worst.",
      "include_post" : "Y",
      "id" : "1152024995391171154",
      "latitude" : "34.46",
      "longitude" : "-120.03",
      "date" : "2014-09-22 08:55:02",
      "text" : "Today was not a fun day, it was hot, hilly, and horrible - the 3 H's. It was the kind of landscape that would make sister say, 'Ew. No thanks.' I think I've been spoiled by the dramatic, rugged coastal rides; when the route turns inland a little, like it did today, I turn into a spoiled child and demand my beautiful ocean back. Luckily, the ocean is never far.",
      "title" : "El Capitan State Park",
      "img" : "/img/pacificCoast-2014/9-22-14.jpg"
    },
    "1152025761262692961" : {
      "caption" : "Proof that I went to the beach at least once on my trip.",
      "include_post" : "Y",
      "id" : "1152025761262692961",
      "latitude" : "34.05",
      "longitude" : "-118.93",
      "date" : "2014-09-23 08:56:34",
      "text" : "Tomorrow it happens: I have to cross Los Angeles. The way other bikers talk about LA you'd think we were going into a war-torn 3rd world country, or some ebola-striken part of Africa. Oh LA, what happened to you to give you such a reputation? Guess I'll find out tomorrow. All I do know is that it will take an entire day to cross the massive urban sprawl that is LA, and it's not like I'm a slacker who can't cover some miles.  An entire day! That's just not right.",
      "title" : "Leo Carrillo State Park",
      "img" : "/img/pacificCoast-2014/9-23-14.jpg"
    },
    "1152026374646098541" : {
      "caption" : "Funkiness in LA",
      "include_post" : "Y",
      "id" : "1152026374646098541",
      "latitude" : "33.46",
      "longitude" : "-117.68",
      "date" : "2014-09-24 08:57:47",
      "text" : "I survived Los Angeles! Actually, it really wasn't that bad. Most of the route followed bike paths along some gorgeous beaches, and the part that went through actual city wasn't that bad. It wasn't great, but I've definitely had worse. So all-in-all, I give LA my stamp of approval. I'm sure they've been eagerly awaiting that, you should expect the parade any day now.",
      "title" : "Doheny State Park",
      "img" : "/img/pacificCoast-2014/9-24-14.jpg"
    },
    "1152026907079436926" : {
      "caption" : "Photo courtesy of Rachel. This was the only time I actually went in the ocean.  Obviously I only went in up to my knees, I'm not an idiot.",
      "include_post" : "Y",
      "id" : "1152026907079436926",
      "latitude" : "32.93",
      "longitude" : "-117.16",
      "date" : "2014-09-25 08:58:50",
      "text" : "Made it to San Diego!! Technically, this was suppose to be the end of the line for me, but I got here kind of early, so I might take tomorrow and ride to the border. Although a comfy couch and a freezer full of ice cream make compelling arguments to lay around and do nothing. I guess we'll see what tomorrow brings...",
      "title" : "San Diego",
      "img" : "/img/pacificCoast-2014/9-25-14.jpg"
    },
    "1152027404532279952" : {
      "caption" : "Rachel and Miss Ada checking out the elephants.",
      "include_post" : "Y",
      "id" : "1152027404532279952",
      "latitude" : "32.74",
      "longitude" : "-117.15",
      "date" : "2014-09-28 08:59:50",
      "text" : "Spent a day at the zoo with 2 lovely ladies. I think you really need to visit places like a zoo with a small child to get the full enjoyment out of it.",
      "title" : "San Diego Zoo",
      "img" : "/img/pacificCoast-2014/9-28-14.jpg"
    },
    "1152027924005218973" : {
      "caption" : "The sad, empty state park on the Mexican border.",
      "include_post" : "Y",
      "id" : "1152027924005218973",
      "latitude" : "32.54",
      "longitude" : "-117.12",
      "date" : "2014-09-26 09:00:52",
      "text" : "This is it, the end of the line for me, I've gone as far south as I can go without a passport. Mexico! It's been a great trip, Oregon is amazing and I would bike that portion again anytime. California had some spectacular sections, but I wouldn't be quite as eager to redo it. Anyway, I hope you enjoyed following along, and stay tuned, who knows what my next adventure will be!",
      "title" : "Mexico! (well, the border at least)",
      "img" : "/img/pacificCoast-2014/9-26-14.jpg"
    }
  }
  