{
    "1" : {
        "caption" : "Cooper and Rya",
        "include_post" : true,
        "id" : "1",
        "latitude" : "39.361",
        "longitude" : "-106.062",
        "date" : "5-25-13",
        "text" : "Ok, so this was technically before my bike trip.  I drove my car to Breck and then flew back to Seattle to start the trip.  Of course, while I was in Breck I went hiking at my favorite spot.  I happend to know a couple of dogs who seem to enjoy hiking, one of them slightly more than the other, but they were kind enough to join me for a quick hike.",
        "title" : "Day 0",
        "img" : "/img/seattle-maine-2013/5-25-13.jpg"
    },
    "2" : {
        "caption" : "",
        "include_post" : true,
        "id" : "2",
        "latitude" : "39.481",
        "longitude" : "-106.038",
        "date" : "5-27-13",
        "text" : "Just a little family time before the bike craziness begins.",
        "title" : "Day 0",
        "img" : "/img/seattle-maine-2013/5-27-13.jpg"
    },
    "3" : {
        "caption" : "The flower basket drama",
        "include_post" : true,
        "id" : "3",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-27-13",
        "text" : "This was hilarious.... the day of the hanging basket drama.  My sisters were picking out hanging baskets and had about a dozen set off to the side that they were trying to decide between.  This little old lady comes walking up, (right in front of my sister, who has clearly claimed these baskets), grabs one, and tries to make a break for it.  My sweet, lovely sister turns around, tackles her and starts screaming 'That's MY basket you B****!!!' Alright, she didn't really do that, but she did get a slightly confrontational tone to her voice when she told the lady to put the basket back.  The moral of the story:  Don't mess with my sister and her flowers.",
        "title" : "Day 0",
        "img" : "/img/seattle-maine-2013/5-27-13b.jpg"
    },
    "4" : {
        "caption" : "The actual start of the trip.",
        "include_post" : true,
        "id" : "4",
        "latitude" : "47.606",
        "longitude" : "-122.332",
        "date" : "5-30-13",
        "text" : "This was the actual start, Fran's garage.  Sorry for the blurry pic, I was having camera troubles.  All-in-all, this was a decent first day for a mostly city ride as I tried to get out of Seattle.  Only 2 people yelled at me from their cars and no one threw any garbage at me.  Yay!  It's progress...",
        "title" : "Day 1",
        "img" : "/img/seattle-maine-2013/5-30-13.jpg"
    },
    "5" : {
        "caption" : "",
        "include_post" : true,
        "id" : "5",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-30-13",
        "text" : "Oh the Suattle.  This brought back memories of the PCT.  The Suattle was a terrifying river crossing near Glacier Peak.  I was scared for my life as I scooted across the Suattle on a log.  Oh how I miss the PCT :)",
        "title" : "Day 1",
        "img" : "/img/seattle-maine-2013/5-30-13b.jpg"
    },
    "6" : {
        "caption" : "Rainy Pass",
        "include_post" : true,
        "id" : "6",
        "latitude" : "48.523",
        "longitude" : "-120.654",
        "date" : "5-31-13",
        "text" : "The PCT crosses the highway here at Rainy Pass, and when I left Seattle I was planning on camping up here and hiking a little bit just for old times sake.  As you can see, there was still just a wee bit of snow lingering around, so the hiking would have to wait for another day.  But will I ever be back on the PCT?!?  You never know what the future will bring, I guess we'll find out!",
        "title" : "Day 2",
        "img" : "/img/seattle-maine-2013/5-31-13.jpg"
    },
    "7" : {
        "caption" : "",
        "include_post" : true,
        "id" : "7",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-31-13",
        "text" : "Apparently it was really sunny up here?  I don't normally squint this much.",
        "title" : "Day 2",
        "img" : "/img/seattle-maine-2013/5-31-13b.jpg"
    },
    "8" : {
        "caption" : "Washington Pass",
        "include_post" : true,
        "id" : "8",
        "latitude" : "48.523",
        "longitude" : "-120.654",
        "date" : "5-31-13",
        "text" : "Washington Pass!  You just dip down a little after Rainy Pass and then it's right back up to this one.  2 passes for the price of one.",
        "title" : "Day 2",
        "img" : "/img/seattle-maine-2013/5-31-13c.jpg"
    },
    "9" : {
        "caption" : "The North Cascades",
        "include_post" : true,
        "id" : "9",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-31-13",
        "text" : "The north cascades were lovely, but I was expecting more.  I guess you have to hike up into them to really get the good stuff.",
        "title" : "Day 2",
        "img" : "/img/seattle-maine-2013/5-31-13d.jpg"
    },
    "10" : {
        "caption" : "",
        "include_post" : true,
        "id" : "10",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-31-13",
        "text" : "Camping on Day 2, in what I seem to remember was a totally empty campground.  Oh, I also crossed Loup Loup pass today as well.  3 passes in one day, that's a long day, I was probably really tired.",
        "title" : "Day 2",
        "img" : "/img/seattle-maine-2013/5-31-13e.jpg"
    },
    "11" : {
        "caption" : "",
        "include_post" : true,
        "id" : "11",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-1-13",
        "text" : "It got a little drier on the eastern side",
        "title" : "Day 3",
        "img" : "/img/seattle-maine-2013/6-1-13.jpg"
    },
    "12" : {
        "caption" : "",
        "include_post" : true,
        "id" : "12",
        "latitude" : "48.399",
        "longitude" : "-120.136",
        "date" : "6-1-13",
        "text" : "I biked into this town to find that they were throwing a spontaneous parade in my honor.  I was quite moved and so of course I did my best princess wave for them as I rolled down Main Street.  Sure, people were staring a little, but clearly it was because they had never seen a princess quite like me before.",
        "title" : "Day 3",
        "img" : "/img/seattle-maine-2013/6-1-13b.jpg"
    },
    "13" : {
        "caption" : "Wauconda Pass",
        "include_post" : true,
        "id" : "13",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-1-13",
        "text" : "The last 2 big passes for the Cascades:  Wauconda and Sherman Pass.  Yes, I did them both in one day.  Go big or go home.",
        "title" : "Day 3",
        "img" : "/img/seattle-maine-2013/6-1-13c.jpg"
    },
    "14" : {
        "caption" : "",
        "include_post" : true,
        "id" : "14",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-1-13",
        "text" : "On the way up to Sherman Pass I was really tired, it was getting late, and I almost stopped to camp at this little view point.  I'm pretty sure they would have frowned upon me camping here, but as my hiker friends say:  'it's only illegal if you get caught'",
        "title" : "Day 3",
        "img" : "/img/seattle-maine-2013/6-1-13d.jpg"
    },
    "15" : {
        "caption" : "Sherman Pass",
        "include_post" : true,
        "id" : "15",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-1-13",
        "text" : "I made it to Sherman Pass anyway, just as the sun was setting.  The only problem?  Where to camp....",
        "title" : "Day 3",
        "img" : "/img/seattle-maine-2013/6-1-13e.jpg"
    },
    "16" : {
        "caption" : "",
        "include_post" : true,
        "id" : "16",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-2-13",
        "text" : "There was suppose to be a campground on the downhill side of Sherman Pass, but I somehow missed it, and there was no way in hell I was climbing back up the mountain to try and find it.  So I did what any good thru-hiker would do:  I picked an old forest service road, went down it a few hundred yards, and set up camp.  Now, the observant among you may notice that I'm basically camped in the middle of the forest service road, and you would be correct.  I would not recommend this approach to the folks at home, but I'm a very specific kind of stupid, and I sometimes do things like this when I'm really tired and just don't care.  Someday it'll be my downfall, but today was not that day.",
        "title" : "Day 4",
        "img" : "/img/seattle-maine-2013/6-2-13.jpg"
    },
    "17" : {
        "caption" : "",
        "include_post" : true,
        "id" : "17",
        "latitude" : "48.256",
        "longitude" : "-116.597",
        "date" : "6-3-13",
        "text" : "Somewhere around Sandpoint, ID.  I was shocked at how green and beautiful northeast Washington and Idaho were.  I was expecting high desert, so this took me by surprise.",
        "title" : "Day 5",
        "img" : "/img/seattle-maine-2013/6-3-13.jpg"
    },
    "18" : {
        "caption" : "",
        "include_post" : true,
        "id" : "18",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-3-13",
        "text" : "Sandpoint is a great place.  It's in a lovely location, the city is nice, and I really like it here.",
        "title" : "Day 5",
        "img" : "/img/seattle-maine-2013/6-3-13b.jpg"
    },
    "19" : {
        "caption" : "Montana!",
        "include_post" : true,
        "id" : "19",
        "latitude" : "48.633",
        "longitude" : "-116.051",
        "date" : "6-3-13",
        "text" : "I somehow missed the Idaho sign.  Oh well, I rode through Idaho in a day, I don't even think I spent the night anywhere in Idaho.  That wasn't intentional, it just gets so darn narrow up there.",
        "title" : "Day 5",
        "img" : "/img/seattle-maine-2013/6-3-13c.jpg"
    },
    "20" : {
        "caption" : "a typical lunch",
        "include_post" : true,
        "id" : "20",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-4-13",
        "text" : "People always ask me what I eat on these trips, so I decided to take a picture of a typical lunch.  Let's see:  it looks like I had meatloaf, beans, an avocado, some apples, cranberries, etc.  I'm pretty sure there was a kiwi and a few pears that got eaten as appetizers.  This is actually fairly normal for me, I really don't eat just cereal, ice cream, and little debbie snacks, I promise.",
        "title" : "Day 6",
        "img" : "/img/seattle-maine-2013/6-4-13.jpg"
    },
    "21" : {
        "caption" : "",
        "include_post" : true,
        "id" : "21",
        "latitude" : "48.535",
        "longitude" : "-115.220",
        "date" : "6-4-13",
        "text" : "One of my prettiest campsites ever.  This was Lake Koocanusa, a gigantic lake courtesy of the Libby Dam.  This was a gorgeous campground that had only one other site occupied, and it only cost me 2 dollars.  2 dollars!  You get a discount if you arrive on bike.  I love government-run campgrounds, they are awesome towards bikers/hikers (usually, at least).",
        "title" : "Day 6",
        "img" : "/img/seattle-maine-2013/6-4-13b.jpg"
    },
    "22" : {
        "caption" : "Stone Hill",
        "include_post" : true,
        "id" : "22",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-5-13",
        "text" : "This is suppose to be a huge spot in Montana for rock climbers.  I didn't see any, which is too bad, I enjoy rock climbing.  Let me clarify that:  I enjoy *watching* rock climbing, I have almost zero desire to actually do it myself.",
        "title" : "Day 7",
        "img" : "/img/seattle-maine-2013/6-5-13.jpg"
    },
    "23" : {
        "caption" : "",
        "include_post" : true,
        "id" : "23",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-5-13",
        "text" : "I kept looking at this picture and trying to figure out why in the world I took it, it's not ugly, but it's not exactly dramatically pretty either.  Then I remembered, there were 2 bald eagles in that center tree.  You can't see them, but they were there.",
        "title" : "Day 7",
        "img" : "/img/seattle-maine-2013/6-5-13b.jpg"
    },
    "24" : {
        "caption" : "Glacier National Park",
        "include_post" : true,
        "id" : "24",
        "latitude" : "48.510",
        "longitude" : "-113.991",
        "date" : "6-5-13",
        "text" : "Riding into Glacier National Park is like coming home, I love this place so much :)",
        "title" : "Day 7",
        "img" : "/img/seattle-maine-2013/6-5-13c.jpg"
    },
    "25" : {
        "caption" : "Lake McDonald Lodge",
        "include_post" : true,
        "id" : "25",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "The inside of this place was pretty impressive, I mean, look at that chandelier... I had to hang out here for most of the day while I waited for the Going-to-the-Sun road to open.  I guess there are worse places to hang out for the day.",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13.jpg"
    },
    "26" : {
        "caption" : "",
        "include_post" : true,
        "id" : "26",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "2 Surly Disc Truckers?!?!?  What does it mean???",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13b.jpg"
    },
    "27" : {
        "caption" : "The Going-to-the-Sun Road",
        "include_post" : true,
        "id" : "27",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "This road cuts through the middle of GNP, and is incredible.  However, the pass at the top wasn't completely plowed yet, so the road was closed to cars, but they let bikers on it!  Oh my goodness, this was the best day ever.  This is one of the most spectacular roads you'll ever see, and I basically had it all to myself.  It's a narrow road with a rock wall on one side and a cliff on the other, so trying to bike it with cars would be quite dangerous and stressful.  Getting to bike it with no cars was the highlight of my trip and something that I will never forget.  Can you tell that I really enjoyed this day?",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13c.jpg"
    },
    "28" : {
        "caption" : "",
        "include_post" : true,
        "id" : "28",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13d.jpg"
    },
    "29" : {
        "caption" : "",
        "include_post" : true,
        "id" : "29",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13e.jpg"
    },
    "30" : {
        "caption" : "",
        "include_post" : true,
        "id" : "30",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "That right there is Logan Pass, the top of the road.  It was probably still an hour of biking from this point to get up there",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13f.jpg"
    },
    "31" : {
        "caption" : "",
        "include_post" : true,
        "id" : "31",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13g.jpg"
    },
    "32" : {
        "caption" : "",
        "include_post" : true,
        "id" : "32",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13h.jpg"
    },
    "33" : {
        "caption" : "",
        "include_post" : true,
        "id" : "33",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "I really wanted to sit up here and wait for sunset to get some extra gorgeous shots.  I didn't though, I figured trying to navigate a still-closed road in the dark might not be the best idea.",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13i.jpg"
    },
    "34" : {
        "caption" : "",
        "include_post" : true,
        "id" : "34",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "This was getting closer to the top of the pass.  You may be able to tell that there was still a little snow around, but at least the road was plowed.",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13j.jpg"
    },
    "35" : {
        "caption" : "Logan Pass",
        "include_post" : true,
        "id" : "35",
        "latitude" : "48.696",
        "longitude" : "-113.718",
        "date" : "6-6-13",
        "text" : "I figured that since the top of the pass was plowed that I would have no problem getting down the other side.  I was wrong.",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13k.jpg"
    },
    "36" : {
        "caption" : "",
        "include_post" : true,
        "id" : "36",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13l.jpg"
    },
    "37" : {
        "caption" : "",
        "include_post" : true,
        "id" : "37",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-6-13",
        "text" : "This is the road.  Obviously they had not finished plowing the eastern side of the pass.  At this point I had 2 options:  1. Turn around, go back down the mountain, and take a different highway around the south side of Glacier.  2. Say F*ck it, pick up the bike, carry it down the snowy eastern side, and *not* fall down a cliff in the process.  Guess which option I went with?!?  That's right, I picked my bike up and carried it down.  There was no way I was turning around after working so hard to get to the top.  Go big or go home.",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13m.jpg"
    },
    "38" : {
        "caption" : "Saint Mary Lake",
        "include_post" : true,
        "id" : "38",
        "latitude" : "48.711",
        "longitude" : "-113.489",
        "date" : "6-6-13",
        "text" : "I took about 100 pictures on the way up.  On the way down I took 2.  2!  That's it.  Not because it wasn't pretty, but it's really hard to convince yourself to stop when you're cruising down the mountain at top speed.",
        "title" : "Day 8",
        "img" : "/img/seattle-maine-2013/6-6-13n.jpg"
    },
    "39" : {
        "caption" : "Triple Divide Peak",
        "include_post" : true,
        "id" : "39",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-7-13",
        "text" : "Triple Divide Peak is barely visible here, it's a tiny bump on the ridge by that one mountain.  I'd point it out, but does anyone really care?  I just love triple divide though, it splits water between the Atlantic, Pacific, and Hudson Bay.  It's pretty neat.  I'm fairly sure that I hiked over it last summer.  It's such a different world, hiking I got to stand on top of that mountain, biking I got to read an informational sign about it.  One isn't better than the other, they're just different ways of seeing the world.",
        "title" : "Day 9",
        "img" : "/img/seattle-maine-2013/6-7-13.jpg"
    },
    "40" : {
        "caption" : "",
        "include_post" : true,
        "id" : "40",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-7-13",
        "text" : "My last shot of Glacier.  As I was riding away I kept turning around and it was always there.  I guess I just expected it to always be there, but eventually it was gone.  I wish I had known which look was going to be the last one.",
        "title" : "Day 9",
        "img" : "/img/seattle-maine-2013/6-7-13b.jpg"
    },
    "41" : {
        "caption" : "",
        "include_post" : true,
        "id" : "41",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-7-13",
        "text" : "It's amazing how quickly it goes from beautiful mountains to grassland.  This is only a few miles away from Glacier.",
        "title" : "Day 9",
        "img" : "/img/seattle-maine-2013/6-7-13c.jpg"
    },
    "42" : {
        "caption" : "",
        "include_post" : true,
        "id" : "42",
        "latitude" : "48.476",
        "longitude" : "-108.749",
        "date" : "6-7-13",
        "text" : "Awwww, my mangy reservation-dog buddy.  I stopped for lunch at this grocery store, and this mangy but cute dog was laying outside of it.  He walked over, said hi, sniffed my food for a minute and then laid back down to go to sleep.  Every once-in-a-while he would get up to beg a little, then go back to sleep when I didn't give him anything.  A few minutes later a pack of 5 dogs came up and I really thought I might be in trouble, but they just came over, sniffed a little, and went on their way.  *My* dog stayed behind.  I eventually gave him half of my lunch; I'm such a softie.  But I really wanted to pick him up and take him with me.",
        "title" : "Day 9",
        "img" : "/img/seattle-maine-2013/6-7-13d.jpg"
    },
    "43" : {
        "caption" : "",
        "include_post" : true,
        "id" : "43",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-7-13",
        "text" : "This was one of those 'Lewis and Clark were here' historical markers.  I love history, and the signs usually make very convenient places to take a pee.  I found this behind the sign and it made me laugh.",
        "title" : "Day 9",
        "img" : "/img/seattle-maine-2013/6-7-13e.jpg"
    },
    "44" : {
        "caption" : "",
        "include_post" : true,
        "id" : "44",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-10-13",
        "text" : "I don't know why I liked this picture, but there's something about it that I enjoy.",
        "title" : "Day 12",
        "img" : "/img/seattle-maine-2013/6-10-13.jpg"
    },
    "45" : {
        "caption" : "",
        "include_post" : true,
        "id" : "45",
        "latitude" : "48.082",
        "longitude" : "-106.168",
        "date" : "6-10-13",
        "text" : "Many parts of this trip were surprisingly green and lush.  They had just gotten lots of rain, that probably helped",
        "title" : "Day 12",
        "img" : "/img/seattle-maine-2013/6-10-13b.jpg"
    },
    "46" : {
        "caption" : "North Dakota",
        "include_post" : true,
        "id" : "46",
        "latitude" : "48.146",
        "longitude" : "-104.056",
        "date" : "6-10-13",
        "text" : "Yay!  North Dakota!  Montana is a big state, it took me over a week to bike through it ;)",
        "title" : "Day 12",
        "img" : "/img/seattle-maine-2013/6-10-13c.jpg"
    },
    "47" : {
        "caption" : "",
        "include_post" : true,
        "id" : "47",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-10-13",
        "text" : "You may be scratching your head, wondering why I took a picture of a water tower, but for me, this will always remind me of one of the best nights of the entire trip.  I was planning on camping at a little town just west of here, but the only camping was a private RV park, so I rolled up and asked if they had a spot.  They did, but it was 20 dollars and the RV park was basically a run-down, slightly sketchy trailer park.  No way in hell was I paying 20 dollars for the priviledge of setting up my tent next to an abandoned, rat-infested mobile home.  Ok, it really wasn't quite that bad, but I was annoyed.  So I left.  The next camping was 30 miles away, and the sun was setting, so what's a reckless biker to do?  I saw this water tower just off of the road on top of a hill, so I went up and slept there for the night.  I was treated to a gorgeous sunset, a million stars, and a neat lightning storm just far enough away to be pretty, but not close enough to be dangerous.  It was one of those moments where I wondered how I got to be where I was.  I could have been sitting on a couch somewhere watching tv, but instead was having a unique experience on a water tower in North Dakota.  Life is funny sometimes.",
        "title" : "Day 12",
        "img" : "/img/seattle-maine-2013/6-10-13d.jpg"
    },
    "48" : {
        "caption" : "Theodore Roosevelt National Park",
        "include_post" : true,
        "id" : "48",
        "latitude" : "46.931",
        "longitude" : "-103.561",
        "date" : "6-11-13",
        "text" : "North Dakota's Badlands.  They were really quite lovely and green, the park ranger said they were sopping wet, they had gotten something like 3/4 of their annual precipitation in the last 30 days.  It rained even more that night.  Lucky me.... This was suppose to be my 'rest' day, but instead of actually resting I rolled around the park loop checking it out.  Rest days should really be about resting, not riding around National Parks, but I get bored.  It's hard for me to sit in one spot when there's biking to be done.",
        "title" : "Day 13",
        "img" : "/img/seattle-maine-2013/6-11-13.jpg"
    },
    "49" : {
        "caption" : "",
        "include_post" : true,
        "id" : "49",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-11-13",
        "text" : "What do you do when there's a bison walking down the middle of the road towards you?  I did what any sensible person would do: I politely asked him to move out of my way.  And he did.  I guess bison listen to me?  Maybe I have some sort of secret power that allows bison to understand me?  Now the only question is:  will I use these powers for good or evil?!?",
        "title" : "Day 13",
        "img" : "/img/seattle-maine-2013/6-11-13b.jpg"
    },
    "50" : {
        "caption" : "",
        "include_post" : true,
        "id" : "50",
        "latitude" : "",
        "longitude" : "Overall, ND's Badlands were great, but clearly South Dakota's are WAY better.",
        "date" : "6-11-13",
        "text" : "",
        "title" : "Day 13",
        "img" : "/img/seattle-maine-2013/6-11-13c.jpg"
    },
    "51" : {
        "caption" : "The visitor's center at Painted Canyon",
        "include_post" : true,
        "id" : "51",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-12-13",
        "text" : "I stopped here to get a refrigerator magnet as a souvenir and almost ran right into this guy.  I didn't even notice him (that should tell you something about my observational skills).  You just don't expect to see a buffalo sitting outside of a visitor's center that also happens to be an interstate rest area.  It was early morning and the place was closed, so maybe he was waiting for the center to open up as well?  Perhaps he had important magnet-buying needs too.  We may never know.",
        "title" : "Day 14",
        "img" : "/img/seattle-maine-2013/6-12-13.jpg"
    },
    "52" : {
        "caption" : "New Salem",
        "include_post" : true,
        "id" : "52",
        "latitude" : "46.829",
        "longitude" : "-101.402",
        "date" : "6-12-13",
        "text" : "I can appreciate any town that puts a giant cow on the biggest hill outside of their town.  Stay classy, New Salem, stay classy.",
        "title" : "Day 14",
        "img" : "/img/seattle-maine-2013/6-12-13b.jpg"
    },
    "53" : {
        "caption" : "",
        "include_post" : true,
        "id" : "53",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-13-13",
        "text" : "Somewhere along the Missouri River",
        "title" : "Day 15",
        "img" : "/img/seattle-maine-2013/6-13-13.jpg"
    },
    "54" : {
        "caption" : "South Dakota",
        "include_post" : true,
        "id" : "54",
        "latitude" : "45.942",
        "longitude" : "-100.070",
        "date" : "6-14-13",
        "text" : "South Dakota!  I was so happy to see this sign, it seemed like every direction I rode in North Dakota I was facing a strong headwind.  My lowest mileage days were all in North Dakota.  Clearly ND hates me, and I have no idea why, I've only ever said lovely things about her.  Well, at least 90% of the things I've said are nice.  Ok, maybe 80%, but that's my final offer.  Regardless, ND has now become my newest arch-nemesis.  That's right, it's on.",
        "title" : "Day 16",
        "img" : "/img/seattle-maine-2013/6-14-13.jpg"
    },
    "55" : {
        "caption" : "Camping (legally) by Mina Lake",
        "include_post" : true,
        "id" : "55",
        "latitude" : "45.438",
        "longitude" : "-98.741",
        "date" : "6-14-13",
        "text" : "This was a fun night, because the people in the campsite across from mine came over to say hi and invited me over for a drink and some food.  I love it when random things like that happen.  It was no water tower, but still a pretty good evening!",
        "title" : "Day 16",
        "img" : "/img/seattle-maine-2013/6-14-13b.jpg"
    },
    "56" : {
        "caption" : "The end of Part 1",
        "include_post" : true,
        "id" : "56",
        "latitude" : "44.564",
        "longitude" : "-97.208",
        "date" : "6-15-13",
        "text" : "Back home in Lake Norden, SD.  And yes, that's a bag of Cap'n Crunch strapped to my bike.  Leave me alone... This was the end of part 1 of my crazy summer of fun.  Up next:  enjoy the 4th of July with my family, then back to Glacier National Park to finish hiking the CDT, and once that was over I planned to resume biking to Maine.",
        "title" : "Day 17",
        "img" : "/img/seattle-maine-2013/6-15-13.jpg"
    },
    "57" : {
        "caption" : "The beginning of Part 2!",
        "include_post" : true,
        "id" : "57",
        "latitude" : "45.398",
        "longitude" : "-92.646",
        "date" : "9-5-13",
        "text" : "If you had asked me on the last day of my CDT hike if I wanted to finish the bike tour, I would have said:  'Oh hell no!'  A week later I was riding east from SD.  How things change.  Interestingly, I rode through all of Minnesota and didn't take a single picture.  How strange.",
        "title" : "Day 18",
        "img" : "/img/seattle-maine-2013/9-5-13.jpg"
    },
    "58" : {
        "caption" : "Michigan",
        "include_post" : true,
        "id" : "58",
        "latitude" : "45.758",
        "longitude" : "-87.919",
        "date" : "9-8-13",
        "text" : "Then I apparently rode through all of Wisconsin and didn't take a single picture either.  What's wrong with me?  I swear that I actually did ride through these states.  Wisconsin was pretty too, lots of forests, lakes, farms.  I guess that sums up Minnesota too.",
        "title" : "Day 21",
        "img" : "/img/seattle-maine-2013/9-8-13.jpg"
    },
    "59" : {
        "caption" : "Lake Michigan",
        "include_post" : true,
        "id" : "59",
        "latitude" : "45.804",
        "longitude" : "-87.064",
        "date" : "9-10-13",
        "text" : "Finally, a real picture.  This is Lake Michigan!  Earlier this day, I stopped at a supermarket to pick up some food, which is not exactly shocking, I think I spend more time in grocery stores than anyplace else.  But then, a lady walks up and asks, 'Are you a biker tourer?'  Um, yes?  She then tells me: 'Would you talk to Bob, he likes that kind of thing'.  I should have known better, the red flags were flying, alarm bells were ringing, but at this point I was trapped and had no way out.  Bob turned out to be a shirtless ex-hippie who biked to Florida 30 years ago.  He proceeded to tell me all about it for an hour while his man-boobs quietly mocked me.  It wasn't pretty.  Bob was actually a nice guy, he just wouldn't... stop... talking...",
        "title" : "Day 22",
        "img" : "/img/seattle-maine-2013/9-10-13.jpg"
    },
    "60" : {
        "caption" : "Mackinaw City",
        "include_post" : true,
        "id" : "60",
        "latitude" : "45.855",
        "longitude" : "-84.744",
        "date" : "9-10-13",
        "text" : "You can see the Mackinaw bridge in the background.  No, I didn't bike over it, they don't let you, but they do very kindly throw your bike in the back of a truck and drive you to the other side",
        "title" : "Day 22",
        "img" : "/img/seattle-maine-2013/9-10-13b.jpg"
    },
    "61" : {
        "caption" : "Bay City, MI",
        "include_post" : true,
        "id" : "61",
        "latitude" : "43.596",
        "longitude" : "-83.954",
        "date" : "9-14-13",
        "text" : "Bay City, MI.  I also spent a few days in Midland with an old friend.  I really miss Michigan  :(",
        "title" : "Day 25",
        "img" : "/img/seattle-maine-2013/9-14-13.jpg"
    },
    "62" : {
        "caption" : "",
        "include_post" : true,
        "id" : "62",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-15-13",
        "text" : "For some reason I thought this was pretty.  From my journal entry for the day I wrote this (not necessarily about this particular spot, I just thought it was funny when I was re-reading it): 'I picked my route poorly, an area that I thought was going to be really pretty turned out to be a tacky, touristy, strip mall.  Complete with mini-golf.  Blah.'",
        "title" : "Day 26",
        "img" : "/img/seattle-maine-2013/9-15-13.jpg"
    },
    "63" : {
        "caption" : "A ferry to Canada",
        "include_post" : true,
        "id" : "63",
        "latitude" : "42.941",
        "longitude" : "-82.444",
        "date" : "9-15-13",
        "text" : "Can't you tell that's Canada in the distance?  It looks sooooo much different from Michigan.... For my last meal in the US, I ordered a pizza from Domino's, picked it up, couldn't find a park to eat it in, ended up sitting in a bank parking lot devouring a large veggie pie.  You do what you have to to survive.",
        "title" : "Day 26",
        "img" : "/img/seattle-maine-2013/9-15-13b.jpg"
    },
    "64" : {
        "caption" : "",
        "include_post" : true,
        "id" : "64",
        "latitude" : "42.594",
        "longitude" : "-80.490",
        "date" : "9-17-13",
        "text" : "One of those other Great Lakes.  I forget which one:  Erie?  Ontario?  Who knows.  Who cares.",
        "title" : "Day 28",
        "img" : "/img/seattle-maine-2013/9-17-13.jpg"
    },
    "65" : {
        "caption" : "",
        "include_post" : true,
        "id" : "65",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-17-13",
        "text" : "I'm a sucker for tree-lined bike paths",
        "title" : "Day 28",
        "img" : "/img/seattle-maine-2013/9-17-13b.jpg"
    },
    "66" : {
        "caption" : "",
        "include_post" : true,
        "id" : "66",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-18-13",
        "text" : "This was a neat little area.  It use to be some sort of amusement park or resort area or something like that.  People would take the ferry over from Buffalo in the early 1900's to spend the day, it was quite popular.  Now all that's left is rubble and a few foundations.  A quiet reminder that everything moves on, what's popular today will barely be a memory tomorrow.",
        "title" : "Day 29",
        "img" : "/img/seattle-maine-2013/9-18-13.jpg"
    },
    "67" : {
        "caption" : "Niagara Falls",
        "include_post" : true,
        "id" : "67",
        "latitude" : "43.096",
        "longitude" : "-79.064",
        "date" : "9-18-13",
        "text" : "I was dreading Niagara Falls, mainly because I was expecting massive hoardes of tourists, but if you come in September in the middle of the week, there are hardly any people around.  And the weather is still beautiful!  It was lovely here, I actually enjoyed it.  It was so nice and relaxing that I even wanted to do some of the many tourist activities.  The only problem:  what would I do with my bike?  I certainly couldn't leave it loaded up with all of my stuff and have it sitting along the road.  So sadly, I kept going.  Guess I'll have to go back someday to check out the flower clock.  Yes, that's a real thing.  The only thing I actually really wanted to tour was the hydro-electric generating station.  I'm such a dork.",
        "title" : "Day 29",
        "img" : "/img/seattle-maine-2013/9-18-13b.jpg"
    },
    "68" : {
        "caption" : "The Erie Canal",
        "include_post" : true,
        "id" : "68",
        "latitude" : "43.169",
        "longitude" : "-78.694",
        "date" : "9-18-13",
        "text" : "If you squint and don't look too closely, it can almost remind you of Europe.  The Erie Canal turned out to be one of my favorite sections of this entire trip.  I was just as surprised as you probably are.",
        "title" : "Day 29",
        "img" : "/img/seattle-maine-2013/9-18-13c.jpg"
    },
    "69" : {
        "caption" : "",
        "include_post" : true,
        "id" : "69",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-18-13",
        "text" : "I passed a LOT of apple farms on this trip.  Eventually I decided that I should probably take a picture of one.  I don't know why, they all look the same, but there you go:  apples.  Yay.",
        "title" : "Day 29",
        "img" : "/img/seattle-maine-2013/9-18-13d.jpg"
    },
    "70" : {
        "caption" : "",
        "include_post" : true,
        "id" : "70",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-18-13",
        "text" : "I don't know why, but this is one of my favorite pictures.  Don't judge me.",
        "title" : "Day 29",
        "img" : "/img/seattle-maine-2013/9-18-13e.jpg"
    },
    "71" : {
        "caption" : "",
        "include_post" : true,
        "id" : "71",
        "latitude" : "43.193",
        "longitude" : "-77.800",
        "date" : "9-19-13",
        "text" : "Pretty much the entire Erie Canal looked like this.  You may be wondering why I enjoyed it so much.  Here's why:  First, it had a bike path.  Sure, it wasn't paved, but it was still easily rideable.  The best part of a bike path:  no cars!  No fighting traffic!  That alone is glorious.  Second, there were lots of neat little towns along the way, and they usually had interesting histories.  Because there are only so many bridges across the canal, you always knew exactly where main street was.  You know how I like 'em easy.  Third, basically it was just a slow, easy, peaceful ride for a few days.... Priceless.",
        "title" : "Day 30",
        "img" : "/img/seattle-maine-2013/9-19-13.jpg"
    },
    "72" : {
        "caption" : "",
        "include_post" : true,
        "id" : "72",
        "latitude" : "43.805",
        "longitude" : "-74.682",
        "date" : "9-20-13",
        "text" : "Finally started to see some fall color in the Adirondacks",
        "title" : "Day 31",
        "img" : "/img/seattle-maine-2013/9-20-13.jpg"
    },
    "73" : {
        "caption" : "",
        "include_post" : true,
        "id" : "73",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-21-13",
        "text" : "Before you think about how lovely this is, I'm fairly sure that I stopped here to run off the road to take an emergency poop.  What can I say?  It happens.  Always, always, always carry easily accessible toilet paper.  And a spoon, but for entirely different reasons.",
        "title" : "Day 32",
        "img" : "/img/seattle-maine-2013/9-21-13.jpg"
    },
    "74" : {
        "caption" : "Ferry to Vermont",
        "include_post" : true,
        "id" : "74",
        "latitude" : "43.854",
        "longitude" : "-73.385",
        "date" : "9-21-13",
        "text" : "For a cross-country bike trip, I seem to spend a lot of time on boats.  I found that to be a little strange.",
        "title" : "Day 32",
        "img" : "/img/seattle-maine-2013/9-21-13b.jpg"
    },
    "75" : {
        "caption" : "",
        "include_post" : true,
        "id" : "75",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-22-13",
        "text" : "Totally unexpected, I just happened to stumble upon the Robert Frost Trail.  'But I... I have promises to keep.  And miles to go before I sleep.  And miles to go before I sleep.'",
        "title" : "Day 33",
        "img" : "/img/seattle-maine-2013/9-22-13.jpg"
    },
    "76" : {
        "caption" : "",
        "include_post" : true,
        "id" : "76",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-22-13",
        "text" : "This was much prettier in person.  This should be either in or just starting the Appalachian Mountains.  Don't let the tree-covered hills fool you, the roads through here are steep!",
        "title" : "Day 33",
        "img" : "/img/seattle-maine-2013/9-22-13b.jpg"
    },
    "77" : {
        "caption" : "",
        "include_post" : true,
        "id" : "77",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-23-13",
        "text" : "Near Mt. Moosilauke.  If you have the AT memorized, which I'm sure you all do, you'll know that Moosilauke is the start of the horrible, White Mountain section of the AT.  It's the hardest part of the trail, and always brings me to tears.  On a bike, it's not quite as bad.",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13.jpg"
    },
    "78" : {
        "caption" : "The AT!",
        "include_post" : true,
        "id" : "78",
        "latitude" : "44.040",
        "longitude" : "-71.791",
        "date" : "9-23-13",
        "text" : "I'd been waiting for days to cross this point.  I was expecting to see the trail, maybe hike down it a little, and you know, take a nice little stroll down memory lane.  Then I got here and it happened:  I didn't remember it.  Not this section at least.  It was just another path in the forest.  How sad is that?",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13b.jpg"
    },
    "79" : {
        "caption" : "Kancamagus Pass",
        "include_post" : true,
        "id" : "79",
        "latitude" : "44.023",
        "longitude" : "-71.492",
        "date" : "9-23-13",
        "text" : "The highest point (i think) east of the Rockies along my path.  The ride up here was actually not that bad, there were a lot of climbs earlier in Vermont and New Hampshire that were way way way worse.  Plus, at the top I met a super nice couple who were digging around in the forest for a geo-cache.  What're the odds?  They thought I was crazy.  I thought they were crazy.  It worked out well for us.",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13c.jpg"
    },
    "80" : {
        "caption" : "On the way down from the pass",
        "include_post" : true,
        "id" : "80",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-23-13",
        "text" : "Tourists at these little photo pull-outs kept asking me if they could take my picture.  Damn Paparazzi, always bugging me.  Can't they leave me alone long enough to finish a bike ride across the country?",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13d.jpg"
    },
    "81" : {
        "caption" : "",
        "include_post" : true,
        "id" : "81",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-23-13",
        "text" : "I was here before.  When I was working in Andover, MA.  I drove up here to see the fall colors.  I realized it as soon as I walked down to this river.  This I remember, but not the AT?  It's a cruel, cruel world.",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13e.jpg"
    },
    "82" : {
        "caption" : "",
        "include_post" : true,
        "id" : "82",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-23-13",
        "text" : "This is for Craig.  He suggested that I check out some cemeteries along the way, so as I was biking I saw this one and thought: 'Why not?'  As I was walking along I saw a gravestone for a guy who was part of the original Boston Tea Party in 17-- whatever.  How neat is that?  Just some random cememtery in New Hampshire.  Thanks Craig!  You may also notice that I parked my bike against a grave stone.  I didn't even notice that until I left.  Yup, I'm that kind of biker.",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13f.jpg"
    },
    "83" : {
        "caption" : "Maine",
        "include_post" : true,
        "id" : "83",
        "latitude" : "44.001",
        "longitude" : "-70.996",
        "date" : "9-23-13",
        "text" : "There weren't any signs for New York, Vermont, or New Hampshire.  Don't these states realize that I need to document my adventures?!?  How rude.  But anyway, here it is:  Maine.  The last one.  The end of the line, all I had to do was make it to Portland and I would be done.",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13g.jpg"
    },
    "84" : {
        "caption" : "",
        "include_post" : true,
        "id" : "84",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-23-13",
        "text" : "Sunset in Maine.  Sebago Lake.",
        "title" : "Day 34",
        "img" : "/img/seattle-maine-2013/9-23-13h.jpg"
    },
    "85" : {
        "caption" : "Portland, Maine",
        "include_post" : true,
        "id" : "85",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-24-13",
        "text" : "Random outdoor art in Portland?  I don't know, but it was quite useful as a place to lean a bike.  Hey, it's better than a grave.",
        "title" : "Day 35",
        "img" : "/img/seattle-maine-2013/9-24-13.jpg"
    },
    "86" : {
        "caption" : "Touching the Ocean",
        "include_post" : true,
        "id" : "86",
        "latitude" : "43.754",
        "longitude" : "-70.149",
        "date" : "9-24-13",
        "text" : "Yes, I was eating a bag of Cap'n Crunch at the same time I was finishing my historic bike ride and touching the Atlantic Ocean.  Leave me alone.",
        "title" : "Day 35",
        "img" : "/img/seattle-maine-2013/9-24-13b.jpg"
    },
    "87" : {
        "caption" : "",
        "include_post" : true,
        "id" : "87",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-24-13",
        "text" : "Yes!  A random foot!  I asked this tourist guy to take my picture and he had a little trouble with the camera, hence the random foot picture.  I love it.  I want to frame it, hang it on a wall somewhere, and watch the confused looks on people's faces when they try to figure out why I have a bad photo of a shoe hanging on my wall.",
        "title" : "Day 35",
        "img" : "/img/seattle-maine-2013/9-24-13c.jpg"
    },
    "88" : {
        "caption" : "Hello Atlantic Ocean!",
        "include_post" : true,
        "id" : "88",
        "latitude" : "43.667",
        "longitude" : "-70.239",
        "date" : "9-24-13",
        "text" : "That's it, the end of the line:  Portland, Maine",
        "title" : "Day 35",
        "img" : "/img/seattle-maine-2013/9-24-13d.jpg"
    },
    "89" : {
        "caption" : "",
        "include_post" : true,
        "id" : "89",
        "latitude" : "",
        "longitude" : "",
        "date" : "9-24-13",
        "text" : "The contemplative picture of me staring at the ocean.  What was I thinking about?  We'll never know, but there's a good chance it involved ice cream.",
        "title" : "Day 35",
        "img" : "/img/seattle-maine-2013/9-24-13e.jpg"
    },
    "90" : {
        "caption" : "Boston",
        "include_post" : true,
        "id" : "90",
        "latitude" : "42.357",
        "longitude" : "-71.094",
        "date" : "9-25-13",
        "text" : "In Boston, checking out my future alma mater.  After Portland, I took the train to Boston, had my bike boxed up and shipped out from REI (will never do that again, holy expensive), then took another train to Providence and flew back to Sioux Falls from there.  And that is the end of my first ever coast-to-coast bike trip.",
        "title" : "Day 36",
        "img" : "/img/seattle-maine-2013/9-25-13.jpg"
    }
}