{
    "1" : {
        "caption" : "",
        "include_post" : true,
        "id" : "1",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-6-11",
        "text" : "Awww, aren't we cute? The start of the road trip to the Mexican border. I never got a picture of Rya and Cooper, who also went along for the ride :(  For those of you who have no idea... In the summer of 2011 I was planning on hiking the CDT (which is a hiking trail that runs from the Mexican border to the Canadian border along the continental divide through New Mexico, Colorado, Wyoming, and Montana). After finishing the CDT I would have been done with the triple crown: the AT, PCT, and CDT. That was the goal. The CDT had a few things to say about it before it was all over and done with though.",
        "title" : "Day 0",
        "img" : "/img/cdt-2011/5-6-11.jpg"
    },
    "2" : {
        "caption" : "The Mexican Border",
        "include_post" : true,
        "id" : "2",
        "latitude" : "31.333",
        "longitude" : "-108.530",
        "date" : "5-7-11",
        "text" : "Antelope Wells! The Mexican border and the start of the CDT! Well, one of the starting points, there are 3 to choose from. THREE!!  That's ridiculous and overly complicated... We went with this one because it was the easiest one to get to.",
        "title" : "Day 1",
        "img" : "/img/cdt-2011/5-7-11.jpg"
    },
    "3" : {
        "caption" : "",
        "include_post" : true,
        "id" : "3",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-7-11",
        "text" : "Kelsi and Rob, they drove me all the way to Mexico :) Yes, they indeed did drop me off literally in the middle of nowhere, along the Mexican border, in 100 degree heat. Thanks Kels :)",
        "title" : "Day 1",
        "img" : "/img/cdt-2011/5-7-11b.jpg"
    },
    "4" : {
        "caption" : "",
        "include_post" : true,
        "id" : "4",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-7-11",
        "text" : "This was my view for the first 30 miles of 'trail'. Yes, the Antelope Wells border crossing was the easiest place to start, but certainly not the most scenic. I had to walk along this highway for ~30 miles to get to actual trail. It wasn't so bad, there was hardly any traffic and it had an odd sort of beauty to it.",
        "title" : "Day 1",
        "img" : "/img/cdt-2011/5-7-11c.jpg"
    },
    "5" : {
        "caption" : "",
        "include_post" : true,
        "id" : "5",
        "latitude" : "31.658",
        "longitude" : "-108.466",
        "date" : "5-7-11",
        "text" : "",
        "title" : "Day 1",
        "img" : "/img/cdt-2011/5-7-11d.jpg"
    },
    "6" : {
        "caption" : "",
        "include_post" : true,
        "id" : "6",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-9-11",
        "text" : "For those of you who are not familiar with the CDT, let me explain. The CDT is not really 'finished', it consists of a lot of roads, some similar to this one, some forest service roads, sometimes highways. Especially in NM. If you're lucky, there's trail to follow. Sometimes it's marked, usually it's not. Basically the CDT is a giant question mark, you're never really sure what you're going to get.  The AT and PCT were not like that, they are well-traveled, well-marked super highway-like hiking trails.  The CDT is more of a choose your own adventure type of trail, you can go wherever you want and do whatever you want.  That scares a lot of people.  Yes, I got lost while hiking the CDT, but eventually I always found my way.  You can't let the fear of the unknown stop you, you've gotta get out there and do the damn thing.  It's fun.  Well, sometimes it's fun, and sometimes you're huddled in a corner crying yourself to sleep.  That's the CDT.",
        "title" : "Day 3",
        "img" : "/img/cdt-2011/5-9-11.jpg"
    },
    "7" : {
        "caption" : "",
        "include_post" : true,
        "id" : "7",
        "latitude" : "32.629",
        "longitude" : "-108.316",
        "date" : "5-9-11",
        "text" : "A New Mexican desert water source! Yummy! Is it just me or does anyone else want to do a science experiment on this? Luckily I had enough water with me and didn't need to actually drink out of this, but if I had needed to, I wouldn't have even hesitated. Trust me, this was paradise compared to some of the sources later on. Let's just say they were closer to 'giant cow toilets' than anything else and leave it at that.",
        "title" : "Day 3",
        "img" : "/img/cdt-2011/5-9-11b.jpg"
    },
    "8" : {
        "caption" : "",
        "include_post" : true,
        "id" : "8",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-13-11",
        "text" : "Notice all of the 'No Trespassing' signs. I came through here from the other direction (after getting lost) and had absolutely no idea that I was on private land, I was just happily hiking along, totally oblivious.",
        "title" : "Day 7",
        "img" : "/img/cdt-2011/5-13-11.jpg"
    },
    "9" : {
        "caption" : "The first of MANY mistakes",
        "include_post" : true,
        "id" : "9",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-14-11",
        "text" : "This was a good day. Check out the little canyon behind me (there's a better view in the next picture). I had hiked up that to this point and from here on out got completely lost. I ended up miles away from where I was suppose to be. Yes, i had topographical maps, but the whole area was just little canyons like this one, so it was quite difficult to tell if I was in the 'right' canyon or some other canyon. Turns out I was in some other canyon. Oh well. I took this picture because I was so proud of myself for having gotten to this point by going cross-country (i.e. not having a trail to follow). Little did I know how wrong I was. I love that :)",
        "title" : "Day 8",
        "img" : "/img/cdt-2011/5-14-11.jpg"
    },
    "10" : {
        "caption" : "",
        "include_post" : true,
        "id" : "10",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-14-11",
        "text" : "",
        "title" : "Day 8",
        "img" : "/img/cdt-2011/5-14-11b.jpg"
    },
    "11" : {
        "caption" : "",
        "include_post" : true,
        "id" : "11",
        "latitude" : "33.683",
        "longitude" : "-108.173",
        "date" : "5-15-11",
        "text" : "The long road to nowhere",
        "title" : "Day 9",
        "img" : "/img/cdt-2011/5-15-11.jpg"
    },
    "12" : {
        "caption" : "",
        "include_post" : true,
        "id" : "12",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-17-11",
        "text" : "Another beautiful New Mexico sunset. They really were quite lovely and very frequent.",
        "title" : "Day 11",
        "img" : "/img/cdt-2011/5-17-11.jpg"
    },
    "13" : {
        "caption" : "The Toaster House",
        "include_post" : true,
        "id" : "13",
        "latitude" : "34.298",
        "longitude" : "-108.134",
        "date" : "5-17-11",
        "text" : "The toaster house! I loved this place. The lady who owns it basically lets anyone who wanders through Pie Town stay here if they want to. She's the best, and Pie Town does indeed have delicious pies.",
        "title" : "Day 11",
        "img" : "/img/cdt-2011/5-17-11b.jpg"
    },
    "14" : {
        "caption" : "",
        "include_post" : true,
        "id" : "14",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-18-11",
        "text" : "The people who owned this place were extremely nice (though I never actually met them). They left a little sign on the gate saying that hikers could come in and get water if they needed it. Easy water, you can't beat that in the desert. The horse, however, thought that as payment for taking water that he could eat my entire pack. Yet another reason why I don't like horses...",
        "title" : "Day 12",
        "img" : "/img/cdt-2011/5-18-11.jpg"
    },
    "15" : {
        "caption" : "",
        "include_post" : true,
        "id" : "15",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-19-11",
        "text" : "Yay!! I woke up one morning in just another NM canyon to find this. It was awesome, I loved this day, everything was so pretty. As with everything good, it only lasted one day and then was gone.",
        "title" : "Day 13",
        "img" : "/img/cdt-2011/5-19-11.jpg"
    },
    "16" : {
        "caption" : "",
        "include_post" : true,
        "id" : "16",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-19-11",
        "text" : "",
        "title" : "Day 13",
        "img" : "/img/cdt-2011/5-19-11b.jpg"
    },
    "17" : {
        "caption" : "",
        "include_post" : true,
        "id" : "17",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-19-11",
        "text" : "Best day ever. Look at how happy I am :)",
        "title" : "Day 13",
        "img" : "/img/cdt-2011/5-19-11c.jpg"
    },
    "18" : {
        "caption" : "",
        "include_post" : true,
        "id" : "18",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-19-11",
        "text" : "This was pretty neat. The official trail goes along a highway. Pfft, who wants that? Instead, you can climb up this and hike along the cliffs. The only problem comes later... You basically have to climb down a cliff to get back to where you are suppose to be. It was listed as 'easy' by the Ley Maps. Hmmm, yes, it perhaps would be easy for people who don't have crippling fears of heights and falling to their deaths while trying to climb down steep cliffs. It really probably wasn't that bad, I'm just a baby about stuff like that.",
        "title" : "Day 13",
        "img" : "/img/cdt-2011/5-19-11d.jpg"
    },
    "19" : {
        "caption" : "",
        "include_post" : true,
        "id" : "19",
        "latitude" : "34.869",
        "longitude" : "-107.888",
        "date" : "5-19-11",
        "text" : "La Ventana arch. The only natural arch in NM. I did not climb it.",
        "title" : "Day 13",
        "img" : "/img/cdt-2011/5-19-11e.jpg"
    },
    "20" : {
        "caption" : "",
        "include_post" : true,
        "id" : "20",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-19-11",
        "text" : "The Acoma-Zuni Trail! A neat little hike over some old lava beds. It was fun for the first few hours and you climb up and over lava boulders, cracks, canyons, etc. Lots of little twists and turns. After awhile it gets old though.",
        "title" : "Day 13",
        "img" : "/img/cdt-2011/5-19-11f.jpg"
    },
    "21" : {
        "caption" : "",
        "include_post" : true,
        "id" : "21",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-21-11",
        "text" : "In the distance is Mt Taylor.  Notice the snow, that's not a good sign.",
        "title" : "Day 15",
        "img" : "/img/cdt-2011/5-21-11.jpg"
    },
    "22" : {
        "caption" : "",
        "include_post" : true,
        "id" : "22",
        "latitude" : "35.238",
        "longitude" : "-107.608",
        "date" : "5-21-11",
        "text" : "At the top of Mt Taylor! I forget why this is such a big deal, but the 'official' trail goes around the mountain, but pretty much everyone climbs it anyway. It's an easy hike and pretty views at the top.",
        "title" : "Day 15",
        "img" : "/img/cdt-2011/5-21-11b.jpg"
    },
    "23" : {
        "caption" : "",
        "include_post" : true,
        "id" : "23",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-23-11",
        "text" : "",
        "title" : "Day 17",
        "img" : "/img/cdt-2011/5-23-11.jpg"
    },
    "24" : {
        "caption" : "",
        "include_post" : true,
        "id" : "24",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-23-11",
        "text" : "I spent the entire day hiking through stuff like this.  It was one of my favorite days in all of NM",
        "title" : "Day 17",
        "img" : "/img/cdt-2011/5-23-11b.jpg"
    },
    "25" : {
        "caption" : "",
        "include_post" : true,
        "id" : "25",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-23-11",
        "text" : "This was ridiculous. Take a look at the cairn. Yes, you need to climb over the fence along the cliff to continue along the trail. Who does that?",
        "title" : "Day 17",
        "img" : "/img/cdt-2011/5-23-11c.jpg"
    },
    "26" : {
        "caption" : "",
        "include_post" : true,
        "id" : "26",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-24-11",
        "text" : "My favorite method of camping in NM... throw your stuff on the ground and go to sleep.",
        "title" : "Day 18",
        "img" : "/img/cdt-2011/5-24-11.jpg"
    },
    "27" : {
        "caption" : "",
        "include_post" : true,
        "id" : "27",
        "latitude" : "35.708",
        "longitude" : "-107.253",
        "date" : "5-26-11",
        "text" : "It really is quite pretty at times",
        "title" : "Day 20",
        "img" : "/img/cdt-2011/5-26-11.jpg"
    },
    "28" : {
        "caption" : "",
        "include_post" : true,
        "id" : "28",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-26-11",
        "text" : "An actual river. It's amazing how happy you are to see something like this after hiking in the desert for a few weeks.",
        "title" : "Day 20",
        "img" : "/img/cdt-2011/5-26-11b.jpg"
    },
    "29" : {
        "caption" : "",
        "include_post" : true,
        "id" : "29",
        "latitude" : "36.313",
        "longitude" : "-106.482",
        "date" : "5-26-11",
        "text" : "This is the area where Georgia O'Keefe lived and painted some of her stuff. It was amazingly pretty with all of the colored rocks. Ghost Ranch was here too, a neat place to hang out and relax for a few days.",
        "title" : "Day 20",
        "img" : "/img/cdt-2011/5-26-11c.jpg"
    },
    "30" : {
        "caption" : "This is very typical in NM",
        "include_post" : true,
        "id" : "30",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-28-11",
        "text" : "In case you hadn't noticed yet, much of New Mexico is hiking along forest service roads like this one. It's both a blessing and a curse. Easy walking but not exactly backcountry beautiful. You'd be surprised how easy it was to still get lost even when hiking along a road. Don't believe me? Give it a try for yourself...",
        "title" : "Day 22",
        "img" : "/img/cdt-2011/5-28-11.jpg"
    },
    "31" : {
        "caption" : "",
        "include_post" : true,
        "id" : "31",
        "latitude" : "36.465",
        "longitude" : "-106.283",
        "date" : "5-29-11",
        "text" : "Good trail!  A rare sight in NM.  Plus, things were starting to get a lot greener, which means we're getting closer to Colorado!",
        "title" : "Day 23",
        "img" : "/img/cdt-2011/5-29-11.jpg"
    },
    "32" : {
        "caption" : "",
        "include_post" : true,
        "id" : "32",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-29-11",
        "text" : "Yes, I slept here, nestled up right in between the pine trees. I was probably also sleeping on several old, dried up cow patties, but we leave that stuff out of the tourist brochures.",
        "title" : "Day 23",
        "img" : "/img/cdt-2011/5-29-11b.jpg"
    },
    "33" : {
        "caption" : "",
        "include_post" : true,
        "id" : "33",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-30-11",
        "text" : "A pretty picture, but I remember this as being really, really windy, as in I was almost blown down the canyon.",
        "title" : "Day 24",
        "img" : "/img/cdt-2011/5-30-11.jpg"
    },
    "34" : {
        "caption" : "",
        "include_post" : true,
        "id" : "34",
        "latitude" : "36.761",
        "longitude" : "-106.192",
        "date" : "5-30-11",
        "text" : "The start of the snow. This is still New Mexico people. Sunny, warm, New Mexico. I should have known now that I was doomed.  At least there were lots of snow mobile tracks to pack everything down and keep us from postholing. The bad part is that there were snow mobile tracks in EVERY direction. Basically you just pick a direction, go, and hope you get lucky. Cause really, how in the world are you going to follow a trail or even a road in this?",
        "title" : "Day 24",
        "img" : "/img/cdt-2011/5-30-11b.jpg"
    },
    "35" : {
        "caption" : "",
        "include_post" : true,
        "id" : "35",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-30-11",
        "text" : "Me, annoyed at the snow. You can tell because I'm clearly annoyed, and there's snow.",
        "title" : "Day 24",
        "img" : "/img/cdt-2011/5-30-11c.jpg"
    },
    "36" : {
        "caption" : "",
        "include_post" : true,
        "id" : "36",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-30-11",
        "text" : "In the distance is Colorado. I was almost done with NM, but NM wasn't quite done with me yet.",
        "title" : "Day 24",
        "img" : "/img/cdt-2011/5-30-11d.jpg"
    },
    "37" : {
        "caption" : "",
        "include_post" : true,
        "id" : "37",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-30-11",
        "text" : "This is the fake Colorado.  Why was this the fake Colorado? Well, technically it was the real state line, the problem was that I followed the wrong road to get here, I was just so excited to finally be at the border that I stopped paying attention to my maps. That was a mistake. I thought, 'How many border crossings in this area can there be?' Turns out there are 2. One leads to a wide, raging river with no bridge that was impossible to cross on foot (or so I assumed, I didn't actually risk drowning to find out) and the other, correct border crossing, that leads to the highway at Cumbres Pass. Guess which one I took first? Yes, once again, I was very annoyed.",
        "title" : "Day 24",
        "img" : "/img/cdt-2011/5-30-11e.jpg"
    },
    "38" : {
        "caption" : "",
        "include_post" : true,
        "id" : "38",
        "latitude" : "37.020",
        "longitude" : "-106.45",
        "date" : "5-31-11",
        "text" : "Just before Cumbres Pass, you can smell Colorado from here :) This might even be CO, I'm not entirely sure.",
        "title" : "Day 25",
        "img" : "/img/cdt-2011/5-31-11.jpg"
    },
    "39" : {
        "caption" : "",
        "include_post" : true,
        "id" : "39",
        "latitude" : "",
        "longitude" : "",
        "date" : "5-31-11",
        "text" : "The real Colorado! I still look pretty annoyed. I was also injured at this point, so that didn't help the situation. This was the end of my time on the CDT for a bit, my leg was injured and I was hobbling around in tears, so I decided to hitch to Alamosa (which wasn't easy) and had Kelsi pick me up and save me from there. Plus there was the whole snow issue. It was not a good situation from any angle.",
        "title" : "Day 25",
        "img" : "/img/cdt-2011/5-31-11b.jpg"
    },
    "40" : {
        "caption" : "",
        "include_post" : true,
        "id" : "40",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-25-11",
        "text" : "One of the signs of a thru-hiker... Ignoring signs warning of impending doom and boldly hiking into the unknown. I really did ignore the sign. Dangerous trail conditions, please.",
        "title" : "Day 26",
        "img" : "/img/cdt-2011/6-25-11.jpg"
    },
    "41" : {
        "caption" : "",
        "include_post" : true,
        "id" : "41",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-26-11",
        "text" : "If you notice the date on these posts, it's about a month after the initial set.  I came back after a bit of a break to try again...",
        "title" : "Day 27",
        "img" : "/img/cdt-2011/6-26-11.jpg"
    },
    "42" : {
        "caption" : "",
        "include_post" : true,
        "id" : "42",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-26-11",
        "text" : "One of my favorite pictures",
        "title" : "Day 27",
        "img" : "/img/cdt-2011/6-26-11b.jpg"
    },
    "43" : {
        "caption" : "",
        "include_post" : true,
        "id" : "43",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-26-11",
        "text" : "As you can see, the snow kept getting worse and worse.",
        "title" : "Day 27",
        "img" : "/img/cdt-2011/6-26-11c.jpg"
    },
    "44" : {
        "caption" : "",
        "include_post" : true,
        "id" : "44",
        "latitude" : "37.460",
        "longitude" : "-106.886",
        "date" : "6-27-11",
        "text" : "The hiking may have sucked, but I will say this for traveling over snow, it was breathtakingly beautiful at times.",
        "title" : "Day 28",
        "img" : "/img/cdt-2011/6-27-11.jpg"
    },
    "45" : {
        "caption" : "",
        "include_post" : true,
        "id" : "45",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-28-11",
        "text" : "",
        "title" : "Day 29",
        "img" : "/img/cdt-2011/6-28-11.jpg"
    },
    "46" : {
        "caption" : "",
        "include_post" : true,
        "id" : "46",
        "latitude" : "37.970",
        "longitude" : "-106.972",
        "date" : "6-28-11",
        "text" : "San Luis Pass! This then officially connected me back with the Colorado Trail. My logic here was that since I hiked the colorado trail last year, and it's pretty much the same as the CDT, I wouldn't rehike it, I would just connect back up to it and move on with life. That was the plan anyway.",
        "title" : "Day 29",
        "img" : "/img/cdt-2011/6-28-11b.jpg"
    },
    "47" : {
        "caption" : "",
        "include_post" : true,
        "id" : "47",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-29-11",
        "text" : "The trail goes through here, I promise. Well, at least I went through here and just assumed there was a trail somewhere under that giant pile of crap. This went on for a mile or so.",
        "title" : "Day 30",
        "img" : "/img/cdt-2011/6-29-11.jpg"
    },
    "48" : {
        "caption" : "",
        "include_post" : true,
        "id" : "48",
        "latitude" : "",
        "longitude" : "",
        "date" : "6-30-11",
        "text" : "Moose!  Momma and baby.",
        "title" : "Day 31",
        "img" : "/img/cdt-2011/6-30-11.jpg"
    },
    "49" : {
        "caption" : "",
        "include_post" : true,
        "id" : "49",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-18-11",
        "text" : "The rest of these pictures are from after my bike ride. Once I made it to Seattle, I went back to Colorado and hiked the very southern section to finish that up, so all of this towards the end of summer when everything was beautiful, easy, and snow free. The way hiking should be.",
        "title" : "Day 32",
        "img" : "/img/cdt-2011/8-18-11.jpg"
    },
    "50" : {
        "caption" : "",
        "include_post" : true,
        "id" : "50",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-18-11",
        "text" : "The south San Juans. The next several pictures will be like this. It was all above treeline and, well, pick your adjective: gorgeous, amazing, unbelievable, it all applies. Hiking doesn't get much better than the San Juans when the trail is clear and the weather is good. That only happens for about one week out of the year though, so good luck with that if you're a thru-hiker ;)",
        "title" : "Day 32",
        "img" : "/img/cdt-2011/8-18-11b.jpg"
    },
    "51" : {
        "caption" : "",
        "include_post" : true,
        "id" : "51",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-18-11",
        "text" : "",
        "title" : "Day 32",
        "img" : "/img/cdt-2011/8-18-11c.jpg"
    },
    "52" : {
        "caption" : "",
        "include_post" : true,
        "id" : "52",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-19-11",
        "text" : "See that little cabin on the ridge? I spent the night in there, it was quite cozy and I found one of Sarah Palin's books in there. I tell ya, the strange things you run into when you're hiking!",
        "title" : "Day 33",
        "img" : "/img/cdt-2011/8-19-11.jpg"
    },
    "53" : {
        "caption" : "",
        "include_post" : true,
        "id" : "53",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-19-11",
        "text" : "",
        "title" : "Day 33",
        "img" : "/img/cdt-2011/8-19-11b.jpg"
    },
    "54" : {
        "caption" : "",
        "include_post" : true,
        "id" : "54",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-19-11",
        "text" : "",
        "title" : "Day 33",
        "img" : "/img/cdt-2011/8-19-11c.jpg"
    },
    "55" : {
        "caption" : "",
        "include_post" : true,
        "id" : "55",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-20-11",
        "text" : "Ha! I finally remembered why I took this picture... Ok, let's say you were hiking along and you got to this point, where would you go next? If you said along the trail right in front of you that sort of curves to the left, well, you'd be wrong. The actual trail is the secret option that goes to the right, you can sort of see just a little bit of it in that gap between the pine trees at about 1 o'clock.  Yup, that's the trail.  I don't know what this fake trail is, but of course I took it, because why would you even stop to question that?  And of course it abruptly stopped in the middle of nowhere after a few miles.  *sigh* it's just one of the many tricks the CDT likes to play.  Oh it likes to have its fun alright, and it won't stop until you're curled up in the fetal position crying for your momma.  You've been warned.",
        "title" : "Day 34",
        "img" : "/img/cdt-2011/8-20-11.jpg"
    },
    "56" : {
        "caption" : "",
        "include_post" : true,
        "id" : "56",
        "latitude" : "",
        "longitude" : "",
        "date" : "8-21-11",
        "text" : "Back at Wolf Creek Pass. This then officially ended my CDT attempt for 2011. I've now technically done the trail from the mexican border up to Silverthorne. Roughly half. Montana, Wyoming, and northern CO will have to wait for another day. Luckily I don't think the trail is going anywhere. It had to happen eventually, my hiking luck couldn't last forever, but on the plus side, I discovered a new love for cross-country biking, so something good came from this crushing defeat :)",
        "title" : "Day 35",
        "img" : "/img/cdt-2011/8-21-11.jpg"
    }
}